pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// bl602_demo_at_text_0008.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 2308034E: void tcp_connected_callback(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register ptr32 mstatus, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void tcp_connected_callback(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 mstatus, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a0 > 0x04)
	{
l23080376:
		__assert_func(ra, 0x230C5C44, s2, s6, s7, s8, s9);
	}
	Eq_2 a5_159;
	Eq_2 a4_157;
	ptr32 mstatus_112;
	Eq_2 s3_145;
	if (a2 != 0x00)
	{
		Eq_2 a2_44;
		Eq_2 a3_45;
		Eq_2 a4_46;
		ptr32 mstatus_50;
		Eq_2 s1_53;
		Eq_2 s3_57;
		Eq_2 a2_76;
		Eq_2 a3_77;
		Eq_2 a4_78;
		ptr32 mstatus_82;
		Eq_2 s1_85;
		word32 s2_88;
		Eq_2 s3_89;
		Eq_2 a2_106;
		Eq_2 a3_107;
		Eq_2 a4_108;
		Eq_2 a5_109;
		struct Eq_467615 * s3_119;
		word32 s11_575;
		word32 s10_574;
		word32 s9_573;
		word32 s8_572;
		word32 s7_571;
		word32 s6_570;
		word32 s5_569;
		word32 s4_568;
		word32 s2_567;
		word32 a1_566;
		word32 a0_565;
		word32 s1_564;
		word32 s0_563;
		word32 s11_562;
		word32 s8_559;
		word32 s9_560;
		word32 s10_561;
		word32 s7_558;
		word32 s4_555;
		word32 s5_556;
		word32 s6_557;
		word32 a0_552;
		word32 a1_553;
		word32 a5_554;
		word32 s10_549;
		word32 s11_550;
		word32 s0_551;
		word32 s7_546;
		word32 s8_547;
		word32 s9_548;
		word32 s4_543;
		word32 s5_544;
		word32 s6_545;
		word32 a1_540;
		word32 a5_541;
		word32 s2_542;
		word32 s0_538;
		word32 a0_539;
		Eq_2 ra_113 = at_dump_noend(at_dump_noend(at_dump_noend(ra, a0, 0x230C6900, a2, a3, a4, 0x42028000, mstatus, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_538, out s1_53, out a0_539, out a1_540, out a2_44, out a3_45, out a4_46, out a5_541, out s2_542, out s3_57, out s4_543, out s5_544, out s6_545, out s7_546, out s8_547, out s9_548, out s10_549, out s11_550, out mstatus_50), s1_53, 0x230C5DAC, a2_44, a3_45, a4_46, s3_57, mstatus_50, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_551, out s1_85, out a0_552, out a1_553, out a2_76, out a3_77, out a4_78, out a5_554, out s2_88, out s3_89, out s4_555, out s5_556, out s6_557, out s7_558, out s8_559, out s9_560, out s10_561, out s11_562, out mstatus_82), s1_85, s2_88 + -0x0700, a2_76, a3_77, a4_78, s3_89, mstatus_82, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_563, out s1_564, out a0_565, out a1_566, out a2_106, out a3_107, out a4_108, out a5_109, out s2_567, out s3_119, out s4_568, out s5_569, out s6_570, out s7_571, out s8_572, out s9_573, out s10_574, out s11_575, out mstatus_112);
		Eq_2 a0_135;
		Eq_2 a1_136;
		word32 s1_143;
		Eq_2 s2_144;
		word32 s8_581;
		word32 s4_580;
		word32 a5_579;
		word32 a4_578;
		word32 a3_577;
		word32 a2_576;
		xQueueSemaphoreTake(s3_119->t00EC, ~0x00, a2_106, a3_107, a4_108, a5_109, mstatus_112, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_143, out a0_135, out a1_136, out a2_576, out a3_577, out a4_578, out a5_579, out s2_144, out s3_145, out s4_580, out s8_581);
		struct Eq_467754 * s0_152 = *((word32) a0_135 + 48);
		s0_152->b0038 = 0x00;
		word32 a5_582;
		Eq_2 a0_154 = altcp_close(a0_135, 56, out a5_582);
		a4_157 = (word32) s0_152->b0018;
		s0_152->dw0030 = 0x00;
		a5_159.u0 = 0x03;
		if (a4_157 == 0x03)
		{
			word32 s1_627;
			word32 s2_628;
			word32 s4_629;
			altcp_tls_free_config(ra_113, s1_143 + 56, a0_154, a1_136, 0x03, s2_144, s3_145, mstatus_112, dwLoc2C, dwLoc28, s2, dwLoc0C, dwArg54, dwArg74, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_627, out a4_157, out a5_159, out s2_628, out s3_145, out s4_629)->dw0034 = 0x00;
		}
		goto l23080422;
	}
	ptr32 mstatus_267;
	Eq_2 a4_263;
	Eq_2 a3_262;
	Eq_2 a2_261;
	Eq_2 s1_270;
	Eq_2 ra_268;
	Eq_2 s3_274;
	word32 s2_273;
	Eq_2 a3_192;
	Eq_2 s1_197;
	Eq_2 s3_199;
	word32 s4_587;
	word32 a5_586;
	word32 a4_585;
	word32 a1_584;
	word32 a0_583;
	Eq_2 a2_191;
	struct Eq_467800 * s0_207 = (word32) xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, 0x04, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_197, out a0_583, out a1_584, out a2_191, out a3_192, out a4_585, out a5_586, out s2, out s3_199, out s4_587, out s8) + ((word32) s1_197 + 56);
	Eq_2 a4_208 = (word32) s0_207->b0018;
	s0_207->b0038 = 0x03;
	if (a4_208 == 0x03)
	{
		Eq_2 a0_212 = altcp_tls_context((word32) s2 - 0x0700);
		if (a0_212 == 0x00)
			goto l23080376;
		Eq_2 a0_213 = mbedtls_ssl_get_alpn_protocol(a0_212);
		a2_191 = a0_213;
		if (a0_213 != 0x00)
		{
			Eq_2 a3_291;
			Eq_2 a4_292;
			ptr32 mstatus_296;
			Eq_2 s1_299;
			Eq_2 s3_303;
			word32 s0_644;
			word32 a0_645;
			word32 a1_646;
			word32 a2_647;
			word32 a5_648;
			word32 s2_649;
			word32 s4_650;
			word32 s5_651;
			word32 s6_652;
			word32 s7_653;
			word32 s8_654;
			word32 s9_655;
			word32 s10_656;
			word32 s11_657;
			word32 s0_658;
			word32 a0_659;
			word32 a1_660;
			word32 a5_661;
			word32 s4_662;
			word32 s5_663;
			word32 s6_664;
			word32 s7_665;
			word32 s8_666;
			word32 s9_667;
			word32 s10_668;
			word32 s11_669;
			ra_268 = at_dump_noend(at_dump_noend(ra, s1_197, (word32) s2 - 0x0700, a0_213, a3_192, a4_208, s3_199, mstatus, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_644, out s1_299, out a0_645, out a1_646, out a2_647, out a3_291, out a4_292, out a5_648, out s2_649, out s3_303, out s4_650, out s5_651, out s6_652, out s7_653, out s8_654, out s9_655, out s10_656, out s11_657, out mstatus_296), s1_299, 588012928, a0_213, a3_291, a4_292, s3_303, mstatus_296, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_658, out s1_270, out a0_659, out a1_660, out a2_261, out a3_262, out a4_263, out a5_661, out s2_273, out s3_274, out s4_662, out s5_663, out s6_664, out s7_665, out s8_666, out s9_667, out s10_668, out s11_669, out mstatus_267);
l230803FE:
			Eq_2 s4_377;
			word32 s0_630;
			word32 s1_631;
			word32 a0_632;
			word32 a1_633;
			word32 a2_634;
			word32 a3_635;
			word32 s2_636;
			word32 s5_637;
			word32 s6_638;
			word32 s7_639;
			word32 s8_640;
			word32 s9_641;
			word32 s10_642;
			word32 s11_643;
			at_dump_noend(ra_268, s1_270, s2_273 + -0x0700, a2_261, a3_262, a4_263, s3_274, mstatus_267, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_630, out s1_631, out a0_632, out a1_633, out a2_634, out a3_635, out a4_157, out a5_159, out s2_636, out s3_145, out s4_377, out s5_637, out s6_638, out s7_639, out s8_640, out s9_641, out s10_642, out s11_643, out mstatus_112);
			altcp_recv(s4_377, &g_t230804AC);
			altcp_sent(s4_377, &g_t23080254);
l23080422:
			word32 s1_613;
			word32 a0_614;
			word32 a1_615;
			word32 a2_616;
			word32 a3_617;
			word32 a4_618;
			word32 a5_619;
			word32 a7_620;
			word32 s2_621;
			word32 s3_622;
			word32 s4_623;
			word32 s5_624;
			word32 s6_625;
			word32 s8_626;
			xQueueGenericSend(*((word32) s3_145 + 0x00EC), 0x00, 0x00, a4_157, a5_159, mstatus_112, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_613, out a0_614, out a1_615, out a2_616, out a3_617, out a4_618, out a5_619, out a7_620, out s2_621, out s3_622, out s4_623, out s5_624, out s6_625, out s8_626);
			0x00 = (int8) dwArg0128;
			return;
		}
	}
	Eq_2 a2_229;
	Eq_2 a3_230;
	Eq_2 a4_231;
	ptr32 mstatus_235;
	Eq_2 s1_238;
	Eq_2 s3_242;
	word32 s0_588;
	word32 a0_589;
	word32 a1_590;
	word32 a5_591;
	word32 s2_592;
	word32 s4_593;
	word32 s5_594;
	word32 s6_595;
	word32 s7_596;
	word32 s8_597;
	word32 s9_598;
	word32 s10_599;
	word32 s11_600;
	word32 s0_601;
	word32 a0_602;
	word32 a1_603;
	word32 a5_604;
	word32 s4_605;
	word32 s5_606;
	word32 s6_607;
	word32 s7_608;
	word32 s8_609;
	word32 s9_610;
	word32 s10_611;
	word32 s11_612;
	ra_268 = at_dump_noend(at_dump_noend(ra, s1_197, (word32) s2 - 0x0700, a2_191, a3_192, a4_208, s3_199, mstatus, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_588, out s1_238, out a0_589, out a1_590, out a2_229, out a3_230, out a4_231, out a5_591, out s2_592, out s3_242, out s4_593, out s5_594, out s6_595, out s7_596, out s8_597, out s9_598, out s10_599, out s11_600, out mstatus_235), s1_238, 588012952, a2_229, a3_230, a4_231, s3_242, mstatus_235, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_601, out s1_270, out a0_602, out a1_603, out a2_261, out a3_262, out a4_263, out a5_604, out s2_273, out s3_274, out s4_605, out s5_606, out s6_607, out s7_608, out s8_609, out s9_610, out s10_611, out s11_612, out mstatus_267);
	goto l230803FE;
}

