pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230804AC: void tcp_receive_callback(Register Eq_2 ra, Register Eq_2 s0, Register int32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register ptr32 mstatus, Stack word32 dwArg08, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void tcp_receive_callback(Eq_2 ra, Eq_2 s0, int32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 mstatus, word32 dwArg08, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a0 <= 0x04)
	{
		Eq_2 a2_44;
		Eq_2 a3_45;
		Eq_2 s1_50;
		Eq_2 s3_52;
		word32 s4_53;
		word32 s8_771;
		word32 s2_770;
		word32 a0_766;
		word32 a1_767;
		word32 a4_768;
		word32 a5_769;
		xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, 0x04, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_50, out a0_766, out a1_767, out a2_44, out a3_45, out a4_768, out a5_769, out s2_770, out s3_52, out s4_53, out s8_771);
		if ((word32) *((word32) s1_50 + 1107411872) != 0x03)
		{
			Eq_2 a5_565;
			Eq_2 a4_570;
			struct Eq_468214 * s3_577;
			word32 a2_775;
			word32 a1_774;
			word32 a0_773;
			word32 s1_772;
			word32 a3_776;
			word32 a7_777;
			word32 s2_778;
			word32 s4_779;
			word32 s5_780;
			word32 s6_781;
			word32 s7_782;
			word32 s8_783;
			word32 s9_784;
			word32 s10_785;
			word32 s11_786;
			word32 t4_787;
			printf(ra, &g_t230C5E4C, a3_45, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_772, out a0_773, out a1_774, out a2_775, out a3_776, out a4_570, out a5_565, out a7_777, out s2_778, out s3_577, out s4_779, out s5_780, out s6_781, out s7_782, out s8_783, out s9_784, out s10_785, out s11_786, out t4_787);
			word32 s1_788;
			word32 a0_789;
			word32 a1_790;
			word32 a2_791;
			word32 a3_792;
			word32 a4_793;
			word32 a5_794;
			word32 a7_795;
			word32 s2_796;
			word32 s3_797;
			word32 s4_798;
			word32 s5_799;
			word32 s6_800;
			word32 s8_801;
			xQueueGenericSend(s3_577->t00EC, 0x00, 0x00, a4_570, a5_565, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_788, out a0_789, out a1_790, out a2_791, out a3_792, out a4_793, out a5_794, out a7_795, out s2_796, out s3_797, out s4_798, out s5_799, out s6_800, out s8_801);
		}
		else if (s4_53 == 0x00)
		{
			*((word32) s1_50 + 1107411872) = 0x00;
			Eq_2 a2_407;
			Eq_2 a3_408;
			Eq_2 a4_409;
			ptr32 mstatus_413;
			Eq_2 s1_416;
			Eq_2 s3_420;
			Eq_2 a2_439;
			Eq_2 a3_440;
			Eq_2 a4_441;
			ptr32 mstatus_445;
			Eq_2 s1_448;
			word32 s2_451;
			Eq_2 s3_452;
			Eq_2 a0_467;
			Eq_2 a1_468;
			Eq_2 a5_472;
			ptr32 mstatus_475;
			Eq_2 s1_478;
			Eq_2 s2_481;
			Eq_2 s3_482;
			Eq_2 s5_484;
			struct Eq_468622 * s7_486;
			word32 s0_888;
			word32 a0_889;
			word32 a1_890;
			word32 a5_891;
			word32 s2_892;
			word32 s4_893;
			word32 s5_894;
			word32 s6_895;
			word32 s7_896;
			word32 s8_897;
			word32 s9_898;
			word32 s10_899;
			word32 s11_900;
			word32 s0_901;
			word32 a0_902;
			word32 a1_903;
			word32 a5_904;
			word32 s4_905;
			word32 s5_906;
			word32 s6_907;
			word32 s7_908;
			word32 s8_909;
			word32 s9_910;
			word32 s10_911;
			word32 s11_912;
			word32 s0_913;
			word32 a2_914;
			word32 a3_915;
			word32 s4_916;
			word32 s6_917;
			word32 s8_918;
			word32 s9_919;
			word32 s10_920;
			word32 s11_921;
			Eq_2 a4_471;
			Eq_2 ra_476 = at_dump_noend(at_dump_noend(at_dump_noend(ra, s1_50, 0x230C6900, a2_44, a3_45, 0x4201C000, s3_52, mstatus, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_888, out s1_416, out a0_889, out a1_890, out a2_407, out a3_408, out a4_409, out a5_891, out s2_892, out s3_420, out s4_893, out s5_894, out s6_895, out s7_896, out s8_897, out s9_898, out s10_899, out s11_900, out mstatus_413), s1_416, 588012988, a2_407, a3_408, a4_409, s3_420, mstatus_413, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_901, out s1_448, out a0_902, out a1_903, out a2_439, out a3_440, out a4_441, out a5_904, out s2_451, out s3_452, out s4_905, out s5_906, out s6_907, out s7_908, out s8_909, out s9_910, out s10_911, out s11_912, out mstatus_445), s1_448, s2_451 + -0x0700, a2_439, a3_440, a4_441, s3_452, mstatus_445, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_913, out s1_478, out a0_467, out a1_468, out a2_914, out a3_915, out a4_471, out a5_472, out s2_481, out s3_482, out s4_916, out s5_484, out s6_917, out s7_486, out s8_918, out s9_919, out s10_920, out s11_921, out mstatus_475);
			struct Eq_468727 * s0_496 = *((word32) a0_467 + 48);
			word32 a5_922;
			Eq_2 a0_497 = altcp_close(a0_467, a5_472, out a5_922);
			Eq_2 a5_500 = (word32) s0_496->b0018;
			s0_496->dw0030 = 0x00;
			if (a5_500 == s5_484)
			{
				word32 s1_937;
				word32 s2_938;
				word32 s3_939;
				word32 s4_940;
				altcp_tls_free_config(ra_476, s1_478, a0_497, a1_468, a5_500, s2_481, s3_482, mstatus_475, dwLoc2C, s6, s2, dwLoc0C, s7, dwArg74, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_937, out a4_471, out a5_500, out s2_938, out s3_939, out s4_940)->dw0034 = 0x00;
			}
			word32 s1_923;
			word32 a0_924;
			word32 a1_925;
			word32 a2_926;
			word32 a3_927;
			word32 a4_928;
			word32 a5_929;
			word32 a7_930;
			word32 s2_931;
			word32 s3_932;
			word32 s4_933;
			word32 s5_934;
			word32 s6_935;
			word32 s8_936;
			xQueueGenericSend(s7_486->t00EC, 0x00, 0x00, a4_471, a5_500, mstatus_475, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_923, out a0_924, out a1_925, out a2_926, out a3_927, out a4_928, out a5_929, out a7_930, out s2_931, out s3_932, out s4_933, out s5_934, out s6_935, out s8_936);
		}
		else
		{
			Eq_2 a2_73;
			Eq_2 a3_74;
			Eq_2 a4_75;
			Eq_2 s1_80;
			word32 a0_802;
			word32 a1_803;
			word32 a5_804;
			word32 a7_805;
			word32 s2_806;
			word32 s3_807;
			word32 s4_808;
			word32 s5_809;
			word32 s6_810;
			word32 s8_811;
			xQueueGenericSend(*((word32) s3_52 + 0x00EC), 0x00, 0x00, 0x4201C000, 0x03, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_80, out a0_802, out a1_803, out a2_73, out a3_74, out a4_75, out a5_804, out a7_805, out s2_806, out s3_807, out s4_808, out s5_809, out s6_810, out s8_811);
			Eq_2 a2_96;
			Eq_2 a3_97;
			Eq_2 a4_98;
			Eq_2 s1_101;
			word32 s2_102;
			Eq_2 s3_103;
			Eq_2 a2_121;
			Eq_2 a3_122;
			Eq_2 a4_123;
			ptr32 mstatus_127;
			Eq_2 s1_130;
			Eq_2 s3_134;
			Eq_2 a2_152;
			Eq_2 a3_153;
			Eq_2 a4_154;
			ptr32 mstatus_158;
			Eq_2 s1_161;
			word32 s2_164;
			Eq_2 s3_165;
			Eq_2 a2_182;
			Eq_2 a3_183;
			Eq_2 a4_184;
			ptr32 mstatus_188;
			Eq_2 s1_191;
			word32 s2_194;
			Eq_2 s3_195;
			Eq_2 a3_213;
			Eq_2 a4_214;
			ptr32 mstatus_218;
			Eq_2 s1_221;
			Eq_2 s3_225;
			struct Eq_468357 * s4_226;
			Eq_2 a2_245;
			Eq_2 a3_246;
			Eq_2 a4_247;
			ptr32 mstatus_251;
			Eq_2 s1_254;
			word32 s2_257;
			Eq_2 s3_258;
			word32 s0_812;
			word32 a0_813;
			word32 a1_814;
			word32 a5_815;
			word32 s2_816;
			word32 s4_817;
			word32 s5_818;
			word32 s6_819;
			word32 s7_820;
			word32 s8_821;
			word32 s9_822;
			word32 s10_823;
			word32 s11_824;
			word32 s0_825;
			word32 a0_826;
			word32 a1_827;
			word32 a5_828;
			word32 s4_829;
			word32 s5_830;
			word32 s6_831;
			word32 s7_832;
			word32 s8_833;
			word32 s9_834;
			word32 s10_835;
			word32 s11_836;
			word32 s0_837;
			word32 a0_838;
			word32 a1_839;
			word32 a5_840;
			word32 s4_841;
			word32 s5_842;
			word32 s6_843;
			word32 s7_844;
			word32 s8_845;
			word32 s9_846;
			word32 s10_847;
			word32 s11_848;
			word32 s0_849;
			word32 a0_850;
			word32 a1_851;
			word32 a2_852;
			word32 a5_853;
			word32 s2_854;
			word32 s5_855;
			word32 s6_856;
			word32 s7_857;
			word32 s8_858;
			word32 s9_859;
			word32 s10_860;
			word32 s11_861;
			word32 s0_862;
			word32 a0_863;
			word32 a1_864;
			word32 a5_865;
			word32 s4_866;
			word32 s5_867;
			word32 s6_868;
			word32 s7_869;
			word32 s8_870;
			word32 s9_871;
			word32 s10_872;
			word32 s11_873;
			word32 s0_874;
			word32 s1_875;
			word32 a1_876;
			word32 a5_877;
			word32 s2_878;
			word32 s3_879;
			word32 s4_880;
			word32 s5_881;
			word32 s6_882;
			word32 s7_883;
			word32 s8_884;
			word32 s9_885;
			word32 s10_886;
			word32 s11_887;
			Eq_2 a0_273;
			ptr32 mstatus_281;
			Eq_2 a4_277;
			Eq_2 a3_276;
			Eq_2 a2_275;
			Eq_2 ra_282 = at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_serial_lock(ra, s1_80, a2_73, a3_74, a4_75, mstatus, dwLoc2C, dwLoc18, dwLoc08, dwArg30, dwArg34, s7, s5, dwArg7C, dwArgC8, dwArg0108, out s1_101, out a2_96, out a3_97, out a4_98, out s2_102, out s3_103), s1_101, s2_102 + -0x0700, a2_96, a3_97, a4_98, s3_103, mstatus, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_812, out s1_130, out a0_813, out a1_814, out a2_121, out a3_122, out a4_123, out a5_815, out s2_816, out s3_134, out s4_817, out s5_818, out s6_819, out s7_820, out s8_821, out s9_822, out s10_823, out s11_824, out mstatus_127), s1_130, 0x230C5DCC, a2_121, a3_122, a4_123, s3_134, mstatus_127, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_825, out s1_161, out a0_826, out a1_827, out a2_152, out a3_153, out a4_154, out a5_828, out s2_164, out s3_165, out s4_829, out s5_830, out s6_831, out s7_832, out s8_833, out s9_834, out s10_835, out s11_836, out mstatus_158), s1_161, s2_164 + -0x0700, a2_152, a3_153, a4_154, s3_165, mstatus_158, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_837, out s1_191, out a0_838, out a1_839, out a2_182, out a3_183, out a4_184, out a5_840, out s2_194, out s3_195, out s4_841, out s5_842, out s6_843, out s7_844, out s8_845, out s9_846, out s10_847, out s11_848, out mstatus_188), s1_191, s2_194 + -0x0700, a2_182, a3_183, a4_184, s3_195, mstatus_188, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_849, out s1_221, out a0_850, out a1_851, out a2_852, out a3_213, out a4_214, out a5_853, out s2_854, out s3_225, out s4_226, out s5_855, out s6_856, out s7_857, out s8_858, out s9_859, out s10_860, out s11_861, out mstatus_218), s1_221, 588013012, (word32) s4_226->w0008, a3_213, a4_214, s3_225, mstatus_218, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_862, out s1_254, out a0_863, out a1_864, out a2_245, out a3_246, out a4_247, out a5_865, out s2_257, out s3_258, out s4_866, out s5_867, out s6_868, out s7_869, out s8_870, out s9_871, out s10_872, out s11_873, out mstatus_251), s1_254, s2_257 + -0x0700, a2_245, a3_246, a4_247, s3_258, mstatus_251, dwLoc2C, s2, s0, dwLoc18, dwArg2C, dwArg30, dwArg34, s5, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_874, out s1_875, out a0_273, out a1_876, out a2_275, out a3_276, out a4_277, out a5_877, out s2_878, out s3_879, out s4_880, out s5_881, out s6_882, out s7_883, out s8_884, out s9_885, out s10_886, out s11_887, out mstatus_281);
			do
			{
				word32 * s0_307 = *((word32) a0_273 + 4);
				word32 s1_941;
				word32 s4_942;
				ra_282 = at_data_output(ra_282, a0_273, a2_275, a3_276, a4_277, mstatus_281, dwLoc2C, dwLoc18, dwLoc08, dwArg08, dwArg30, dwArg34, s7, s5, dwArg7C, dwArgC8, dwArg0108, out s1_941, out a0_273, out a2_275, out a3_276, out a4_277, out s4_942, out mstatus_281);
			} while (*s0_307 != 0x00);
			int32 a0_343;
			Eq_2 a3_346;
			Eq_2 a4_347;
			Eq_2 s4_354;
			word32 a2_943;
			word32 a5_944;
			word32 s3_945;
			Eq_2 ra_365 = at_serial_unlock(ra_282, a4_277, mstatus_281, dwLoc2C, dwLoc18, dwLoc08, dwArg30, dwArg34, s7, s5, dwArg7C, dwArgC8, dwArg0108, dwArg0148, out a0_343, out a2_943, out a3_346, out a4_347, out a5_944, out s3_945, out s4_354);
			word32 a5_946;
			altcp_recved(a0_343, 56, out a5_946);
			word32 s0_947;
			word32 s1_948;
			word32 a0_949;
			word32 a1_950;
			word32 a2_951;
			word32 a3_952;
			word32 a4_953;
			word32 a5_954;
			word32 a7_955;
			word32 s2_956;
			word32 s3_957;
			word32 s4_958;
			word32 s5_959;
			word32 s6_960;
			word32 s8_961;
			word32 mstatus_962;
			pbuf_free(ra_365, s4_354, a3_346, a4_347, s4_354, mstatus_281, dwArgF8, out s0_947, out s1_948, out a0_949, out a1_950, out a2_951, out a3_952, out a4_953, out a5_954, out a7_955, out s2_956, out s3_957, out s4_958, out s5_959, out s6_960, out s8_961, out mstatus_962);
		}
		0x00 = (int8) dwArg0128;
	}
	else
		__assert_func(ra, 0x230C5C04, s2, s6, s7, s8, s9);
}

