pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23080626: Register Eq_2 get_romfs_file_content(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg68, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out (ptr32 Eq_446) a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_341941) s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_cipstart
Eq_2 get_romfs_file_content(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg68, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, struct Eq_446 & a4Out, ptr32 & a5Out, struct Eq_341941 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	ptr32 a0_40;
	Eq_2 a0_14;
	ptr32 mstatus_38;
	word32 a3_131;
	ptr32 a2_15;
	struct Eq_446 * a4_101;
	ptr32 a5_102;
	Eq_2 s0_107;
	ptr32 s1_108;
	struct Eq_341941 * s2_109;
	ptr32 s3_110;
	ptr32 s6_113;
	Eq_2 ra_106 = aos_open(ra, a0, s2, mstatus, dwLoc1C, a1, dwArg68, dwArgD8, dwArg0118, dwArg0158, out s0_107, out s1_108, out a0_14, out a2_15, out a3_131, out a4_101, out a5_102, out s2_109, out s3_110, out s6_113, out mstatus_38);
	if (a0_14 >= 0x00)
	{
		Eq_2 a3_47;
		Eq_2 a4_48;
		Eq_2 a2_52;
		word32 a0_132;
		ra_106 = aos_ioctl(ra_106, a0_14, 0x01, a1, a4_101, dwLoc20, dwArg24, out s0_107, out a0_132, out a2_52, out a3_47, out a4_48);
		s1_108 = aos_close(ra_106, s0_107, a2_52, a3_47, a4_48, s2_109, mstatus_38, dwArg18, out a2_15, out a4_101, out a5_102, out s2_109, out s3_110, out s6_113);
		a0_40 = 0x00;
	}
	else
		a0_40 = ~0x00;
	s0Out = s0_107;
	s1Out = s1_108;
	a0Out = a0_40;
	a2Out = a2_15;
	a4Out = a4_101;
	a5Out = a5_102;
	s2Out = s2_109;
	s3Out = s3_110;
	s6Out = s6_113;
	mstatusOut = mstatus_38;
	return ra_106;
}

// 23080656: void udp_send_data(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_468953) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void udp_send_data(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_468953 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	if (a0 == 0x00)
	{
l2308067A:
		__assert_func(ra, 588012664, s2, s6, s7, s8, s9);
	}
	Eq_2 a0_32 = a5->t0004;
	if (a5 == null)
		goto l2308067A;
	ptr32 mstatus_287;
	Eq_2 a5_272;
	Eq_2 s0_266;
	Eq_2 a4_293;
	Eq_2 a3_292;
	word32 a5_548;
	vTaskEnterCritical(a4, mstatus, out a5_548);
	struct Eq_468999 * s2_38 = *a0_32;
	Eq_2 s1_294 = 0x230C7000;
	if ((word32) s2_38->b4201C380 == 0x02 && (word32) s2_38->b4201C3A0 != 0x00)
	{
		Eq_2 a4_52;
		Eq_2 a0_57;
		Eq_2 a1_67;
		struct Eq_469028 * s2_68;
		Eq_2 s4_70;
		word32 s3_554;
		word32 s6_556;
		word32 s8_557;
		word32 s5_555;
		word32 a5_550;
		word32 a5_552;
		word32 a7_553;
		word32 s0_551;
		ra = pbuf_alloc(ra, a0_32, 0x230C7000, 0x00B6, (word32) g_t4200F6EC, 640, vTaskExitCritical(a3, mstatus, out a4_52, out a5_550), a4_52, mstatus, s4, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_551, out s1_294, out a0_57, out a1_67, out a2, out a3_292, out a4_293, out a5_552, out a7_553, out s2_68, out s3_554, out s4_70, out s5_555, out s6_556, out s8_557, out mstatus);
		s3 = a0_57;
		if (a0_57 != 0x00)
		{
			ptr32 mstatus_137;
			Eq_2 a4_133;
			Eq_2 a3_132;
			Eq_2 a2_131;
			Eq_2 s1_140;
			Eq_2 ra_138;
			Eq_2 a0_160;
			Eq_2 s3_144;
			word32 a1_603;
			word32 a2_604;
			word32 a3_605;
			word32 a4_606;
			word32 a5_607;
			word32 a6_608;
			word32 a7_609;
			memcpy(*((word32) a0_57 + 4), a1_67, *s4_70, out a1_603, out a2_604, out a3_605, out a4_606, out a5_607, out a6_608, out a7_609);
			word32 a0_101;
			Eq_2 a2_103;
			Eq_2 a3_104;
			Eq_2 a4_105;
			ptr32 mstatus_109;
			Eq_2 s1_112;
			Eq_2 s3_114;
			Eq_2 ra_110 = udp_send(ra, s2_68->t0030, a0_57, s4_70, mstatus, dwLoc0C, dwArg08, dwArg28, dwArg58, s1, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s1_112, out a0_101, out a2_103, out a3_104, out a4_105, out s3_114, out mstatus_109);
			if (a0_101 != 0x00)
			{
				word32 s0_623;
				word32 a0_624;
				word32 a1_625;
				word32 a5_626;
				word32 s2_627;
				word32 s4_628;
				word32 s5_629;
				word32 s6_630;
				word32 s7_631;
				word32 s8_632;
				word32 s9_633;
				word32 s10_634;
				word32 s11_635;
				ra_138 = at_dump_noend(ra_110, s1_112, (word32) s1_112 - 0x0700, a2_103, a3_104, a4_105, s3_114, mstatus_109, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_623, out s1_140, out a0_624, out a1_625, out a2_131, out a3_132, out a4_133, out a5_626, out s2_627, out s3_144, out s4_628, out s5_629, out s6_630, out s7_631, out s8_632, out s9_633, out s10_634, out s11_635, out mstatus_137);
				a0_160.u0 = 0x230C5EEC;
			}
			else
			{
				word32 s0_610;
				word32 a0_611;
				word32 a1_612;
				word32 a5_613;
				word32 s2_614;
				word32 s4_615;
				word32 s5_616;
				word32 s6_617;
				word32 s7_618;
				word32 s8_619;
				word32 s9_620;
				word32 s10_621;
				word32 s11_622;
				ra_138 = at_dump_noend(ra_110, s1_112, (word32) s1_112 - 0x0700, a2_103, a3_104, a4_105, s3_114, mstatus_109, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_610, out s1_140, out a0_611, out a1_612, out a2_131, out a3_132, out a4_133, out a5_613, out s2_614, out s3_144, out s4_615, out s5_616, out s6_617, out s7_618, out s8_619, out s9_620, out s10_621, out s11_622, out mstatus_137);
				a0_160.u0 = 0x230C5F00;
			}
			Eq_2 a2_206;
			Eq_2 a3_207;
			Eq_2 a4_208;
			ptr32 mstatus_212;
			Eq_2 s1_215;
			Eq_2 s3_219;
			Eq_2 a3_237;
			Eq_2 a4_238;
			ptr32 mstatus_242;
			Eq_2 s3_249;
			Eq_2 s4_250;
			word32 s0_636;
			word32 a0_637;
			word32 a1_638;
			word32 a5_639;
			word32 s2_640;
			word32 s4_641;
			word32 s5_642;
			word32 s6_643;
			word32 s7_644;
			word32 s8_645;
			word32 s9_646;
			word32 s10_647;
			word32 s11_648;
			word32 s0_649;
			word32 s1_650;
			word32 a0_651;
			word32 a1_652;
			word32 a2_653;
			word32 a5_654;
			word32 s2_655;
			word32 s5_656;
			word32 s6_657;
			word32 s7_658;
			word32 s8_659;
			word32 s9_660;
			word32 s10_661;
			word32 s11_662;
			word32 s1_663;
			word32 a0_664;
			word32 a1_665;
			word32 a2_666;
			word32 a3_667;
			word32 a4_668;
			word32 a7_669;
			word32 s2_670;
			word32 s3_671;
			word32 s4_672;
			word32 s5_673;
			word32 s6_674;
			word32 s8_675;
			pbuf_free(at_dump_noend(at_dump_noend(ra_138, s1_140, a0_160, a2_131, a3_132, a4_133, s3_144, mstatus_137, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_636, out s1_215, out a0_637, out a1_638, out a2_206, out a3_207, out a4_208, out a5_639, out s2_640, out s3_219, out s4_641, out s5_642, out s6_643, out s7_644, out s8_645, out s9_646, out s10_647, out s11_648, out mstatus_212), s1_215, (word32) s1_215 - 0x0700, a2_206, a3_207, a4_208, s3_219, mstatus_212, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_649, out s1_650, out a0_651, out a1_652, out a2_653, out a3_237, out a4_238, out a5_654, out s2_655, out s3_249, out s4_250, out s5_656, out s6_657, out s7_658, out s8_659, out s9_660, out s10_661, out s11_662, out mstatus_242), s3_249, a3_237, a4_238, s4_250, mstatus_242, dwArg0108, out s0_266, out s1_663, out a0_664, out a1_665, out a2_666, out a3_667, out a4_668, out a5_272, out a7_669, out s2_670, out s3_671, out s4_672, out s5_673, out s6_674, out s8_675, out mstatus_287);
l230806F2:
			word32 a2_559;
			word32 a5_560;
			word32 a0_558;
			free(s0_266, dwArg48, a5_272, mstatus_287, dwArg0158, dwArg0198, out a0_558, out a2_559, out a5_560);
			return;
		}
	}
	else
	{
		word32 a5_549;
		a3_292 = vTaskExitCritical(a3, mstatus, out a4_293, out a5_549);
	}
	Eq_2 a2_313;
	Eq_2 a3_314;
	Eq_2 a4_315;
	ptr32 mstatus_319;
	Eq_2 s1_322;
	Eq_2 s3_326;
	Eq_2 a2_345;
	Eq_2 a3_346;
	Eq_2 a4_347;
	ptr32 mstatus_351;
	Eq_2 s1_354;
	Eq_2 s3_358;
	word32 s7_598;
	word32 s6_597;
	word32 s5_596;
	word32 s4_595;
	word32 s3_594;
	word32 s2_593;
	word32 a4_592;
	word32 a3_591;
	word32 a2_590;
	word32 a1_589;
	word32 a0_588;
	word32 s1_587;
	word32 s11_586;
	word32 s10_585;
	word32 s8_583;
	word32 s9_584;
	word32 s6_581;
	word32 s7_582;
	word32 s4_579;
	word32 s5_580;
	word32 a5_577;
	word32 s2_578;
	word32 a0_575;
	word32 a1_576;
	word32 s11_573;
	word32 s0_574;
	word32 s9_571;
	word32 s10_572;
	word32 s7_569;
	word32 s8_570;
	word32 s5_567;
	word32 s6_568;
	word32 s2_565;
	word32 s4_566;
	word32 a1_563;
	word32 a5_564;
	word32 s0_561;
	word32 a0_562;
	word32 s8_599;
	word32 s9_600;
	word32 s10_601;
	word32 s11_602;
	at_dump_noend(at_dump_noend(at_dump_noend(ra, s1_294, (word32) s1_294 - 0x0700, a2, a3_292, a4_293, s3, mstatus, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_561, out s1_322, out a0_562, out a1_563, out a2_313, out a3_314, out a4_315, out a5_564, out s2_565, out s3_326, out s4_566, out s5_567, out s6_568, out s7_569, out s8_570, out s9_571, out s10_572, out s11_573, out mstatus_319), s1_322, 0x230C5EEC, a2_313, a3_314, a4_315, s3_326, mstatus_319, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_574, out s1_354, out a0_575, out a1_576, out a2_345, out a3_346, out a4_347, out a5_577, out s2_578, out s3_358, out s4_579, out s5_580, out s6_581, out s7_582, out s8_583, out s9_584, out s10_585, out s11_586, out mstatus_351), s1_354, (word32) s1_354 - 0x0700, a2_345, a3_346, a4_347, s3_358, mstatus_351, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_266, out s1_587, out a0_588, out a1_589, out a2_590, out a3_591, out a4_592, out a5_272, out s2_593, out s3_594, out s4_595, out s5_596, out s6_597, out s7_598, out s8_599, out s9_600, out s10_601, out s11_602, out mstatus_287);
	goto l230806F2;
}

// 23080778: void tcp_err_callback(Register Eq_2 ra, Register Eq_2 s0, Register int32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
void tcp_err_callback(Eq_2 ra, Eq_2 s0, int32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	if (a0 <= 0x04)
	{
		Eq_2 a2_34;
		Eq_2 a3_35;
		Eq_2 a4_36;
		ptr32 mstatus_40;
		Eq_2 s1_43;
		Eq_2 s3_47;
		Eq_2 a2_66;
		Eq_2 a3_67;
		Eq_2 a4_68;
		ptr32 mstatus_72;
		Eq_2 s1_75;
		Eq_2 s3_79;
		Eq_2 a2_96;
		Eq_2 a3_97;
		Eq_2 a4_98;
		Eq_2 a5_99;
		ptr32 mstatus_102;
		word32 s7_263;
		word32 s6_262;
		word32 s5_261;
		word32 s4_260;
		word32 s0_255;
		word32 a0_256;
		word32 a1_257;
		word32 a5_258;
		word32 s2_259;
		word32 s8_264;
		word32 s9_265;
		word32 s10_266;
		word32 s11_267;
		word32 s0_268;
		word32 a0_269;
		word32 a1_270;
		word32 a5_271;
		word32 s2_272;
		word32 s4_273;
		word32 s5_274;
		word32 s6_275;
		word32 s7_276;
		word32 s8_277;
		word32 s9_278;
		word32 s10_279;
		word32 s11_280;
		word32 s0_281;
		word32 s1_282;
		word32 a0_283;
		word32 a1_284;
		word32 s2_285;
		word32 s3_286;
		word32 s4_287;
		word32 s5_288;
		word32 s6_289;
		word32 s7_290;
		word32 s8_291;
		word32 s9_292;
		word32 s10_293;
		word32 s11_294;
		Eq_2 ra_103 = at_dump_noend(at_dump_noend(at_dump_noend(ra, 0x230C7000, 0x230C6900, a2, a3, a4, s3, mstatus, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_255, out s1_43, out a0_256, out a1_257, out a2_34, out a3_35, out a4_36, out a5_258, out s2_259, out s3_47, out s4_260, out s5_261, out s6_262, out s7_263, out s8_264, out s9_265, out s10_266, out s11_267, out mstatus_40), s1_43, 0x230C5DAC, a2_34, a3_35, a4_36, s3_47, mstatus_40, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_268, out s1_75, out a0_269, out a1_270, out a2_66, out a3_67, out a4_68, out a5_271, out s2_272, out s3_79, out s4_273, out s5_274, out s6_275, out s7_276, out s8_277, out s9_278, out s10_279, out s11_280, out mstatus_72), s1_75, (word32) s1_75 - 0x0700, a2_66, a3_67, a4_68, s3_79, mstatus_72, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_281, out s1_282, out a0_283, out a1_284, out a2_96, out a3_97, out a4_98, out a5_99, out s2_285, out s3_286, out s4_287, out s5_288, out s6_289, out s7_290, out s8_291, out s9_292, out s10_293, out s11_294, out mstatus_102);
		Eq_2 a0_126;
		Eq_2 a1_127;
		Eq_2 s2_135;
		Eq_2 s3_136;
		word32 a2_295;
		word32 a3_296;
		word32 a4_297;
		word32 a5_298;
		word32 s4_299;
		word32 s8_300;
		Eq_2 s1_134;
		Eq_2 s0_133 = xQueueSemaphoreTake(g_t420280EC, ~0x00, a2_96, a3_97, a4_98, a5_99, mstatus_102, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_134, out a0_126, out a1_127, out a2_295, out a3_296, out a4_297, out a5_298, out s2_135, out s3_136, out s4_299, out s8_300);
		Eq_2 a4_146 = (word32) *((word32) s0_133 + 1107411840);
		*((word32) s0_133 + 1107411872) = 0x00;
		*((word32) s0_133 + 1107411864) = 0x00;
		Eq_2 a5_149 = 0x03;
		if (a4_146 == 0x03)
		{
			word32 s2_301;
			word32 s3_302;
			word32 s4_303;
			altcp_tls_free_config(ra_103, s1_134, a0_126, a1_127, 0x03, s2_135, s3_136, mstatus_102, s0, dwLoc08, dwArg00, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, dwArg0168, dwArg0188, out s1_134, out a4_146, out a5_149, out s2_301, out s3_302, out s4_303)->dw0034 = 0x00;
		}
		Eq_2 a0_179 = *((word32) s1_134 + 0x00EC);
		word32 s1_304;
		word32 a0_305;
		word32 a1_306;
		word32 a2_307;
		word32 a3_308;
		word32 a4_309;
		word32 a5_310;
		word32 a7_311;
		word32 s2_312;
		word32 s3_313;
		word32 s4_314;
		word32 s5_315;
		word32 s6_316;
		word32 s8_317;
		xQueueGenericSend(a0_179, 0x00, 0x00, a4_146, a5_149, mstatus_102, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_304, out a0_305, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310, out a7_311, out s2_312, out s3_313, out s4_314, out s5_315, out s6_316, out s8_317);
	}
	else
		__assert_func(ra, 0x230C5C30, s2, s6, s7, s8, s9);
}

