pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308081C: void udp_receive_callback(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_469709) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void udp_receive_callback(Eq_2 ra, Eq_2 s0, struct Eq_469709 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg28, word32 dwArg38, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 s4_292;
	Eq_2 a3_284;
	Eq_2 a4_285;
	Eq_2 ra_303;
	Eq_2 s0_14 = a2;
	if (a0 > (struct Eq_469709 *) 0x04)
	{
		word32 s2_459;
		word32 a7_458;
		word32 a5_457;
		word32 a2_456;
		word32 a0_454;
		word32 s1_453;
		word32 s11_467;
		word32 s3_460;
		word32 s9_465;
		word32 s10_466;
		word32 s7_463;
		word32 s8_464;
		word32 s5_461;
		word32 s6_462;
		word32 a1_455;
		word32 t4_468;
		ra_303 = printf(ra, &g_t230C5EA8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_453, out a0_454, out a1_455, out a2_456, out a3_284, out a4_285, out a5_457, out a7_458, out s2_459, out s3_460, out s4_292, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
	}
	else
	{
		word32 a5_452;
		vTaskEnterCritical(a4, mstatus, out a5_452);
		if ((word32) a0->b4201C3A0 == 0x00)
		{
			word32 a4_565;
			word32 a5_566;
			word32 s1_567;
			word32 a0_568;
			word32 a1_569;
			word32 a2_570;
			word32 a5_571;
			word32 a7_572;
			word32 s2_573;
			word32 s3_574;
			word32 s5_575;
			word32 s6_576;
			word32 s7_577;
			word32 s8_578;
			word32 s9_579;
			word32 s10_580;
			word32 s11_581;
			word32 t4_582;
			ra_303 = printf(ra, &g_t230C5E4C, vTaskExitCritical(a3, mstatus, out a4_565, out a5_566), dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_567, out a0_568, out a1_569, out a2_570, out a3_284, out a4_285, out a5_571, out a7_572, out s2_573, out s3_574, out s4_292, out s5_575, out s6_576, out s7_577, out s8_578, out s9_579, out s10_580, out s11_581, out t4_582);
		}
		else
		{
			Eq_2 a4_30;
			Eq_2 a2_34;
			Eq_2 a3_35;
			Eq_2 a4_36;
			Eq_2 s1_39;
			Eq_2 s3_41;
			Eq_2 a2_59;
			Eq_2 a3_60;
			Eq_2 a4_61;
			ptr32 mstatus_65;
			Eq_2 s1_68;
			Eq_2 s3_72;
			Eq_2 a2_90;
			Eq_2 a3_91;
			Eq_2 a4_92;
			ptr32 mstatus_96;
			Eq_2 s1_99;
			Eq_2 s3_103;
			Eq_2 a2_120;
			Eq_2 a3_121;
			Eq_2 a4_122;
			ptr32 mstatus_126;
			Eq_2 s1_129;
			Eq_2 s3_133;
			Eq_2 a3_151;
			Eq_2 a4_152;
			ptr32 mstatus_156;
			struct Eq_469853 * s0_158;
			Eq_2 s1_159;
			Eq_2 s3_163;
			Eq_2 a2_183;
			Eq_2 a3_184;
			Eq_2 a4_185;
			ptr32 mstatus_189;
			Eq_2 s1_192;
			Eq_2 s3_196;
			word32 a5_485;
			word32 s2_486;
			word32 s0_487;
			word32 a0_488;
			word32 a1_489;
			word32 a5_490;
			word32 s2_491;
			word32 s4_492;
			word32 s5_493;
			word32 s6_494;
			word32 s7_495;
			word32 s8_496;
			word32 s9_497;
			word32 s10_498;
			word32 s11_499;
			word32 s0_500;
			word32 a0_501;
			word32 a1_502;
			word32 a5_503;
			word32 s2_504;
			word32 s4_505;
			word32 s5_506;
			word32 s6_507;
			word32 s7_508;
			word32 s8_509;
			word32 s9_510;
			word32 s10_511;
			word32 s11_512;
			word32 s0_513;
			word32 a0_514;
			word32 a1_515;
			word32 a5_516;
			word32 s2_517;
			word32 s4_518;
			word32 s5_519;
			word32 s6_520;
			word32 s7_521;
			word32 s8_522;
			word32 s9_523;
			word32 s10_524;
			word32 s11_525;
			word32 a0_526;
			word32 a1_527;
			word32 a2_528;
			word32 a5_529;
			word32 s2_530;
			word32 s4_531;
			word32 s5_532;
			word32 s6_533;
			word32 s7_534;
			word32 s8_535;
			word32 s9_536;
			word32 s10_537;
			word32 s11_538;
			word32 s0_539;
			word32 a0_540;
			word32 a1_541;
			word32 a5_542;
			word32 s2_543;
			word32 s4_544;
			word32 s5_545;
			word32 s6_546;
			word32 s7_547;
			word32 s8_548;
			word32 s9_549;
			word32 s10_550;
			word32 s11_551;
			word32 s1_552;
			word32 a1_553;
			word32 a5_554;
			word32 s2_555;
			word32 s3_556;
			word32 s4_557;
			word32 s5_558;
			word32 s6_559;
			word32 s7_560;
			word32 s8_561;
			word32 s9_562;
			word32 s10_563;
			word32 s11_564;
			Eq_2 a0_211;
			Eq_2 a4_215;
			Eq_2 a3_214;
			Eq_2 a2_213;
			Eq_2 ra_220 = at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_serial_lock(ra, 0x230C7000, a2, vTaskExitCritical(a3, mstatus, out a4_30, out a5_485), a4_30, mstatus, s0, dwArg08, dwArg18, dwArg50, dwArg54, ra, dwArg78, dwArg9C, dwArgE8, dwArg0128, out s1_39, out a2_34, out a3_35, out a4_36, out s2_486, out s3_41), s1_39, (word32) s1_39 - 0x0700, a2_34, a3_35, a4_36, s3_41, mstatus, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_487, out s1_68, out a0_488, out a1_489, out a2_59, out a3_60, out a4_61, out a5_490, out s2_491, out s3_72, out s4_492, out s5_493, out s6_494, out s7_495, out s8_496, out s9_497, out s10_498, out s11_499, out mstatus_65), s1_68, 0x230C5DCC, a2_59, a3_60, a4_61, s3_72, mstatus_65, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_500, out s1_99, out a0_501, out a1_502, out a2_90, out a3_91, out a4_92, out a5_503, out s2_504, out s3_103, out s4_505, out s5_506, out s6_507, out s7_508, out s8_509, out s9_510, out s10_511, out s11_512, out mstatus_96), s1_99, (word32) s1_99 - 0x0700, a2_90, a3_91, a4_92, s3_103, mstatus_96, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_513, out s1_129, out a0_514, out a1_515, out a2_120, out a3_121, out a4_122, out a5_516, out s2_517, out s3_133, out s4_518, out s5_519, out s6_520, out s7_521, out s8_522, out s9_523, out s10_524, out s11_525, out mstatus_126), s1_129, (word32) s1_129 - 0x0700, a2_120, a3_121, a4_122, s3_133, mstatus_126, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_158, out s1_159, out a0_526, out a1_527, out a2_528, out a3_151, out a4_152, out a5_529, out s2_530, out s3_163, out s4_531, out s5_532, out s6_533, out s7_534, out s8_535, out s9_536, out s10_537, out s11_538, out mstatus_156), s1_159, 588013012, (word32) s0_158->w0008, a3_151, a4_152, s3_163, mstatus_156, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_539, out s1_192, out a0_540, out a1_541, out a2_183, out a3_184, out a4_185, out a5_542, out s2_543, out s3_196, out s4_544, out s5_545, out s6_546, out s7_547, out s8_548, out s9_549, out s10_550, out s11_551, out mstatus_189), s1_192, (word32) s1_192 - 0x0700, a2_183, a3_184, a4_185, s3_196, mstatus_189, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_14, out s1_552, out a0_211, out a1_553, out a2_213, out a3_214, out a4_215, out a5_554, out s2_555, out s3_556, out s4_557, out s5_558, out s6_559, out s7_560, out s8_561, out s9_562, out s10_563, out s11_564, out mstatus);
			do
			{
				word32 * s1_262;
				word32 s4_583;
				ra_220 = at_data_output(ra_220, a0_211, a2_213, a3_214, a4_215, mstatus, s0, dwArg08, dwArg18, dwArg28, dwArg50, dwArg54, ra, dwArg78, dwArg9C, dwArgE8, dwArg0128, out s1_262, out a0_211, out a2_213, out a3_214, out a4_215, out s4_583, out mstatus);
			} while (*s1_262 != 0x00);
			word32 a0_584;
			word32 a2_585;
			word32 a5_586;
			word32 s3_587;
			ra_303 = at_serial_unlock(ra_220, a4_215, mstatus, s0, dwArg08, dwArg18, dwArg50, dwArg54, ra, dwArg78, dwArg9C, dwArgE8, dwArg0128, dwArg0168, out a0_584, out a2_585, out a3_284, out a4_285, out a5_586, out s3_587, out s4_292);
		}
	}
	0x00 = dwArg38;
	word32 s0_469;
	word32 s1_470;
	word32 a0_471;
	word32 a1_472;
	word32 a2_473;
	word32 a3_474;
	word32 a4_475;
	word32 a5_476;
	word32 a7_477;
	word32 s2_478;
	word32 s3_479;
	word32 s4_480;
	word32 s5_481;
	word32 s6_482;
	word32 s8_483;
	word32 mstatus_484;
	pbuf_free(ra_303, s0_14, a3_284, a4_285, s4_292, mstatus, dwArg0128, out s0_469, out s1_470, out a0_471, out a1_472, out a2_473, out a3_474, out a4_475, out a5_476, out a7_477, out s2_478, out s3_479, out s4_480, out s5_481, out s6_482, out s8_483, out mstatus_484);
}

