pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230808DC: void tcp_accept_callback(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack word32 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void tcp_accept_callback(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, word32 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	struct Eq_274 * a0_286;
	Eq_2 s0_21 = a1;
	if (a2 != 0x00)
		a0_286 = (struct Eq_274 *) &g_t230C5D40;
	else
	{
		word32 s1_40;
		struct Eq_470207 * s4_43;
		word32 s8_480;
		word32 a5_477;
		word32 s2_478;
		word32 s3_479;
		word32 a4_476;
		word32 a1_473;
		word32 a2_474;
		word32 a0_472;
		word32 a3_475;
		Eq_2 s0_39 = xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_40, out a0_472, out a1_473, out a2_474, out a3_475, out a4_476, out a5_477, out s2_478, out s3_479, out s4_43, out s8_480);
		struct Eq_470234 * a5_47 = s1_40 + 0x0330 + 56;
		word32 s2_48;
		Eq_2 a4_261 = 0x05;
		for (s2_48 = 0x00; s2_48 != 0x05; ++s2_48)
		{
			if ((word32) a5_47->b0000 == 0x00)
			{
				word32 a5_486;
				word32 a1_483;
				word32 a2_484;
				word32 a3_485;
				word32 t1_481;
				word32 a0_482;
				ra = memset(ra, s2_48 + 0x3C + (s1_40 + 0x0330), 0x00, 56, out t1_481, out a0_482, out a1_483, out a2_484, out a3_485, out a4_261, out a5_486);
				break;
			}
			++a5_47;
		}
		word32 s3_77 = s2_48 + 56;
		struct Eq_470277 * s5_79 = s1_40 + 0x0330 + s3_77;
		Eq_2 a5_81 = (word32) s5_79->b0038;
		if (a5_81 == 0x00)
		{
			word32 s1_82 = *a5_81;
			s5_79->t0030 = s0_39;
			*((word32) a5_81 + 1) = s1_82;
			s5_79->b0038 = 0x03;
			s5_79->b0018 = 0x01;
			altcp_get_ip(s0_39, (struct Eq_470295 *) 0x01);
			Eq_2 a4_102;
			struct Eq_470299 * a5_103;
			word32 a3_487;
			ip4addr_ntoa_r(s3_77 + 4 + s1_82, 0x10, out a3_487, out a4_102, out a5_103);
			Eq_2 a5_117;
			s5_79->dw0014 = altcp_get_port(s0_39, a5_103, out a5_117);
			Eq_2 a2_131;
			Eq_2 a3_132;
			Eq_2 a4_133;
			Eq_2 s3_140;
			word32 s6_496;
			word32 s8_497;
			word32 s4_494;
			word32 s5_495;
			word32 a7_492;
			word32 s2_493;
			word32 a1_490;
			word32 a5_491;
			word32 s1_488;
			word32 a0_489;
			xQueueGenericSend(s4_43->t00EC, 0x00, 0x00, a4_102, a5_117, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_488, out a0_489, out a1_490, out a2_131, out a3_132, out a4_133, out a5_491, out a7_492, out s2_493, out s3_140, out s4_494, out s5_495, out s6_496, out s8_497);
			word32 s4_516;
			word32 s7_519;
			word32 s6_518;
			word32 s9_521;
			word32 s8_520;
			Eq_2 a2_157;
			Eq_2 a3_158;
			Eq_2 a4_159;
			ptr32 mstatus_163;
			Eq_2 s1_166;
			Eq_2 s3_170;
			Eq_2 a2_189;
			Eq_2 a3_190;
			Eq_2 a4_191;
			ptr32 mstatus_195;
			Eq_2 s1_198;
			Eq_2 s3_202;
			Eq_2 s0_227;
			Eq_2 s2_231;
			word32 s5_517;
			word32 a5_514;
			word32 s2_515;
			word32 a0_512;
			word32 a1_513;
			word32 s11_510;
			word32 s0_511;
			word32 s9_508;
			word32 s10_509;
			word32 s7_506;
			word32 s8_507;
			word32 s5_504;
			word32 s6_505;
			word32 s2_502;
			word32 s4_503;
			word32 a1_500;
			word32 a5_501;
			word32 s0_498;
			word32 a0_499;
			word32 s10_522;
			word32 s11_523;
			word32 s1_524;
			word32 a0_525;
			word32 a1_526;
			word32 a2_527;
			word32 a3_528;
			word32 a4_529;
			word32 a5_530;
			word32 s3_531;
			word32 s4_532;
			word32 s5_533;
			word32 s6_534;
			word32 s7_535;
			word32 s8_536;
			word32 s9_537;
			word32 s10_538;
			word32 s11_539;
			word32 mstatus_540;
			at_dump_noend(at_dump_noend(at_dump_noend(ra, 0x230C7000, 0x230C6900, a2_131, a3_132, a4_133, s3_140, mstatus, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_498, out s1_166, out a0_499, out a1_500, out a2_157, out a3_158, out a4_159, out a5_501, out s2_502, out s3_170, out s4_503, out s5_504, out s6_505, out s7_506, out s8_507, out s9_508, out s10_509, out s11_510, out mstatus_163), s1_166, 588012952, a2_157, a3_158, a4_159, s3_170, mstatus_163, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_511, out s1_198, out a0_512, out a1_513, out a2_189, out a3_190, out a4_191, out a5_514, out s2_515, out s3_202, out s4_516, out s5_517, out s6_518, out s7_519, out s8_520, out s9_521, out s10_522, out s11_523, out mstatus_195), s1_198, (word32) s1_198 - 0x0700, a2_189, a3_190, a4_191, s3_202, mstatus_195, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_227, out s1_524, out a0_525, out a1_526, out a2_527, out a3_528, out a4_529, out a5_530, out s2_231, out s3_531, out s4_532, out s5_533, out s6_534, out s7_535, out s8_536, out s9_537, out s10_538, out s11_539, out mstatus_540);
			altcp_arg(s0_227, s2_231);
			altcp_recv(s0_227, &g_t230804AC);
			altcp_sent(s0_227, &g_t23080254);
			altcp_err(s0_227, &g_t23080778);
			goto l23080906;
		}
		word32 s1_541;
		word32 a0_542;
		word32 a1_543;
		word32 a2_544;
		word32 a4_545;
		word32 a5_546;
		word32 a7_547;
		word32 s2_548;
		word32 s3_549;
		word32 s4_550;
		word32 s5_551;
		word32 s6_552;
		word32 s8_553;
		s0_21 = xQueueGenericSend(s4_43->t00EC, 0x00, 0x00, a4_261, a5_81, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_541, out a0_542, out a1_543, out a2_544, out a3, out a4_545, out a5_546, out a7_547, out s2_548, out s3_549, out s4_550, out s5_551, out s6_552, out s8_553);
		a0_286 = (struct Eq_274 *) &g_t230C5D50;
	}
	Eq_2 a5_295;
	word32 s1_554;
	word32 a0_555;
	word32 a1_556;
	word32 a2_557;
	word32 a3_558;
	word32 a4_559;
	word32 a7_560;
	word32 s2_561;
	word32 s3_562;
	word32 s4_563;
	word32 s5_564;
	word32 s6_565;
	word32 s7_566;
	word32 s8_567;
	word32 s9_568;
	word32 s10_569;
	word32 s11_570;
	word32 t4_571;
	printf(ra, a0_286, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_554, out a0_555, out a1_556, out a2_557, out a3_558, out a4_559, out a5_295, out a7_560, out s2_561, out s3_562, out s4_563, out s5_564, out s6_565, out s7_566, out s8_567, out s9_568, out s10_569, out s11_570, out t4_571);
	word32 a5_572;
	altcp_close(s0_21, a5_295, out a5_572);
l23080906:
	0x00 = dwArgA8;
}

// 23080A28: void tcp_send_data(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_470600) s1, Register word32 a0, Register (ptr32 Eq_470602) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_470606) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void tcp_send_data(Eq_2 ra, Eq_2 s0, struct Eq_470600 * s1, word32 a0, struct Eq_470602 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_470606 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	if (a0 != 0x00)
	{
		int32 a0_26 = a5->dw0004;
		if (a5 != null)
		{
			Eq_2 a5_135;
			Eq_2 s0_140;
			word32 a5_256;
			vTaskEnterCritical(a4, mstatus, out a5_256);
			if ((word32) s1->b4201C380 != 0x02 && (word32) s1->b4201C3A0 != 0x00)
			{
				word32 a4_300;
				word32 a5_301;
				vTaskExitCritical(a3, mstatus, out a4_300, out a5_301);
				s0_140 = a1->t0004;
				altcp_write(a0_26, &g_t4200F000, out a5_135);
			}
			else
			{
				Eq_2 a4_58;
				Eq_2 a2_70;
				Eq_2 a3_71;
				Eq_2 a4_72;
				ptr32 mstatus_76;
				Eq_2 s1_79;
				Eq_2 s3_83;
				Eq_2 a2_102;
				Eq_2 a3_103;
				Eq_2 a4_104;
				ptr32 mstatus_108;
				Eq_2 s1_111;
				Eq_2 s3_115;
				word32 a5_257;
				word32 s0_258;
				word32 a0_259;
				word32 a1_260;
				word32 a5_261;
				word32 s2_262;
				word32 s4_263;
				word32 s5_264;
				word32 s6_265;
				word32 s7_266;
				word32 s8_267;
				word32 s9_268;
				word32 s10_269;
				word32 s11_270;
				word32 s0_271;
				word32 a0_272;
				word32 a1_273;
				word32 a5_274;
				word32 s2_275;
				word32 s4_276;
				word32 s5_277;
				word32 s6_278;
				word32 s7_279;
				word32 s8_280;
				word32 s9_281;
				word32 s10_282;
				word32 s11_283;
				word32 s1_284;
				word32 a0_285;
				word32 a1_286;
				word32 a2_287;
				word32 a3_288;
				word32 a4_289;
				word32 s2_290;
				word32 s3_291;
				word32 s4_292;
				word32 s5_293;
				word32 s6_294;
				word32 s7_295;
				word32 s8_296;
				word32 s9_297;
				word32 s10_298;
				word32 s11_299;
				at_dump_noend(at_dump_noend(at_dump_noend(ra, 0x230C7000, 0x230C6900, a2, vTaskExitCritical(a3, mstatus, out a4_58, out a5_257), a4_58, s3, mstatus, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_258, out s1_79, out a0_259, out a1_260, out a2_70, out a3_71, out a4_72, out a5_261, out s2_262, out s3_83, out s4_263, out s5_264, out s6_265, out s7_266, out s8_267, out s9_268, out s10_269, out s11_270, out mstatus_76), s1_79, 0x230C5EEC, a2_70, a3_71, a4_72, s3_83, mstatus_76, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_271, out s1_111, out a0_272, out a1_273, out a2_102, out a3_103, out a4_104, out a5_274, out s2_275, out s3_115, out s4_276, out s5_277, out s6_278, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283, out mstatus_108), s1_111, (word32) s1_111 - 0x0700, a2_102, a3_103, a4_104, s3_115, mstatus_108, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_140, out s1_284, out a0_285, out a1_286, out a2_287, out a3_288, out a4_289, out a5_135, out s2_290, out s3_291, out s4_292, out s5_293, out s6_294, out s7_295, out s8_296, out s9_297, out s10_298, out s11_299, out mstatus);
			}
			word32 a0_302;
			word32 a2_303;
			word32 a5_304;
			free(s0_140, dwArg10, a5_135, mstatus, dwArg0158, dwArg0198, out a0_302, out a2_303, out a5_304);
			return;
		}
	}
	__assert_func(ra, 588012648, s2, s6, s7, s8, s9);
}

