pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23080AE2: void bl_cipstatus(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack word32 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8)
void bl_cipstatus(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg88, Eq_2 dwArg8C, word32 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8)
{
	struct Eq_470827 * s0_131 = &g_t4201C330;
	Eq_2 s1_132 = 0x00;
	word32 s4_137 = 0x230C7000;
	Eq_2 s3_136 = 588012536;
	do
	{
		if ((word32) s0_131[56] != 0x00)
		{
			Eq_2 a4_47;
			ptr32 mstatus_51;
			struct Eq_470843 * s0_53;
			Eq_2 s1_54;
			Eq_2 s2_57;
			Eq_2 s3_58;
			uint32 s5_60;
			word32 s6_61;
			word32 s11_304;
			word32 s10_303;
			word32 s9_302;
			word32 s8_301;
			word32 s7_300;
			word32 s4_299;
			word32 a5_298;
			word32 a3_297;
			word32 a2_296;
			word32 a0_294;
			word32 a1_295;
			Eq_2 ra_52 = at_dump_noend(ra, s1_132, s4_137 + -0x0700, a2, a3, a4, s3_136, mstatus, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_53, out s1_54, out a0_294, out a1_295, out a2_296, out a3_297, out a4_47, out a5_298, out s2_57, out s3_58, out s4_299, out s5_60, out s6_61, out s7_300, out s8_301, out s9_302, out s10_303, out s11_304, out mstatus_51);
			s5_60 < ((word32) s0_53->b0018 + ~0x00 & 0x00FF);
			Eq_2 a2_93;
			Eq_2 a3_94;
			Eq_2 a4_95;
			ptr32 mstatus_99;
			Eq_2 s1_102;
			Eq_2 s3_106;
			word32 s4_107;
			word32 a5_308;
			word32 a1_307;
			word32 a0_306;
			word32 s0_305;
			word32 s2_309;
			word32 s5_310;
			word32 s6_311;
			word32 s7_312;
			word32 s8_313;
			word32 s9_314;
			word32 s10_315;
			word32 s11_316;
			word32 a0_317;
			word32 a1_318;
			word32 a5_319;
			word32 s2_320;
			word32 s5_321;
			word32 s6_322;
			word32 s7_323;
			word32 s8_324;
			word32 s9_325;
			word32 s10_326;
			word32 s11_327;
			ra = at_dump_noend(at_dump_noend(ra_52, s1_54, s6_61 + -728, s2_57, (word32) *((word32) a4_47 + 20) + 4, a4_47, s3_58, mstatus_51, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_305, out s1_102, out a0_306, out a1_307, out a2_93, out a3_94, out a4_95, out a5_308, out s2_309, out s3_106, out s4_107, out s5_310, out s6_311, out s7_312, out s8_313, out s9_314, out s10_315, out s11_316, out mstatus_99), s1_102, s4_107 + -0x0700, a2_93, a3_94, a4_95, s3_106, mstatus_99, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_131, out s1_132, out a0_317, out a1_318, out a2, out a3, out a4, out a5_319, out s2_320, out s3_136, out s4_137, out s5_321, out s6_322, out s7_323, out s8_324, out s9_325, out s10_326, out s11_327, out mstatus);
		}
		s1_132 = (word32) s1_132 + 1;
		s0_131 += 56;
	} while (s1_132 != 0x05);
	0x00 = dwArgA8;
}

// 23080B76: void bl_cipstart(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_470986) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack word32 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack word32 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void bl_cipstart(Eq_2 ra, Eq_2 s0, struct Eq_470986 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, word32 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, word32 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	struct Eq_471034 * s4_23 = a0->ptr0008;
	if (s4_23 > (struct Eq_471034 *) 0x04)
		return;
	Eq_2 a4_42;
	Eq_2 a5_43;
	word32 s3_48;
	word32 a0_1695;
	word32 s1_1694;
	word32 a3_1698;
	word32 a1_1696;
	word32 a2_1697;
	word32 s2_1699;
	word32 s4_1700;
	word32 s8_1701;
	Eq_2 s0_45 = xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, 0x04, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, out s1_1694, out a0_1695, out a1_1696, out a2_1697, out a3_1698, out a4_42, out a5_43, out s2_1699, out s3_48, out s4_1700, out s8_1701);
	Eq_2 s7_136 = 0x42028000;
	Eq_2 s2_131 = 0x42028000;
	Eq_2 s3_132 = s3_48 + 0x0330;
	struct Eq_471077 * s6_135 = (char *) s4_23 + 1107411816;
	Eq_2 s1_128 = (word32) s4_23->b4201C3A0;
	if (s1_128 != 0x00)
	{
		Eq_2 a2_1031;
		Eq_2 a3_1032;
		Eq_2 a4_1033;
		Eq_2 s1_1038;
		Eq_2 s3_1040;
		word32 s8_1719;
		word32 s6_1718;
		word32 s5_1717;
		word32 s4_1716;
		word32 a0_1711;
		word32 a7_1714;
		word32 a1_1712;
		word32 a5_1713;
		word32 s2_1715;
		xQueueGenericSend(g_t420280EC, 0x00, 0x00, a4_42, a5_43, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1038, out a0_1711, out a1_1712, out a2_1031, out a3_1032, out a4_1033, out a5_1713, out a7_1714, out s2_1715, out s3_1040, out s4_1716, out s5_1717, out s6_1718, out s8_1719);
		Eq_2 a2_1056;
		Eq_2 a3_1057;
		Eq_2 a4_1058;
		ptr32 mstatus_1062;
		Eq_2 s1_1065;
		Eq_2 s3_1069;
		Eq_2 a2_1088;
		Eq_2 a3_1089;
		Eq_2 a4_1090;
		ptr32 mstatus_1094;
		word32 s0_1096;
		Eq_2 s1_1097;
		Eq_2 s3_1101;
		word32 mstatus_1763;
		word32 s8_1759;
		word32 s9_1760;
		word32 s11_1762;
		word32 s10_1761;
		word32 s3_1754;
		word32 s4_1755;
		word32 s6_1757;
		word32 s7_1758;
		word32 s5_1756;
		word32 a4_1751;
		word32 a5_1752;
		word32 s2_1753;
		word32 a0_1747;
		word32 a1_1748;
		word32 a3_1750;
		word32 a2_1749;
		word32 s11_1744;
		word32 s0_1745;
		word32 s1_1746;
		word32 s7_1740;
		word32 s9_1742;
		word32 s10_1743;
		word32 s8_1741;
		word32 s6_1739;
		word32 s4_1737;
		word32 s5_1738;
		word32 a5_1735;
		word32 s2_1736;
		word32 a0_1733;
		word32 a1_1734;
		word32 s10_1731;
		word32 s11_1732;
		word32 s8_1729;
		word32 s9_1730;
		word32 s6_1727;
		word32 s7_1728;
		word32 s4_1725;
		word32 s5_1726;
		word32 a5_1723;
		word32 s2_1724;
		word32 a1_1722;
		word32 a0_1721;
		word32 s0_1720;
		at_dump_noend(at_dump_noend(at_dump_noend(ra, s1_1038, 0x230C6900, a2_1031, a3_1032, a4_1033, s3_1040, mstatus, dwLoc4C, dwLoc40, dwLoc3C, s6, dwArg0C, dwArg10, dwArg14, dwArg38, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_1720, out s1_1065, out a0_1721, out a1_1722, out a2_1056, out a3_1057, out a4_1058, out a5_1723, out s2_1724, out s3_1069, out s4_1725, out s5_1726, out s6_1727, out s7_1728, out s8_1729, out s9_1730, out s10_1731, out s11_1732, out mstatus_1062), s1_1065, 588012728, a2_1056, a3_1057, a4_1058, s3_1069, mstatus_1062, dwLoc4C, dwLoc40, dwLoc3C, s6, dwArg0C, dwArg10, dwArg14, dwArg38, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_1096, out s1_1097, out a0_1733, out a1_1734, out a2_1088, out a3_1089, out a4_1090, out a5_1735, out s2_1736, out s3_1101, out s4_1737, out s5_1738, out s6_1739, out s7_1740, out s8_1741, out s9_1742, out s10_1743, out s11_1744, out mstatus_1094), s1_1097, s0_1096 + -0x0700, a2_1088, a3_1089, a4_1090, s3_1101, mstatus_1094, dwLoc4C, dwLoc40, dwLoc3C, s6, dwArg0C, dwArg10, dwArg14, dwArg38, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_1745, out s1_1746, out a0_1747, out a1_1748, out a2_1749, out a3_1750, out a4_1751, out a5_1752, out s2_1753, out s3_1754, out s4_1755, out s5_1756, out s6_1757, out s7_1758, out s8_1759, out s9_1760, out s10_1761, out s11_1762, out mstatus_1763);
		return;
	}
	Eq_2 a5_108;
	Eq_2 a4_106;
	Eq_2 a0_111;
	Eq_2 ra_127;
	word32 a5_116;
	Eq_2 s5_134 = (char *) s4_23 + 60 + (s3_48 + 0x0330);
	word32 a2_1702;
	word32 a3_1703;
	word32 a4_1704;
	word32 a5_1705;
	strncpy(s5_134, (word32) s0_45 + 16, 0x0F, out a2_1702, out a3_1703, out a4_1704, out a5_1705);
	s4_23->t4201C37C = *((word32) s0_45 + 272);
	ra_127 = ra;
	word32 a1_1706;
	word32 a2_1707;
	word32 a5_1710;
	word32 a3_1708;
	word32 a4_1709;
	if (strcmp((word32) s0_45 + 0x0C, 588012160, out a1_1706, out a2_1707, out a3_1708, out a4_1709, out a5_1710) != 0x00)
	{
		a5_116 = 0x02;
		ra_127 = ra;
		word32 a5_1768;
		word32 a1_1764;
		word32 a3_1766;
		word32 a4_1767;
		word32 a2_1765;
		if (strcmp((word32) s0_45 + 0x0C, 588012468, out a1_1764, out a2_1765, out a3_1766, out a4_1767, out a5_1768) == 0x00)
			goto l23080C38;
		Eq_2 a3_105;
		word32 a2_1786;
		word32 a1_1785;
		if (strcmp((word32) s0_45 + 0x0C, 588012164, out a1_1785, out a2_1786, out a3_105, out a4_106, out a5_108) != 0x00)
		{
			a0_111 = g_t420280EC;
l23080C96:
			word32 s8_1782;
			word32 s3_1778;
			word32 s4_1779;
			word32 s6_1781;
			word32 s5_1780;
			word32 a5_1775;
			word32 a7_1776;
			word32 s2_1777;
			word32 a2_1772;
			word32 a3_1773;
			word32 a4_1774;
			word32 s1_1769;
			word32 a1_1771;
			word32 a0_1770;
			xQueueGenericSend(a0_111, 0x00, 0x00, a4_106, a5_108, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1769, out a0_1770, out a1_1771, out a2_1772, out a3_1773, out a4_1774, out a5_1775, out a7_1776, out s2_1777, out s3_1778, out s4_1779, out s5_1780, out s6_1781, out s8_1782);
			return;
		}
		if ((word32) s4_23->b4201C381 != 0x00)
		{
			a5_116 = 0x03;
			ra_127 = ra;
l23080C38:
			s6_135->b0018 = (byte) a5_116;
			Eq_2 a0_152;
			Eq_2 s4_167;
			word32 a3_1783;
			word32 s8_1784;
			ip4addr_aton(s5_134, fp + -76, out a0_152, out a3_1783, out a4_106, out a5_108, out s4_167, out s8_1784);
			if (a0_152 == 0x00)
			{
				a0_111 = *((word32) s2_131 + 0x00EC);
				goto l23080C96;
			}
			Eq_2 a5_221;
			Eq_2 a4_220;
			Eq_2 a5_634;
			struct Eq_471315 * s0_607;
			word32 a5_803;
			Eq_2 a5_606;
			struct Eq_471318 * s0_174 = (word32) s3_132 + ((word32) s4_167 + 56);
			Eq_2 a5_175 = (word32) s0_174->b0018;
			if (a5_175 == 0x01)
			{
				Eq_2 a0_821;
				Eq_2 s4_836;
				word32 s9_1806;
				word32 s8_1805;
				word32 s7_1804;
				word32 s6_1803;
				word32 a1_1801;
				word32 a3_1802;
				word32 s1_1800;
				altcp_tcp_new_ip_type(ra_127, s1_128, fp + -76, 0x01, a4_106, s3_132, s4_167, s7_136, mstatus, dwLoc4C, dwLoc48, s6, dwLoc28, dwLoc18, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, s5, s3, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, out s1_1800, out a0_821, out a1_1801, out a3_1802, out a4_220, out a5_221, out s2_131, out s3_132, out s4_836, out s6_1803, out s7_1804, out s8_1805, out s9_1806, out mstatus);
				*((word32) a0_821 + 48) = s0_174;
				if (a0_821 == 0x00)
					goto l23080CBE;
				altcp_arg(a0_821, s4_836);
				Eq_2 a0_856 = altcp_connect(a0_821, a5_221, out a5_606);
				s0_607 = (struct Eq_471315 *) *((word32) a5_606 + 48);
				if (a0_856 != 0x00)
				{
					altcp_close(a5_606, a5_606, out a5_634);
					s0_607->dw0030 = 0x00;
l23080CFA:
					word32 s6_1917;
					word32 s8_1918;
					word32 s3_1914;
					word32 s4_1915;
					word32 s5_1916;
					word32 s2_1913;
					word32 a4_1910;
					word32 a5_1911;
					word32 a7_1912;
					word32 a3_1909;
					word32 a0_1906;
					word32 a1_1907;
					word32 a2_1908;
					word32 s1_1905;
					xQueueGenericSend(*((word32) s2_131 + 0x00EC), 0x00, 0x00, a4_220, a5_634, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1905, out a0_1906, out a1_1907, out a2_1908, out a3_1909, out a4_1910, out a5_1911, out a7_1912, out s2_1913, out s3_1914, out s4_1915, out s5_1916, out s6_1917, out s8_1918);
					return;
				}
l23080F28:
				altcp_err(a5_606, &g_t23080778);
				a5_803 = 0x02;
l23080D5C:
				s0_607->b0038 = (byte) a5_803;
				int32 a5_871 = *s3_132;
				Eq_2 a0_874 = *((word32) s2_131 + 0x00EC);
				*s3_132 = a5_871 + 0x01;
				word32 s8_1932;
				word32 s4_1929;
				word32 s5_1930;
				word32 s6_1931;
				word32 s3_1928;
				word32 s2_1927;
				word32 a4_1924;
				word32 a5_1925;
				word32 a7_1926;
				word32 a3_1923;
				word32 a0_1920;
				word32 a1_1921;
				word32 a2_1922;
				word32 s1_1919;
				xQueueGenericSend(a0_874, 0x00, 0x00, a4_220, a5_871 + 0x01, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1919, out a0_1920, out a1_1921, out a2_1922, out a3_1923, out a4_1924, out a5_1925, out a7_1926, out s2_1927, out s3_1928, out s4_1929, out s5_1930, out s6_1931, out s8_1932);
				return;
			}
			if (a5_175 == 0x02)
			{
				word32 a3_1822;
				word32 s1_1821;
				udp_new_ip_type(ra_127, s1_128, 0x01, a4_106, mstatus, out s1_1821, out a3_1822, out a4_220, out a5_221);
				*(struct Eq_471318 **) 0x5E = s0_174;
				if (true)
				{
					word32 a4_1823;
					Eq_2 a5_779;
					Eq_2 a3_778;
					Eq_2 a0_776 = udp_bind(46, 588036828, null, out a3_778, out a4_1823, out a5_779);
					s0_607 = (struct Eq_471315 *) *((word32) a5_779 + 48);
					if (a0_776 == 0x00)
					{
						Eq_2 a0_787 = udp_connect(a5_779, fp + -76, (word32) s0_607->w0014, dwLoc18, out a3_778, out a4_220, out a5_779, out s2_131);
						s0_607 = (struct Eq_471315 *) *((word32) a5_779 + 48);
						if (a0_787 == 0x00)
						{
							udp_recv(a5_779, &g_t2308081C, s4_167);
							a5_803 = 0x03;
							goto l23080D5C;
						}
					}
					word32 a3_1826;
					word32 a2_1825;
					word32 a0_1824;
					udp_remove(a5_779, a3_778, mstatus, out a0_1824, out a2_1825, out a3_1826, out a4_220, out a5_221);
					s0_607->dw0030 = 0x00;
				}
				goto l23080CBE;
			}
			if (a5_175 != 0x03)
				return;
			Eq_2 s7_402;
			Eq_2 a3_386;
			Eq_2 s3_398;
			Eq_2 s1_394;
			Eq_2 ra_392;
			Eq_2 s4_399;
			Eq_2 a0_383;
			Eq_2 s0_393;
			Eq_2 a4_179 = (word32) s0_174->b0019;
			if (a4_179 == 0x02)
			{
				word32 a0_415;
				word32 s6_1830;
				word32 a2_1828;
				word32 s3_1829;
				word32 s1_1827;
				Eq_2 ra_424 = get_romfs_file_content(ra_127, a0_152, fp + -56, s2_131, mstatus, s6, s0, dwArg18, dwArg88, dwArgC8, dwArg0108, out s0_393, out s1_1827, out a0_415, out a2_1828, out a4_220, out a5_221, out s2_131, out s3_1829, out s6_1830, out mstatus);
				if (a0_415 != 0x00)
					goto l23080CBE;
				ra_392 = altcp_tls_create_config_client(ra_424, s0_393, a0_415, a4_220, mstatus, dwLoc48, dwLoc3C, s6, s0, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg14, dwArg18, dwArg34, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_394, out a0_383, out a3_386, out a4_220, out a5_221, out s2_131, out s3_398, out s4_399, out s7_402, out mstatus);
l23080D9C:
				*((word32) a0_383 + 52) = s0_393;
				Eq_2 s0_478 = *((word32) a0_383 + 52);
				if (a0_383 != 0x00)
				{
					struct Eq_471750 * a4_492;
					Eq_2 a5_493;
					Eq_2 s6_505;
					Eq_2 s7_506;
					Eq_467152 s8_507;
					int32 s9_508;
					Eq_2 a1_489;
					Eq_2 s4_503;
					Eq_2 a0_488;
					Eq_2 s1_498;
					Eq_2 ra_497 = altcp_tls_new(ra_392, s0_478, s1_394, a0_383, 46, a3_386, a4_220, s3_398, s4_399, s7_402, mstatus, dwLoc48, dwLoc3C, s6, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg2C, dwArg38, dwArg3C, s5, s3, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1_498, out a0_488, out a1_489, out a4_492, out a5_493, out s2_131, out s3_132, out s4_503, out s6_505, out s7_506, out s8_507, out s9_508, out mstatus);
					*((word32) a0_488 + 48) = s0_478;
					if (a0_488 == 0x00)
					{
						word32 s3_1832;
						word32 s4_1833;
						word32 s1_1831;
						altcp_tls_free_config(ra_497, s1_498, a0_488, a1_489, a5_493, s2_131, s3_132, mstatus, dwLoc4C, dwLoc48, dwLoc40, s0, dwArg34, ra, dwArg88, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_1831, out a4_220, out a5_221, out s2_131, out s3_1832, out s4_1833)->dw0034 = 0x00;
						goto l23080CBE;
					}
					word32 a5_518 = (word32) a4_492->ptr001C->b0019;
					if (a4_492 != null)
					{
						if (a5_518 != 0x01)
						{
							Eq_2 a0_530 = altcp_tls_context(a0_488);
							if (a0_530 == 0x00)
								__assert_func(ra_497, 0x230C5C5C, s2_131, s6_505, s7_506, s8_507, s9_508);
							Eq_2 a5_550;
							word32 a5_1847;
							ra_497 = mbedtls_ssl_set_hostname(ra_497, mbedtls_ssl_conf_authmode(a0_530, 0x02, out a5_1847), mstatus, dwLoc40, dwLoc3C, dwLoc18, dwArgB8, dwArgF8, out s1_498, out a0_488, out a1_489, out a4_220, out a5_550, out s2_131, out s3_132, out s4_503);
							if (a0_488 != 0x00)
							{
								Eq_2 a5_656;
								Eq_2 a0_654 = altcp_close(a0_488, a5_550, out a5_656);
								*((word32) *((word32) a0_654 + 52) + 48) = 0x00;
								Eq_2 a4_663;
								Eq_2 a5_664;
								struct Eq_472019 * s2_669;
								word32 s3_1849;
								word32 s4_1850;
								word32 s1_1848;
								struct Eq_468006 * s0_667 = altcp_tls_free_config(ra_497, s1_498, a0_654, a1_489, a5_656, s2_131, s3_132, mstatus, dwLoc4C, dwLoc48, dwLoc40, s0, dwArg34, ra, dwArg88, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_1848, out a4_663, out a5_664, out s2_669, out s3_1849, out s4_1850);
								Eq_2 a0_682 = s2_669->t00EC;
								s0_667->dw0034 = 0x00;
								Eq_2 a3_690;
								word32 s8_1863;
								word32 s5_1861;
								word32 s6_1862;
								word32 s3_1859;
								word32 s4_1860;
								word32 a7_1857;
								word32 s2_1858;
								word32 a4_1855;
								word32 a5_1856;
								word32 a1_1853;
								word32 a2_1854;
								word32 s1_1851;
								word32 a0_1852;
								xQueueGenericSend(a0_682, 0x00, 0x00, a4_663, a5_664, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1851, out a0_1852, out a1_1853, out a2_1854, out a3_690, out a4_1855, out a5_1856, out a7_1857, out s2_1858, out s3_1859, out s4_1860, out s5_1861, out s6_1862, out s8_1863);
								word32 s11_1881;
								word32 t4_1882;
								word32 s8_1878;
								word32 s9_1879;
								word32 s10_1880;
								word32 s5_1875;
								word32 s6_1876;
								word32 s7_1877;
								word32 s2_1872;
								word32 s3_1873;
								word32 s4_1874;
								word32 a4_1869;
								word32 a5_1870;
								word32 a7_1871;
								word32 a3_1868;
								word32 a0_1865;
								word32 a1_1866;
								word32 a2_1867;
								word32 s1_1864;
								printf(ra_497, &g_t230C5D08, a3_690, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_1864, out a0_1865, out a1_1866, out a2_1867, out a3_1868, out a4_1869, out a5_1870, out a7_1871, out s2_1872, out s3_1873, out s4_1874, out s5_1875, out s6_1876, out s7_1877, out s8_1878, out s9_1879, out s10_1880, out s11_1881, out t4_1882);
								return;
							}
l23080ED4:
							Eq_2 a5_571 = *((word32) a1_489 + 44);
							if (a1_489 != 0x00)
								s1_498 = mbedtls_ssl_conf_alpn_protocols(a0_488, a1_489, dwArgD8, out a0_488, out a4_220, out a5_571, out s2_131, out s3_132, out s4_503);
							altcp_arg(a0_488, s4_503);
							Eq_2 a0_604 = altcp_connect(a0_488, a5_571, out a5_606);
							s0_607 = (struct Eq_471315 *) *((word32) a5_606 + 48);
							if (a0_604 != 0x00)
							{
								Eq_2 a5_611;
								Eq_2 a0_609 = altcp_close(a5_606, a5_606, out a5_611);
								*((word32) *((word32) a0_609 + 52) + 48) = 0x00;
								word32 s3_1903;
								word32 s4_1904;
								word32 s1_1902;
								altcp_tls_free_config(ra_497, s1_498, a0_609, fp + -76, a5_611, s2_131, s3_132, mstatus, dwLoc4C, dwLoc48, dwLoc40, s0, dwArg34, ra, dwArg88, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_1902, out a4_220, out a5_634, out s2_131, out s3_1903, out s4_1904)->dw0034 = 0x00;
								goto l23080CFA;
							}
							goto l23080F28;
						}
					}
					else
					{
						a4_220.u0 = 0x01;
						if (a5_518 != 0x01)
							goto l23080ED4;
					}
					a4_220.u0 = 0x01;
					word32 a5_1846;
					a1_489 = mbedtls_ssl_conf_authmode(a0_488, 0x00, out a5_1846);
					goto l23080ED4;
				}
				goto l23080CBE;
			}
			word32 a0_244;
			Eq_2 a2_246;
			Eq_2 s6_260;
			Eq_2 s3_257;
			Eq_2 s1_255;
			Eq_2 s0_254;
			Eq_2 ra_253;
			if (a4_179 == a5_175)
			{
				Eq_2 a0_279;
				word32 s6_1838;
				word32 a2_1836;
				word32 s3_1837;
				word32 s1_1835;
				word32 s0_1834;
				Eq_2 ra_288 = get_romfs_file_content(ra_127, a0_152, fp + -72, s2_131, mstatus, s6, s0, dwArg18, dwArg88, dwArgC8, dwArg0108, out s0_1834, out s1_1835, out a0_279, out a2_1836, out a4_220, out a5_221, out s2_131, out s3_1837, out s6_1838, out mstatus);
				if (a0_279 != 0x00)
					goto l23080CBE;
				Eq_2 a0_307;
				word32 s6_1843;
				word32 s3_1842;
				word32 a2_1841;
				word32 s1_1840;
				word32 s0_1839;
				Eq_2 ra_316 = get_romfs_file_content(ra_288, a0_279, fp + -64, s2_131, mstatus, s6, s0, dwArg18, dwArg88, dwArgC8, dwArg0108, out s0_1839, out s1_1840, out a0_307, out a2_1841, out a4_220, out a5_221, out s2_131, out s3_1842, out s6_1843, out mstatus);
				if (a0_307 == 0x00)
				{
					word32 a2_1845;
					word32 s0_1844;
					ra_253 = get_romfs_file_content(ra_316, a0_307, fp + -56, s2_131, mstatus, s6, s0, dwArg18, dwArg88, dwArgC8, dwArg0108, out s0_1844, out s1_255, out a0_244, out a2_1845, out a4_220, out a5_221, out s2_131, out s3_257, out s6_260, out mstatus);
					if (a0_244 != 0x00)
						goto l23080CBE;
					a2_246 = dwArg14;
					s0_254 = dwLoc0C;
l23080DFE:
					ra_392 = altcp_tls_create_config_client_2wayauth(ra_253, s0_254, s1_255, a0_244, a2_246, 0x00, dwLoc48, s2_131, s3_257, dwLoc28, s6_260, mstatus, dwLoc4C, dwLoc48, dwLoc3C, s6, s0, dwLoc28, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg34, dwArg38, s5, dwArg58, dwArg68, dwArg74, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_393, out s1_394, out a0_383, out a3_386, out a4_220, out a5_221, out s2_131, out s3_398, out s4_399, out s7_402, out mstatus);
					goto l23080D9C;
				}
			}
			else
			{
				if (a4_179 != 0x01)
				{
					word32 s5_1894;
					word32 s6_1895;
					word32 s8_1896;
					word32 s2_1891;
					word32 s3_1892;
					word32 s4_1893;
					word32 a4_1888;
					word32 a5_1889;
					word32 a7_1890;
					word32 a1_1885;
					word32 a2_1886;
					word32 a3_1887;
					word32 a0_1884;
					word32 s1_1883;
					xQueueGenericSend(*((word32) s2_131 + 0x00EC), 0x00, 0x00, a4_179, a5_175, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1883, out a0_1884, out a1_1885, out a2_1886, out a3_1887, out a4_1888, out a5_1889, out a7_1890, out s2_1891, out s3_1892, out s4_1893, out s5_1894, out s6_1895, out s8_1896);
					return;
				}
				Eq_2 a0_216;
				word32 s3_1900;
				word32 s6_1901;
