pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
				word32 s0_1897;
				word32 s1_1898;
				word32 a2_1899;
				Eq_2 ra_225 = get_romfs_file_content(ra_127, a0_152, fp + -64, s2_131, mstatus, s6, s0, dwArg18, dwArg88, dwArgC8, dwArg0108, out s0_1897, out s1_1898, out a0_216, out a2_1899, out a4_220, out a5_221, out s2_131, out s3_1900, out s6_1901, out mstatus);
				if (a0_216 == 0x00)
				{
					ra_253 = get_romfs_file_content(ra_225, a0_216, fp + -56, s2_131, mstatus, s6, s0, dwArg18, dwArg88, dwArgC8, dwArg0108, out s0_254, out s1_255, out a0_244, out a2_246, out a4_220, out a5_221, out s2_131, out s3_257, out s6_260, out mstatus);
					if (a0_244 == 0x00)
						goto l23080DFE;
				}
			}
l23080CBE:
			word32 s4_1817;
			word32 s6_1819;
			word32 s8_1820;
			word32 s5_1818;
			word32 a5_1813;
			word32 s2_1815;
			word32 s3_1816;
			word32 a7_1814;
			word32 a4_1812;
			word32 a3_1811;
			word32 a2_1810;
			word32 a1_1809;
			word32 a0_1808;
			word32 s1_1807;
			xQueueGenericSend(*((word32) s2_131 + 0x00EC), 0x00, 0x00, a4_220, a5_221, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_1807, out a0_1808, out a1_1809, out a2_1810, out a3_1811, out a4_1812, out a5_1813, out a7_1814, out s2_1815, out s3_1816, out s4_1817, out s5_1818, out s6_1819, out s8_1820);
			return;
		}
		word32 t4_1799;
		word32 s10_1797;
		word32 s11_1798;
		word32 s9_1796;
		word32 a5_1792;
		word32 a7_1793;
		word32 s8_1795;
		word32 s4_1794;
		word32 a2_1789;
		word32 a3_1790;
		word32 a4_1791;
		word32 a0_1787;
		word32 a1_1788;
		ra_127 = printf(ra, &g_t230C5CD0, a3_105, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_128, out a0_1787, out a1_1788, out a2_1789, out a3_1790, out a4_1791, out a5_1792, out a7_1793, out s2_131, out s3_132, out s4_1794, out s5_134, out s6_135, out s7_136, out s8_1795, out s9_1796, out s10_1797, out s11_1798, out t4_1799);
	}
	a5_116 = 0x01;
	goto l23080C38;
}

// 23080F42: void bl_cipsendbuf()
void bl_cipsendbuf()
{
}

// 23080F46: void bl_cipclose(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
void bl_cipclose(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	if (s1 > 0x04 || (word32) (*((word32) s1 + 1107411872)) == 0x00)
		return;
	Eq_2 a2_35;
	Eq_2 a3_36;
	Eq_2 a4_37;
	ptr32 mstatus_41;
	Eq_2 s1_44;
	Eq_2 s3_48;
	Eq_2 a2_67;
	Eq_2 a3_68;
	Eq_2 a4_69;
	ptr32 mstatus_73;
	Eq_2 s1_76;
	Eq_2 s3_80;
	Eq_2 a2_97;
	Eq_2 a3_98;
	Eq_2 a4_99;
	Eq_2 a5_100;
	ptr32 mstatus_103;
	word32 s4_388;
	word32 s2_387;
	word32 s6_390;
	word32 s5_389;
	word32 s7_391;
	word32 s8_392;
	word32 a1_385;
	word32 a5_386;
	word32 s0_383;
	word32 a0_384;
	word32 s9_393;
	word32 s10_394;
	word32 s11_395;
	word32 s0_396;
	word32 a0_397;
	word32 a1_398;
	word32 a5_399;
	word32 s2_400;
	word32 s4_401;
	word32 s5_402;
	word32 s6_403;
	word32 s7_404;
	word32 s8_405;
	word32 s9_406;
	word32 s10_407;
	word32 s11_408;
	word32 s0_409;
	word32 s1_410;
	word32 a0_411;
	word32 a1_412;
	word32 s2_413;
	word32 s3_414;
	word32 s4_415;
	word32 s5_416;
	word32 s6_417;
	word32 s7_418;
	word32 s8_419;
	word32 s9_420;
	word32 s10_421;
	word32 s11_422;
	Eq_2 ra_104 = at_dump_noend(at_dump_noend(at_dump_noend(ra, s1, 0x230C6900, a2, a3, a4, 0x230C7000, mstatus, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_383, out s1_44, out a0_384, out a1_385, out a2_35, out a3_36, out a4_37, out a5_386, out s2_387, out s3_48, out s4_388, out s5_389, out s6_390, out s7_391, out s8_392, out s9_393, out s10_394, out s11_395, out mstatus_41), s1_44, 588012680, a2_35, a3_36, a4_37, s3_48, mstatus_41, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_396, out s1_76, out a0_397, out a1_398, out a2_67, out a3_68, out a4_69, out a5_399, out s2_400, out s3_80, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out mstatus_73), s1_76, (word32) s3_80 - 0x0700, a2_67, a3_68, a4_69, s3_80, mstatus_73, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_409, out s1_410, out a0_411, out a1_412, out a2_97, out a3_98, out a4_99, out a5_100, out s2_413, out s3_414, out s4_415, out s5_416, out s6_417, out s7_418, out s8_419, out s9_420, out s10_421, out s11_422, out mstatus_103);
	Eq_2 a0_128;
	Eq_2 a1_129;
	Eq_2 a3_131;
	Eq_2 a4_132;
	Eq_2 s3_138;
	word32 a2_423;
	word32 a5_424;
	word32 s8_425;
	Eq_2 s1_136;
	Eq_2 s2_137;
	struct Eq_472586 * s4_139;
	Eq_2 s0_135 = xQueueSemaphoreTake(g_t420280EC, ~0x00, a2_97, a3_98, a4_99, a5_100, mstatus_103, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_136, out a0_128, out a1_129, out a2_423, out a3_131, out a4_132, out a5_424, out s2_137, out s3_138, out s4_139, out s8_425);
	Eq_2 a5_143 = (word32) *((word32) s0_135 + 56);
	if (a5_143 == 0x00)
	{
		word32 s1_426;
		word32 a0_427;
		word32 a1_428;
		word32 a2_429;
		word32 a3_430;
		word32 a4_431;
		word32 a5_432;
		word32 a7_433;
		word32 s2_434;
		word32 s3_435;
		word32 s4_436;
		word32 s5_437;
		word32 s6_438;
		word32 s8_439;
		xQueueGenericSend(*((word32) s3_138 + 0x00EC), 0x00, 0x00, a4_132, a5_143, mstatus_103, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_426, out a0_427, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432, out a7_433, out s2_434, out s3_435, out s4_436, out s5_437, out s6_438, out s8_439);
		return;
	}
	Eq_2 a4_175;
	struct Eq_472647 * s0_207;
	Eq_2 a5_172 = (word32) *((word32) s0_135 + 24);
	((word32) s0_135 + 56)->u0 = 0x00;
	if (a5_172 == 0x02)
	{
		s0_207 = (struct Eq_472647 *) *((word32) a0_128 + 48);
		word32 a0_440;
		word32 a2_441;
		word32 a3_442;
		word32 a5_443;
		s1_136 = udp_remove(a0_128, a3_131, mstatus_103, out a0_440, out a2_441, out a3_442, out a4_175, out a5_443);
	}
	else
	{
		a4_175.u0 = 0x01;
		if (a5_172 != 0x01)
		{
			a4_175.u0 = 0x03;
			if (a5_172 == 0x03)
			{
				Eq_2 a5_180;
				Eq_2 a0_178 = altcp_close(a0_128, a5_172, out a5_180);
				*((word32) *((word32) a0_178 + 52) + 48) = 0x00;
				word32 a5_459;
				word32 s3_460;
				altcp_tls_free_config(ra_104, s1_136, a0_178, a1_129, a5_180, s2_137, s3_138, mstatus_103, s4, s2, dwLoc10, dwArg04, s3, dwArg84, dwArgB8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, dwArg0158, dwArg0178, out s1_136, out a4_175, out a5_459, out s2_137, out s3_460, out s4_139)->dw0034 = 0x00;
			}
			goto l23080FCC;
		}
		s0_207 = (struct Eq_472647 *) *((word32) a0_128 + 48);
		word32 a5_444;
		altcp_close(a0_128, a5_172, out a5_444);
	}
	s0_207->dw0030 = 0x00;
l23080FCC:
	int32 a5_229 = *s2_137;
	Eq_2 a0_232 = s4_139->t00EC;
	*s2_137 = a5_229 + ~0x00;
	(word32) s2_137 + ((word32) s1_136 + 56) + 24 = (word32) 0x00;
	word32 s1_445;
	word32 a0_446;
	word32 a1_447;
	word32 a2_448;
	word32 a3_449;
	word32 a4_450;
	word32 a5_451;
	word32 a7_452;
	word32 s2_453;
	word32 s3_454;
	word32 s4_455;
	word32 s5_456;
	word32 s6_457;
	word32 s8_458;
	xQueueGenericSend(a0_232, 0x00, 0x00, a4_175, a5_229 + ~0x00, mstatus_103, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_445, out a0_446, out a1_447, out a2_448, out a3_449, out a4_450, out a5_451, out a7_452, out s2_453, out s3_454, out s4_455, out s5_456, out s6_457, out s8_458);
}

