pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23081040: void bl_tcpserver(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 (ptr32 word32)) a3, Register (ptr32 Eq_472772) a4, Register word32 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void bl_tcpserver(Eq_2 ra, Eq_2 s1, word32 ** a3, struct Eq_472772 * a4, word32 a5, Eq_2 s2, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 s3_20;
	Eq_2 a0_19 = a4->t000C;
	if (a5 == 0x00)
	{
		word32 * a5_24 = *a3;
		if (a4 == null)
		{
			if (a3 == null)
				return;
			*a5_24 = 0x00;
			if (g_ptr4200F6F4 == (struct Eq_472819 *) 0x01)
			{
				struct Eq_472899 * s0_30 = *((word32) a0_19 + 32);
				word32 a5_322;
				altcp_close(a0_19, 0x01, out a5_322);
				s0_30->dw0020 = 0x00;
			}
			return;
		}
		s3_20.u0 = 0x01;
	}
	else
	{
		s3_20.u0 = 0x03;
		if (a4 == null)
			return;
	}
	struct Eq_472819 * a5_39 = g_ptr4200F6F8;
	if (a5_39 != null)
		return;
	g_w4200F6F0 = (word16) a5_39;
	g_ptr4200F6F4 = (struct Eq_472819 *) 0x01;
	Eq_2 a1_53;
	Eq_2 a3_55;
	Eq_2 a4_56;
	word32 a5_310;
	word32 a2_309;
	word32 a0_308;
	word32 t1_307;
	Eq_2 ra_58 = memset(ra, 1107411720, 0x00, 40, out t1_307, out a0_308, out a1_53, out a2_309, out a3_55, out a4_56, out a5_310);
	if (s3_20 != 0x01)
		return;
	word32 a5_315;
	struct Eq_472853 * a0_68;
	word32 * s2_81;
	word32 s3_82;
	word32 s4_316;
	word32 s6_317;
	word32 s7_318;
	word32 s8_319;
	word32 s9_320;
	word32 mstatus_321;
	word32 a4_314;
	word32 a3_313;
	word32 a1_312;
	word32 s1_311;
	altcp_tcp_new_ip_type(ra_58, 0x4200F6F0, a1_53, a3_55, a4_56, s3_20, 0x01, s7, mstatus, s4, s2, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, s1, ra, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArgF8, out s1_311, out a0_68, out a1_312, out a3_313, out a4_314, out a5_315, out s2_81, out s3_82, out s4_316, out s6_317, out s7_318, out s8_319, out s9_320, out mstatus_321);
	a0_68->dw0020 = 1107411720;
	if (a0_68 == null)
		return;
	Eq_2 a5_103;
	Eq_2 a0_101 = altcp_bind(a0_68, (struct Eq_472917 *) 0x14, out a5_103);
	if (a0_101 == 0x00)
	{
		struct Eq_472924 * s0_104 = *((word32) a0_101 + 32);
		struct Eq_472928 * a0_107 = altcp_listen_with_backlog_and_err(a0_101, a5_103);
		a0_107->ptr0020 = s0_104;
		if (a0_107 == null)
			return;
		*s2_81 = s3_82;
		altcp_accept(a0_107, &g_t230808DC);
	}
	else
	{
		struct Eq_472924 * s0_114 = *((word32) a0_101 + 32);
		word32 a5_323;
		altcp_close(a0_101, a5_103, out a5_323);
		s0_114->dw0020 = 0x00;
	}
}

// 23081132: void bl_cipsend(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_472962) a1, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void bl_cipsend(Eq_2 ra, Eq_2 s1, struct Eq_472962 * a1, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a1 > (struct Eq_472962 *) 0x04)
		return;
	Eq_2 a3_19 = (word32) a1->b4201C3A0;
	if (a3_19 == 0x03)
	{
		Eq_2 a3_35;
		Eq_2 a4_36;
		Eq_2 a1_47;
		Eq_2 a0_53;
		Eq_2 a5_22 = (word32) a1->b4201C380;
		g_t4200F6EC = a3_19;
		if ((a5_22 & 0x00FD) == 0x01)
		{
			Eq_2 a0_55;
			struct Eq_473046 * a5_60;
			word32 s1_293;
			word32 a2_294;
			word32 s2_295;
			word32 s3_296;
			malloc(ra, s1, 0x08, a5_22 & 0x00FD, 0x01, a5_22, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_293, out a0_55, out a2_294, out a3_35, out a4_36, out a5_60, out s2_295, out s3_296);
			a1_47 = a0_55;
			if (a0_55 == 0x00)
				return;
			a5_60->t0000 = a0_55;
			a5_60->t0004 = a0_55;
			a0_53.u0 = 0x23080A28;
		}
		else
		{
			if (a5_22 != 0x02)
				return;
			Eq_2 a0_32;
			struct Eq_473074 * a5_37;
			word32 s1_297;
			word32 a2_298;
			word32 s2_299;
			word32 s3_300;
			malloc(ra, s1, 0x08, a5_22 & 0x00FD, 0x02, a5_22, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_297, out a0_32, out a2_298, out a3_35, out a4_36, out a5_37, out s2_299, out s3_300);
			a1_47 = a0_32;
			if (a0_32 == 0x00)
				return;
			a5_37->t0000 = a0_32;
			a5_37->t0004 = a0_32;
			a0_53.u0 = 587728470;
		}
		word32 s1_301;
		word32 a0_302;
		word32 a3_303;
		word32 a4_304;
		word32 s2_305;
		word32 s4_306;
		word32 s6_307;
		tcpip_callback(a0_53, a1_47, a3_35, a4_36, mstatus, dwArgC8, dwArg0108, dwArg0148, out s1_301, out a0_302, out a3_303, out a4_304, out s2_305, out s4_306, out s6_307);
	}
	else
	{
		word32 s11_291;
		word32 s10_290;
		word32 s9_289;
		word32 s8_288;
		word32 s7_287;
		word32 s6_286;
		word32 s5_285;
		word32 s4_284;
		word32 s3_283;
		word32 s2_282;
		word32 a7_281;
		word32 a5_280;
		word32 a4_279;
		word32 a3_278;
		word32 a2_277;
		word32 a1_276;
		word32 a0_275;
		word32 s1_274;
		word32 t4_292;
		printf(ra, &g_t230C5C98, a3_19, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_274, out a0_275, out a1_276, out a2_277, out a3_278, out a4_279, out a5_280, out a7_281, out s2_282, out s3_283, out s4_284, out s5_285, out s6_286, out s7_287, out s8_288, out s9_289, out s10_290, out s11_291, out t4_292);
	}
}

// 230811DA: void bl_cipsslcconf_path(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void bl_cipsslcconf_path(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if (a4 > 0x04)
		return;
	struct Eq_473129 * s2_39;
	word32 a5_719;
	word32 s3_720;
	word32 s4_721;
	word32 s8_722;
	word32 a1_716;
	word32 a3_717;
	word32 a4_718;
	word32 s1_715;
	Eq_2 a0_128;
	Eq_2 a2_122;
	Eq_2 s0_37 = xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, 0x04, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_715, out a0_128, out a1_716, out a2_122, out a3_717, out a4_718, out a5_719, out s2_39, out s3_720, out s4_721, out s8_722);
	int32 s1_103 = s2_39->dw0008;
	Eq_2 a5_51 = (word32) s0_37 + 0x0330 + (s1_103 + 56);
	struct Eq_473168 * s4_109 = &g_t42028000;
	word32 s0_108 = (word32) s0_37 + 0x0330;
	if ((word32) *((word32) a5_51 + 56) != 0x00)
	{
		word32 a3_727;
		word32 a4_728;
		word32 s8_736;
		word32 a5_729;
		word32 s4_733;
		word32 s5_734;
		word32 s6_735;
		word32 a7_730;
		word32 s2_731;
		word32 s3_732;
		word32 a2_726;
		word32 s1_723;
		word32 a0_724;
		word32 a1_725;
		xQueueGenericSend(g_t420280EC, 0x00, 0x00, s1_103 + 56, a5_51, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_723, out a0_724, out a1_725, out a2_726, out a3_727, out a4_728, out a5_729, out a7_730, out s2_731, out s3_732, out s4_733, out s5_734, out s6_735, out s8_736);
		return;
	}
	Eq_2 a5_267;
	struct Eq_473180 * s0_117;
	Eq_2 a4_101 = s2_39->t000C;
	if (a4_101 != 0x01)
	{
		struct Eq_473180 * s0_187;
		if (a4_101 <= 0x01)
		{
			if (a4_101 != 0x00)
				goto l2308125E;
			Eq_2 a5_269 = *((word32) a0_128 + 32);
			((word32) a5_269 + 25)->u0 = 0x00;
			if (a0_128 != 0x00)
			{
				word32 a3_762;
				word32 a5_763;
				word32 a6_764;
				word32 t3_765;
				word32 a1_761;
				vPortFree(a0_128, a2_122, a5_269, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_761, out a2_122, out a3_762, out a4_101, out a5_763, out a6_764, out s4_109, out t3_765);
			}
			Eq_2 a5_288 = *((word32) a0_128 + 36);
			if (a0_128 != 0x00)
			{
				word32 a6_775;
				word32 t3_776;
				word32 a1_772;
				word32 a3_773;
				word32 a5_774;
				vPortFree(a0_128, a2_122, a5_288, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_772, out a2_122, out a3_773, out a4_101, out a5_774, out a6_775, out s4_109, out t3_776);
			}
			Eq_2 a5_309 = *((word32) a0_128 + 40);
			if (a0_128 != 0x00)
			{
				word32 a6_788;
				word32 t3_789;
				word32 a2_785;
				word32 a3_786;
				word32 a5_787;
				word32 a0_783;
				word32 a1_784;
				vPortFree(a0_128, a2_122, a5_309, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_783, out a1_784, out a2_785, out a3_786, out a4_101, out a5_787, out a6_788, out s4_109, out t3_789);
			}
			s0_187 = s0_108 + (s1_103 + 56);
			s0_187->dw0020 = 0x00;
l23081318:
			s0_187->dw0024 = 0x00;
			s0_187->dw0028 = 0x00;
			a5_267.u0 = 56;
			goto l230812C8;
		}
		if (a4_101 == 0x02)
		{
			Eq_2 a5_120 = *((word32) a0_128 + 32);
			((word32) a5_120 + 25)->u0 = (byte) a4_101;
			if (a0_128 != 0x00)
			{
				word32 t3_817;
				word32 a4_814;
				word32 a5_815;
				word32 a6_816;
				word32 a1_812;
				word32 a3_813;
				vPortFree(a0_128, a2_122, a5_120, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_812, out a2_122, out a3_813, out a4_814, out a5_815, out a6_816, out s4_109, out t3_817);
			}
			Eq_2 a5_139 = *((word32) a0_128 + 36);
			if (a0_128 != 0x00)
			{
				word32 a1_825;
				word32 a6_829;
				word32 t3_830;
				word32 a3_826;
				word32 a4_827;
				word32 a5_828;
				vPortFree(a0_128, a2_122, a5_139, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_825, out a2_122, out a3_826, out a4_827, out a5_828, out a6_829, out s4_109, out t3_830);
			}
			Eq_2 a5_160 = *((word32) a0_128 + 40);
			if (a0_128 != 0x00)
			{
				word32 a1_832;
				word32 a5_836;
				word32 t3_838;
				word32 a6_837;
				word32 a2_833;
				word32 a4_835;
				word32 a3_834;
				word32 a0_831;
				vPortFree(a0_128, a2_122, a5_160, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_831, out a1_832, out a2_833, out a3_834, out a4_835, out a5_836, out a6_837, out s4_109, out t3_838);
			}
			a4_101 = s2_39->t0010;
			s0_187 = s0_108 + (s1_103 + 56);
			*((word32) a4_101 + 32) = s0_187;
			goto l23081318;
		}
		if (a4_101 != 0x03)
		{
l2308125E:
			word32 a7_744;
			word32 s2_745;
			word32 s3_746;
			word32 s8_750;
			word32 s4_747;
			word32 s5_748;
			word32 s6_749;
			word32 a5_743;
			word32 a2_740;
			word32 a3_741;
			word32 a4_742;
			word32 s1_737;
			word32 a0_738;
			word32 a1_739;
			xQueueGenericSend(g_t420280EC, 0x00, 0x00, a4_101, a5_51, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_737, out a0_738, out a1_739, out a2_740, out a3_741, out a4_742, out a5_743, out a7_744, out s2_745, out s3_746, out s4_747, out s5_748, out s6_749, out s8_750);
			return;
		}
		Eq_2 a5_190 = *((word32) a0_128 + 32);
		((word32) a5_190 + 25)->u0 = (byte) a4_101;
		if (a0_128 != 0x00)
		{
			word32 t3_771;
			word32 a4_768;
			word32 a5_769;
			word32 a6_770;
			word32 a1_766;
			word32 a3_767;
			vPortFree(a0_128, a2_122, a5_190, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_766, out a2_122, out a3_767, out a4_768, out a5_769, out a6_770, out s4_109, out t3_771);
		}
		Eq_2 a5_209 = *((word32) a0_128 + 36);
		if (a0_128 != 0x00)
		{
			word32 a4_779;
			word32 a5_780;
			word32 a6_781;
			word32 t3_782;
			word32 a3_778;
			word32 a1_777;
			vPortFree(a0_128, a2_122, a5_209, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_777, out a2_122, out a3_778, out a4_779, out a5_780, out a6_781, out s4_109, out t3_782);
		}
		Eq_2 a5_230 = *((word32) a0_128 + 40);
		if (a0_128 != 0x00)
		{
			word32 t3_797;
			word32 a6_796;
			word32 a5_795;
			word32 a2_792;
			word32 a3_793;
			word32 a4_794;
			word32 a0_790;
			word32 a1_791;
			vPortFree(a0_128, a2_122, a5_230, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_790, out a1_791, out a2_792, out a3_793, out a4_794, out a5_795, out a6_796, out s4_109, out t3_797);
		}
		a4_101 = s2_39->t0010;
		s0_117 = s0_108 + (s1_103 + 56);
		*((word32) a4_101 + 32) = s0_117;
	}
	else
	{
		Eq_2 a5_55 = *((word32) a0_128 + 32);
		((word32) a5_55 + 25)->u0 = (byte) a4_101;
		if (a0_128 != 0x00)
		{
			word32 a5_753;
			word32 a6_754;
			word32 t3_755;
			word32 a1_751;
			word32 a3_752;
			vPortFree(a0_128, a2_122, a5_55, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_751, out a2_122, out a3_752, out a4_101, out a5_753, out a6_754, out s4_109, out t3_755);
		}
		Eq_2 a5_74 = *((word32) a0_128 + 36);
		if (a0_128 != 0x00)
		{
			word32 t3_760;
			word32 a3_757;
			word32 a5_758;
			word32 a6_759;
			word32 a1_756;
			vPortFree(a0_128, a2_122, a5_74, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_128, out a1_756, out a2_122, out a3_757, out a4_101, out a5_758, out a6_759, out s4_109, out t3_760);
		}
		Eq_2 a5_95 = *((word32) a0_128 + 40);
		if (a0_128 != 0x00)
		{
			word32 a0_818;
			word32 a5_822;
			word32 a6_823;
			word32 t3_824;
			word32 a1_819;
			word32 a2_820;
			word32 a3_821;
			vPortFree(a0_128, a2_122, a5_95, mstatus, dwArg0138, dwArg0178, out s0_108, out s1_103, out a0_818, out a1_819, out a2_820, out a3_821, out a4_101, out a5_822, out a6_823, out s4_109, out t3_824);
		}
		s0_117 = s0_108 + (s1_103 + 56);
		s0_117->dw0020 = 0x00;
	}
	s2_39->ptr0018->ptr0024 = s0_117;
	a5_267 = s2_39->t0014;
	*((byte) a5_267.u0 + 40) = s0_117;
l230812C8:
	word32 a3_802;
	word32 s6_810;
	word32 s8_811;
	word32 a4_803;
	word32 s3_807;
	word32 s4_808;
	word32 s5_809;
	word32 a5_804;
	word32 a7_805;
	word32 s2_806;
	word32 a2_801;
	word32 a1_800;
	word32 a0_799;
	word32 s1_798;
	xQueueGenericSend(s4_109->t00EC, 0x00, 0x00, a4_101, a5_267, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_798, out a0_799, out a1_800, out a2_801, out a3_802, out a4_803, out a5_804, out a7_805, out s2_806, out s3_807, out s4_808, out s5_809, out s6_810, out s8_811);
}

