pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230813A2: void bl_cipsslcsni(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void bl_cipsslcsni(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a4 <= 0x04)
	{
		Eq_2 a4_40;
		word32 s2_45;
		word32 s8_331;
		word32 s3_329;
		word32 s4_330;
		word32 a2_326;
		word32 a3_327;
		word32 a5_328;
		word32 s1_323;
		word32 a0_324;
		word32 a1_325;
		Eq_2 s0_43 = xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, 0x04, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_323, out a0_324, out a1_325, out a2_326, out a3_327, out a4_40, out a5_328, out s2_45, out s3_329, out s4_330, out s8_331);
		int32 s8_51 = *((word32) s0_43 + 8);
		Eq_2 s1_57 = s2_45 + 0x0330 + (s8_51 + 56);
		if ((word32) *((word32) s1_57 + 56) != 0x00)
		{
			word32 a5_339;
			word32 a7_340;
			word32 a3_337;
			word32 a4_338;
			word32 a1_335;
			word32 a2_336;
			word32 s1_333;
			word32 a0_334;
			word32 s2_341;
			word32 s3_342;
			word32 s4_343;
			word32 s5_344;
			word32 s6_345;
			word32 s8_346;
			xQueueGenericSend(g_t420280EC, 0x00, 0x00, a4_40, s8_51 + 56, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_333, out a0_334, out a1_335, out a2_336, out a3_337, out a4_338, out a5_339, out a7_340, out s2_341, out s3_342, out s4_343, out s5_344, out s6_345, out s8_346);
			goto l23081406;
		}
		Eq_2 a3_62;
		Eq_2 a2_66;
		word32 a1_332;
		Eq_2 a4_104;
		Eq_2 a5_108;
		Eq_2 a0_61 = strlen((word32) s0_43 + 0x0C, out a1_332, out a2_66, out a3_62, out a4_104, out a5_108);
		if (a0_61 == 0x00)
		{
			if (a0_61 != 0x00)
			{
				struct Eq_473855 * s1_148;
				word32 s0_366;
				word32 a0_367;
				word32 a1_368;
				word32 a2_369;
				word32 a3_370;
				word32 a6_371;
				word32 s4_372;
				word32 t3_373;
				vPortFree(a0_61, a2_66, a5_108, mstatus, dwArg0128, dwArg0168, out s0_366, out s1_148, out a0_367, out a1_368, out a2_369, out a3_370, out a4_104, out a5_108, out a6_371, out s4_372, out t3_373);
				s1_148->dw001C = 0x00;
			}
			goto l23081438;
		}
		Eq_2 a0_69;
		Eq_2 a2_71;
		Eq_2 a4_73;
		Eq_2 a5_74;
		ptr32 s2_78;
		ptr32 s3_79;
		word32 s8_81;
		word32 s1_347;
		word32 a1_348;
		word32 a3_349;
		word32 a6_350;
		word32 s4_351;
		Eq_2 s0_76 = pvPortMalloc(ra, s1_57, (word32) a0_61 + 1, a3_62, a4_104, a5_108, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_347, out a0_69, out a1_348, out a2_71, out a3_349, out a4_73, out a5_74, out a6_350, out s2_78, out s3_79, out s4_351, out s8_81);
		Eq_2 s4_101 = a0_69;
		if (a0_69 != 0x00)
		{
			if (a0_69 != 0x00)
			{
				struct Eq_473932 * s1_90;
				word32 a0_389;
				word32 a1_390;
				word32 a2_391;
				word32 a3_392;
				word32 a4_393;
				word32 a5_394;
				word32 a6_395;
				word32 t3_396;
				vPortFree(a0_69, a2_71, a5_74, mstatus, dwArg0128, dwArg0168, out s0_76, out s1_90, out a0_389, out a1_390, out a2_391, out a3_392, out a4_393, out a5_394, out a6_395, out s4_101, out t3_396);
				s1_90->dw001C = 0x00;
			}
			word32 a5_388;
			strcpy(s4_101, s0_76, out a4_104, out a5_388);
			*((word32) s4_101 + s3_79) = 0x00;
			(s2_78 + (s8_81 + 56))->t001C = s4_101;
			a5_108 = s8_81 + 56;
l23081438:
			word32 s1_352;
			word32 a0_353;
			word32 a1_354;
			word32 a2_355;
			word32 a3_356;
			word32 a4_357;
			word32 a5_358;
			word32 a7_359;
			word32 s2_360;
			word32 s3_361;
			word32 s4_362;
			word32 s5_363;
			word32 s6_364;
			word32 s8_365;
			xQueueGenericSend(g_t420280EC, 0x00, 0x00, a4_104, a5_108, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_352, out a0_353, out a1_354, out a2_355, out a3_356, out a4_357, out a5_358, out a7_359, out s2_360, out s3_361, out s4_362, out s5_363, out s6_364, out s8_365);
			goto l23081406;
		}
		word32 s1_374;
		word32 a0_375;
		word32 a1_376;
		word32 a2_377;
		word32 a3_378;
		word32 a4_379;
		word32 a5_380;
		word32 a7_381;
		word32 s2_382;
		word32 s3_383;
		word32 s4_384;
		word32 s5_385;
		word32 s6_386;
		word32 s8_387;
		xQueueGenericSend(g_t420280EC, 0x00, 0x00, a4_73, a5_74, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_374, out a0_375, out a1_376, out a2_377, out a3_378, out a4_379, out a5_380, out a7_381, out s2_382, out s3_383, out s4_384, out s5_385, out s6_386, out s8_387);
	}
l23081406:
	0x00 = (int8) dwArg0128;
}

// 2308148E: void bl_cipsslcalpn(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void bl_cipsslcalpn(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	Eq_2 a0_108;
	struct Eq_473969 * a0_19 = *((word32) a4 + 8);
	Eq_2 a5_113 = 0x04;
	if (a4 > 0x04)
		a0_108 = a0_19->t000C;
	else
	{
		Eq_2 a0_29;
		Eq_2 a2_31;
		struct Eq_473979 * s4_40;
		word32 s1_246;
		word32 a1_247;
		word32 a3_248;
		word32 a4_249;
		word32 a5_250;
		word32 s2_251;
		word32 s3_252;
		word32 s8_253;
		struct Eq_473988 * s3_44 = *((word32) xQueueSemaphoreTake(g_t420280EC, ~0x00, a2, a3, a4, 0x04, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_246, out a0_29, out a1_247, out a2_31, out a3_248, out a4_249, out a5_250, out s2_251, out s3_252, out s4_40, out s8_253) + 8);
		int32 s1_49 = 1107411760;
		if ((word32) s3_44->b4201C3A0 == 0x00)
		{
			Eq_2 a4_52 = *((word32) a0_29 + 44);
			if (a0_29 != 0x00)
			{
				word32 s0_289;
				word32 a0_290;
				word32 a1_291;
				word32 a2_292;
				word32 a3_293;
				word32 a5_294;
				word32 a6_295;
				word32 s4_296;
				word32 t3_297;
				vPortFree(a0_29, a2_31, 0x4201C000, mstatus, dwArg0138, dwArg0178, out s0_289, out s1_49, out a0_290, out a1_291, out a2_292, out a3_293, out a4_52, out a5_294, out a6_295, out s4_296, out t3_297);
			}
			Eq_2 a0_72 = g_t420280EC;
			Eq_2 a5_77 = (char *) s3_44 + 56 + s1_49;
			*((word32) a4_52 + 44) = a5_77;
			word32 s1_275;
			word32 a0_276;
			word32 a1_277;
			word32 a2_278;
			word32 a3_279;
			word32 a4_280;
			word32 a5_281;
			word32 a7_282;
			word32 s2_283;
			word32 s3_284;
			word32 s4_285;
			word32 s5_286;
			word32 s6_287;
			word32 s8_288;
			xQueueGenericSend(a0_72, 0x00, 0x00, a4_52, a5_77, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_275, out a0_276, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a7_282, out s2_283, out s3_284, out s4_285, out s5_286, out s6_287, out s8_288);
			return;
		}
		word32 s1_264;
		word32 a1_265;
		word32 a3_266;
		word32 a4_267;
		word32 a7_268;
		word32 s2_269;
		word32 s3_270;
		word32 s4_271;
		word32 s5_272;
		word32 s6_273;
		word32 s8_274;
		xQueueGenericSend(s4_40->t00EC, 0x00, 0x00, (char *) s3_44 + 1107411816, 0x4201C000, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_264, out a0_108, out a1_265, out a2, out a3_266, out a4_267, out a5_113, out a7_268, out s2_269, out s3_270, out s4_271, out s5_272, out s6_273, out s8_274);
	}
	if (a0_108 != 0x00)
	{
		struct Eq_474020 * s0_150;
		word32 s1_254;
		word32 a0_255;
		word32 a1_256;
		word32 a2_257;
		word32 a3_258;
		word32 a4_259;
		word32 a5_260;
		word32 a6_261;
		word32 s4_262;
		word32 t3_263;
		vPortFree(a0_108, a2, a5_113, mstatus, dwArg0138, dwArg0178, out s0_150, out s1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260, out a6_261, out s4_262, out t3_263);
		s0_150->dw000C = 0x00;
	}
}

// 23081536: void format_int(Register (ptr32 byte) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ui32 a4, Register Eq_2 a5, Register int32 a6, Register int32 a7, Register Eq_2 s3, Stack ui32 dwArg08)
void format_int(byte * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ui32 a4, Eq_2 a5, int32 a6, int32 a7, Eq_2 s3, ui32 dwArg08)
{
	byte * s0_160 = a0;
	Eq_2 s6_37 = a2;
	Eq_2 s7_387 = a3;
	ui32 s8_40 = a4;
	int32 s11_169 = a6;
	int32 s1_101 = a7;
	ui32 s3_131 = 0x00;
	if ((a4 & 64) != 0x00 && a3 < 0x00)
	{
		s6_37 = 0x00 - a2;
		s7_387 = 0x00 - a3 - (word32) (s6_37 != 0x00);
		s3_131 = 0x01;
	}
	Eq_2 a0_62 = s6_37;
	Eq_2 a1_64 = s7_387;
	int32 s2_65 = 0x00;
	a5_379 = a5;
	while (true)
	{
		Eq_2 a5_379;
		if ((a0_62 | a1_64) == 0x00)
			break;
		word32 a3_1067;
		word32 a4_1068;
		a0_62 = __udivdi3(a0_62, a1_64, a5_379, a5 >> 0x1F, out a1_64, out a3_1067, out a4_1068, out a5_379);
		++s2_65;
	}
	Eq_2 a0_422 = a4 & 32;
	if ((a4 & 32) != 0x00 && a5_379 == 0x08)
	{
		if (s2_65 < a7)
		{
l230815C4:
			int32 s10_115 = s1_101;
			if ((a4 & 8) != 0x00)
			{
				s10_115 = 0x04;
				if (a5_379 != 0x10)
					s10_115 = 0x03;
			}
			int32 s2_125 = (s1_101 + -1 ^ s10_115) + s1_101;
			int32 s1_135 = (word32) ((a4 & 20 | s3_131) != 0x00) + s2_125;
			if ((a4 & 32) != 0x00 && a5_379 == 0x10)
				s1_135 += 0x02;
			Eq_2 a3_144 = 0x00;
			if ((a4 & 3) == 0x00)
			{
				a3_144 = a4 & 3;
				if (s1_135 < a6)
				{
					a3_144 = a6 - s1_135;
					Eq_2 a2_155 = 0x00;
					do
					{
						if (a2_155 < a1)
						{
							*s0_160 = 0x20;
							++s0_160;
						}
						a2_155 = (word32) a2_155 + 1;
					} while (a2_155 != a3_144);
					s11_169 = s1_135;
				}
			}
			if (s3_131 != 0x00)
			{
				if (a3_144 < a1)
				{
					*s0_160 = 0x2D;
					++s0_160;
				}
			}
			else if ((a4 & 4) != 0x00)
			{
				if (a3_144 < a1)
				{
					*s0_160 = 0x2B;
					++s0_160;
				}
			}
			else
			{
				if ((a4 & 16) == 0x00)
				{
l23081638:
					if ((a4 & 32) != 0x00 && a5_379 == 0x10)
					{
						if (a3_144 < a1)
						{
							*s0_160 = 0x30;
							++s0_160;
						}
						if ((word32) a3_144 + 1 < a1)
						{
							int32 a2_233 = 88;
							if ((a4 & 0x0080) == 0x00)
								a2_233 = 0x0078;
							*s0_160 = (byte) a2_233;
							++s0_160;
						}
						a3_144 = (word32) a3_144 + 2;
					}
					if ((a4 & 3) == 0x01 && s2_125 < s11_169)
					{
						for (; s1_135 < s11_169; s11_169 += ~0x00)
						{
							if (a3_144 < a1)
							{
								*s0_160 = 0x30;
								++s0_160;
							}
							a3_144 = (word32) a3_144 + 1;
						}
					}
					struct Eq_474320 * s0_305 = s0_160 + s2_125;
					Eq_2 s4_323 = (word32) a3_144 + s2_125;
					int32 s5_345 = s10_115;
					struct Eq_474320 * s3_346 = s0_305;
					while (s2_125 > 0x00)
					{
						if (s5_345 != 0x00)
							s5_345 += ~0x00;
						else
						{
							s4_323 = (word32) s4_323 - 1;
							if (s4_323 < a1)
								s3_346[0x0FFF] = (struct Eq_474320) 0x5F;
							s3_346 = (struct Eq_474320 *) ((char *) s3_346 - 1);
							s2_125 += ~0x00;
							s5_345 = s10_115 + -1;
						}
						Eq_2 a5_395;
						s2_125 += ~0x00;
						if ((word32) s4_323 - 1 < a1)
						{
							a3_144 = (word32) *((word32) a5_395 + __umoddi3(s6_37, s7_387, a5_379, a3_144, out a5_395));
							s3_346[0x0FFF] = (struct Eq_474320) (byte) a3_144;
							a5_379 = a5_395;
						}
						Eq_2 a1_423;
						word32 a4_1069;
						a0_422 = __udivdi3(s6_37, s7_387, a5_379, a3_144, out a1_423, out a3_144, out a4_1069, out a5_379);
						s4_323 = s3;
						s6_37 = a0_422;
						s7_387 = a1_423;
						s8_40 = dwArg08;
					}
					ui32 a4_450 = s8_40 & 2;
					int32 a6_465 = (word32) a0_422 + s11_169;
					while (a4_450 != 0x00 && s1_135 < a6_465 - a0_422)
					{
						if (a0_422 < a1)
						{
							s0_305->b0000 = 0x20;
							++s0_305;
						}
						a0_422 = (word32) a0_422 + 1;
					}
					return;
				}
				if (a3_144 < a1)
				{
					*s0_160 = 0x20;
					++s0_160;
				}
			}
			a3_144 = (word32) a3_144 + 1;
			goto l23081638;
		}
		s1_101 = s2_65 + 1;
	}
	if (s2_65 >= s1_101)
	{
		s1_101 = s2_65;
		if ((s6_37 | s7_387) == 0x00)
			s1_101 = 0x01;
	}
	goto l230815C4;
}

// 23081790: Register Eq_2 cvt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_474433) a2, Register (ptr32 ptr32) a3, Register Eq_2 a5, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg54, Stack Eq_2 dwArgE4, Stack word32 dwArg0164, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_474451 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      ecvtbuf
//      fcvtbuf
Eq_2 cvt(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_474433 * a2, ptr32 * a3, Eq_2 a5, ptr32 fflags, ptr32 frm, Eq_2 dwArg54, Eq_2 dwArgE4, word32 dwArg0164, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_474451 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 s1_15 = a5;
	Eq_2 s2_38 = a1;
	ptr32 * s5_218 = a3;
	struct Eq_474433 * s0_213 = (struct Eq_474433 *) 78;
	if (a2 <= (struct Eq_474433 *) 78)
	{
		s0_213 = a2;
		if (a2 < null)
			s0_213 = null;
	}
	Eq_2 a4_62;
	word32 a1_944;
	word32 a5_945;
	word32 a7_946;
	if (__ledf2(a0, a1, 0x00, 0x00, fflags, frm, out a1_944, out a4_62, out a5_945, out a7_946) >= 0x00)
		*a4_62 = 0x00;
	else
	{
		*(union Eq_2 *) 0x01 = a4_62;
		s2_38 = a1 ^ 0x80000000;
	}
	Eq_2 a4_131;
	ptr32 fflags_127;
	ptr32 frm_126;
	Eq_2 s7_234;
	ptr32 s6_141;
	Eq_2 ra_149;
	Eq_2 a5_132;
	modf(ra, a0, a1, a2, fflags, frm);
	0x00 = (int8) dwArgE4;
	Eq_2 s3_216 = a0;
	Eq_2 s4_217 = s2_38;
	Eq_2 s2_139 = (word32) a5 + 80;
	word32 a1_947;
	word32 a5_948;
	Eq_2 a4_119;
	if (__eqdf2(a0, s2_38, 0x00, 0x00, fflags, frm, out a1_947, out a4_119, out a5_948) == 0x00)
	{
		s6_141 = 0x00;
		ra_149 = ra;
		frm_126 = frm;
		fflags_127 = fflags;
		word32 a1_949;
		if (__gedf2(a0, s2_38, 0x00, 0x00, fflags, frm, out a1_949, out a4_131, out a5_132) > 0x00)
		{
			s10 = g_t230BF7A8;
			s11 = g_t230BF7AC;
			ra_149 = ra;
			frm_126 = frm;
			fflags_127 = fflags;
			while (true)
			{
				Eq_2 a0_276;
				Eq_2 a1_277;
				Eq_337990 s9_303;
				word32 a3_950;
				word32 s7_951;
				ra_149 = __muldf3(ra_149, s3_216, s4_217, s10, s11, fflags_127, frm_126, out s0_213, out s1_15, out a0_276, out a1_277, out a3_950, out s2_139, out s3_216, out s4_217, out s5_218, out s6_141, out s7_951, out s8, out s9_303, out fflags_127, out frm_126);
				Eq_2 a7_315;
				word32 a1_952;
				if (__ledf2(a0_276, a1_277, s8, s9_303, fflags_127, frm_126, out a1_952, out a4_131, out a5_132, out a7_315) >= 0x00)
					break;
				s3_216 = a7_315;
				s4_217 = a1_277;
			}
		}
		s7_234 = s1_15;
	}
	else
	{
		Eq_2 s8_106 = g_t230BF7AC;
		Eq_2 s7_105 = g_t230BF7A8;
		Eq_2 a5_109 = g_t230C6108;
		s11 = (word32) a5 + 80;
		dwArg18 = g_t230C610C;
		s10 = s8_106;
		frm_126 = frm;
		fflags_127 = fflags;
		ra_149 = ra;
		while (true)
		{
			0x00 = dwArg0164;
			dwLoc64 = a4_119;
			s6_141 = s2_139 - s11;
			s8 = dwArg54;
			word32 a1_960;
			if (__eqdf2(a4_119, a5_109, 0x00, 0x00, fflags_127, frm_126, out a1_960, out a4_131, out a5_132) == 0x00)
				break;
			Eq_2 a0_150;
			Eq_2 a1_151;
			Eq_2 a3_153;
			ptr32 fflags_165;
			ptr32 frm_166;
			Eq_2 s9_177;
			word32 s0_961;
			word32 s2_963;
			word32 s1_962;
			word32 s7_967;
			word32 s5_965;
			word32 s3_964;
			word32 s6_966;
			Eq_2 ra_167 = __divdf3(ra_149, a4_131, a5_132, s7_105, dwArg54, fflags_127, frm_126, out s0_961, out s1_962, out a0_150, out a1_151, out a3_153, out s2_963, out s3_964, out s5_965, out s6_966, out s7_967, out s9_177, out fflags_165, out frm_166);
			modf(ra, a0, a1, a2, fflags, frm);
			Eq_2 a1_184;
			Eq_2 a0_195;
			Eq_2 a1_196;
			word32 a3_968;
			word32 s6_969;
			word32 s8_970;
			word32 s9_971;
			ra_149 = __muldf3(ra_167, __adddf3(ra_167, a0_150, a1_151, fp + -80, a3_153, fflags_165, frm_166, out a1_184), a1_184, s9_177, s8_106, fflags_165, frm_166, out s0_213, out s1_15, out a0_195, out a1_196, out a3_968, out s2_139, out s3_216, out s4_217, out s5_218, out s6_969, out s7_105, out s8_970, out s9_971, out fflags_127, out frm_126);
			s11 += ~0x00;
			word32 a1_972;
			word32 a3_973;
			*s11 = (byte) ((word32) __fixdfsi(ra_149, a0_195, a1_196, fflags_127, frm_126, out a1_972, out a3_973, out a4_119, out a5_109) + 48);
		}
		s7_234 = s1_15;
		while (s11 < s2_139)
		{
			++s11;
			a5_132 = (word32) *((word32) s11 - 1);
			s7_234 = (word32) s7_234 + 1;
			*((word32) s7_234 + 0x0FFF) = (byte) a5_132;
		}
	}
	word32 s0_342 = s0_213 + s1_15;
	if (a5_132 == 0x00)
		s0_342 = (word32) s0_342 + s6_141;
	*s5_218 = s6_141;
	if (s0_342 >= s1_15)
	{
		s8 = g_t230BF7A8;
		Eq_2 s9_364 = g_t230BF7AC;
		while (s0_342 >= s7_234 && s7_234 < s2_139)
		{
			Eq_2 a0_379;
			Eq_2 a1_380;
			struct Eq_474656 * s7_404;
			word32 s4_956;
			word32 s0_953;
			word32 a3_954;
			word32 s3_955;
			ra_149 = __muldf3(ra_149, s3_216, s4_217, s8, s9_364, fflags_127, frm_126, out s0_953, out s1_15, out a0_379, out a1_380, out a3_954, out s2_139, out s3_955, out s4_956, out s5_218, out s6_141, out s7_404, out s8, out s9_364, out fflags_127, out frm_126);
			modf(ra, a0, a1, a2, fflags, frm);
			word32 a1_957;
			word32 a3_958;
			word32 a5_959;
			s7_404->b1000 = (byte) ((word32) __fixdfsi(ra_149, a0_379, a1_380, fflags_127, frm_126, out a1_957, out a3_958, out a4_131, out a5_959) + 48);
			s3_216 = a0_379;
			s4_217 = a1_380;
			s0_342 = dwArgE4;
			s7_234 = (char *) s7_404 + 1;
		}
		if (s0_342 >= s2_139)
			((word32) s1_15 + 79)->u0 = 0x00;
		else
		{
			*s0_342 = (byte) ((word32) *s0_342 + 0x05);
			Eq_2 a2_428 = 57;
			Eq_2 a5_433 = s0_342;
			while (true)
			{
				a4_131 = (word32) *a5_433;
				if (a2_428 >= a4_131)
					break;
				*a5_433 = 0x30;
				if (s1_15 < a5_433)
				{
					a5_433 += ~0x00;
					*a5_433 = (byte) ((word32) *((word32) a5_433 - 1) + 0x01);
				}
				else
				{
					*a5_433 = 0x31;
					ptr32 a4_444 = *s5_218;
					*s5_218 = a4_444 + 0x01;
					a2_428 = dwArg54;
					if (a4_444 == 0x01)
					{
						if (s1_15 < s0_342)
							*s0_342 = 0x30;
						++s0_342;
					}
				}
			}
			*s0_342 = 0x00;
		}
	}
	else
		*s1_15 = 0x00;
	s0Out = s0_342;
	s1Out = dwLoc64;
	a0Out = dwArgA4;
	a4Out = a4_131;
	s2Out = s2_139;
	s3Out = s3_216;
	s4Out = s4_217;
	s6Out = s6_141;
	s7Out = s7_234;
	s8Out = s8;
	s9Out = dwArg18;
	s10Out = s10;
	s11Out = s11;
	fflagsOut = fflags_127;
	frmOut = frm_126;
	return dwLoc24;
}

