pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
<anonymous> g_t23081E86 = <code>;
// 230822E4: Register Eq_2 vsprintf(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_274) a1, Register Eq_485 a2, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 t4Out)
// Called from:
//      vprint
Eq_2 vsprintf(Eq_2 ra, Eq_2 a0, struct Eq_274 * a1, Eq_485 a2, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg010C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & t4Out)
{
	ptr32 a0_11;
	ptr32 a3_12;
	ptr32 a5_13;
	ptr32 a7_14;
	ptr32 s0_16;
	ptr32 s1_17;
	ptr32 s10_18;
	ptr32 s11_19;
	ptr32 s2_20;
	ptr32 s3_21;
	ptr32 s4_22;
	ptr32 s6_23;
	ptr32 s7_24;
	ptr32 s8_25;
	ptr32 s9_26;
	ptr32 t4_29;
	ptr32 a1_30;
	ptr32 a4_32;
	ptr32 s5_33;
	word32 t0_60;
	word32 a2_61;
	Eq_2 ra_15 = vsnprintf(ra, a0, 480, a1, a2, dwArg58, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg010C, out t0_60, out s0_16, out s1_17, out a0_11, out a1_30, out a2_61, out a3_12, out a4_32, out a5_13, out a7_14, out s2_20, out s3_21, out s4_22, out s5_33, out s6_23, out s7_24, out s8_25, out s9_26, out s10_18, out s11_19, out t4_29);
	s0Out = s0_16;
	s1Out = s1_17;
	a0Out = a0_11;
	a1Out = a1_30;
	a3Out = a3_12;
	a4Out = a4_32;
	a5Out = a5_13;
	a7Out = a7_14;
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	s5Out = s5_33;
	s6Out = s6_23;
	s7Out = s7_24;
	s8Out = s8_25;
	s9Out = s9_26;
	s10Out = s10_18;
	s11Out = s11_19;
	t4Out = t4_29;
	return ra_15;
}

// 230822F0: Register Eq_2 vprint(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_485 a1, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgFC, Register out Eq_2 s1Out, Register out (ptr32 Eq_274) a0Out, Register out Eq_485 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_354682 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 t4Out)
// Called from:
//      ef_log_debug
//      ef_log_info
//      ef_print
//      bl_printk
//      printf
Eq_2 vprint(Eq_2 ra, struct Eq_274 * a0, Eq_485 a1, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgFC, union Eq_2 & s1Out, struct Eq_274 & a0Out, union Eq_485 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_354682 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & t4Out)
{
	ui32 a5_5 = (word32) g_b4200ECB8;
	if ((a5_5 & 0x00FF) == 0x00)
	{
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5 & 0x00FF;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		t4Out = t4;
		return ra;
	}
	else
	{
		ptr32 a3_21;
		ptr32 a7_24;
		word32 s0_26;
		Eq_2 s1_27;
		ptr32 s10_28;
		ptr32 s11_29;
		ptr32 s2_30;
		ptr32 s3_31;
		ptr32 s5_33;
		ptr32 s6_34;
		ptr32 s7_35;
		ptr32 s9_37;
		ptr32 t4_40;
		struct Eq_274 * a0_18;
		Eq_485 a1_19;
		ptr32 a4_22;
		Eq_354682 a5_23;
		ptr32 s4_122;
		ptr32 s8_138;
		Eq_2 ra_25 = vsprintf(ra, 0x4201C44C, a0, a1, dwArg48, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArgFC, out s0_26, out s1_27, out a0_18, out a1_19, out a3_21, out a4_22, out a5_23, out a7_24, out s2_30, out s3_31, out s4_122, out s5_33, out s6_34, out s7_35, out s8_138, out s9_37, out s10_28, out s11_29, out t4_40);
		Eq_2 s0_41 = s0_26 + 0x044C;
		if (a0_18 > null)
		{
			while (true)
			{
				a1_19 = (word32) *s0_41;
				if (a1_19 == 0x00)
					break;
				s0_41 = bl_uart_data_send(s1_27, 0x00, a1_19, out a0_18, out a4_22, out a5_23, out s4_122, out s8_138);
			}
		}
		s1Out = s1_27;
		a0Out = a0_18;
		a1Out = a1_19;
		a2Out = dwArg10;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_23;
		a7Out = a7_24;
		s2Out = s2_30;
		s3Out = s3_31;
		s4Out = s4_122;
		s5Out = s5_33;
		s6Out = s6_34;
		s7Out = s7_35;
		s8Out = s8_138;
		s9Out = s9_37;
		s10Out = s10_28;
		s11Out = s11_29;
		t4Out = t4_40;
		return ra_25;
	}
}

// 23082336: Register Eq_2 bl_putchar(Register Eq_2 s1, Register Eq_442201 a0, Register out ptr32 s4Out)
// Called from:
//      utils_hexdump
Eq_2 bl_putchar(Eq_2 s1, Eq_442201 a0, ptr32 & s4Out)
{
	ptr32 s4_15;
	word32 a0_24;
	word32 a4_25;
	word32 a5_26;
	word32 s8_27;
	Eq_2 s0_14 = bl_uart_data_send(s1, 0x00, a0 & 0x00FF, out a0_24, out a4_25, out a5_26, out s4_15, out s8_27);
	s4Out = s4_15;
	return s0_14;
}

// 2308234C: Register Eq_2 puts(Register Eq_2 a0, Register out ptr32 a0Out, Register out Eq_485 a1Out, Register out ptr32 a2Out, Register out Eq_487 a4Out, Register out (ptr32 byte) a5Out, Register out Eq_489 s4Out, Register out ptr32 s8Out)
// Called from:
//      cmd_stack_wifi
//      event_cb_wifi_event
//      aos_loop_proc
//      vApplicationStackOverflowHook
//      bfl_main
//      wifi_prov_api_event_trigger_connect
//      wifi_prov_api_event_trigger_disconnect
//      wifi_prov_api_event_trigger_scan
//      wifi_prov_api_event_state_get
//      rxl_hwdesc_dump
//      scanu_start
//      mac_vsie_find
//      helper_record_dump
//      chan_upd_ctxt_status
//      hal_mib_dump
//      dump_cfg_entries
//      bl_txdatacfm
//      bl_utils_dump
//      wifi_edca_dump_cmd
//      wifi_sta_ip_info
//      cmd_wifi_raw_send
//      cmd_wifi_dump
//      wifi_sta_ip_set_cmd
//      cb_event_ind
//      coex_dump_ble
//      bl_onchiphci_rx_packet_handler
//      ota_tcp_cmd
//      cmd_sys_time_now
//      ef_port_init
//      exception_entry
//      bl_irq_init
//      sec_trng_IRQHandler
//      bl_rand
//      cmd_gpio_get
//      bl_wifi_enable_irq
//      proc_entry_looprt
//      cmd_looprt_test
//      cmd_looprt_test_status
//      cmd_looprt_test_evt
//      cmd_looprt_test_evt_dump
//      cmd_looprt_test_schedule_evt1
//      cmd_looprt_test_schedule_evt2
//      dhcp_server_recv
//      ips_test_cmd
//      _startup_sntp
//      cmd_sntp_date
//      utils_hexdump
//      cipsta_ip
//      cb_altcp_recv_fn
//      bl_mtd_open
//      bloop_status_dump
Eq_2 puts(Eq_2 a0, ptr32 & a0Out, union Eq_485 & a1Out, ptr32 & a2Out, union Eq_487 & a4Out, byte & a5Out, union Eq_489 & s4Out, ptr32 & s8Out)
{
	ui32 a5_5 = (word32) g_b4200ECB8;
	byte * a5_13 = a5_5 & 0x00FF;
	ptr32 s0_14 = 0x00;
	if ((a5_5 & 0x00FF) != 0x00)
	{
		s1 = a0;
		s0_14 = 0x00;
		while (true)
		{
			a5_13 = (word32) a0 + s0_14;
			a1 = (word32) *a5_13;
			if (a1 == 0x00)
				break;
			word32 a0_76;
			word32 a5_77;
			s0_14 = (word32) bl_uart_data_send(a0, 0x00, a1, out a0_76, out a4, out a5_77, out s4, out s8) + 1;
		}
	}
	a0Out = s0_14;
	a1Out = a1;
	a2Out = dwArg10;
	a4Out = a4;
	a5Out = a5_13;
	s4Out = s4;
	s8Out = s8;
	return s1;
}

