pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23082388: Register Eq_2 printf(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out Eq_282 s1Out, Register out (ptr32 Eq_283) a0Out, Register out (ptr32 Eq_284) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_287 a4Out, Register out Eq_288 a5Out, Register out ptr32 a7Out, Register out Eq_290 s2Out, Register out Eq_291 s3Out, Register out Eq_292 s4Out, Register out (ptr32 Eq_293) s5Out, Register out (ptr32 Eq_294) s6Out, Register out (ptr32 Eq_295) s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_297) s9Out, Register out (ptr32 Eq_298) s10Out, Register out Eq_299 s11Out, Register out Eq_300 t4Out)
// Called from:
//      cmd_free_mem
//      cmd_stack_ble
//      wifiprov_wifi_state_get
//      event_cb_wifi_event
//      event_cb_cli
//      aos_loop_proc
//      vApplicationMallocFailedHook
//      bfl_main
//      wifiprov_api_state_get
//      wifiprov_wifi_scan
//      wifiprov_disc_from_ap_ind
//      wifiprov_connect_ap_ind
//      blsync_disconnected
//      blsync_connected
//      blsync_ble_start
//      rf_pri_config_channel.constprop.9
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
//      hal_machw_init
//      mm_sta_add
//      rxl_hwdesc_dump
//      rxl_hwdesc_init
//      sta_mgmt_init
//      sta_mgmt_register
//      td_timer_end
//      td_reset
//      td_init
//      td_start
//      sm_get_bss_params
//      sm_connect_ind
//      sm_supplicant_deauth_cfm
//      sm_auth_handler
//      sm_assoc_rsp_handler
//      sm_handle_supplicant_result
//      apm_tx_cfm_handler
//      cfg_api_element_general_set
//      cfg_api_element_set
//      add_key_to_mac
//      add_mfp_key_to_mac
//      InitGroupKey
//      helper_record_dump
//      hal_mib_dump
//      txl_buffer_update_thd
//      rxu_mgt_ind_handler
//      me_build_beacon
//      cfm_raw_send
//      scanu_raw_send_req_handler
//      rxu_mgt_ind_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
//      apm_start_req_handler
//      dump_cfg_entries
//      cfg_start_req_handler
//      ipc_host_init
//      bl_main_if_remove
//      bl_main_if_add
//      bl_main_apm_start
//      bl_main_apm_stop
//      bl_main_apm_sta_delete
//      bl_main_rtthread_start
//      bl_handle_dynparams
//      bl_send_msg
//      bl_msg_zalloc.constprop.3
//      bl_msg_update_channel_cfg
//      bl_send_me_config_req
//      bl_send_sm_connect_req
//      bl_rx_apm_sta_del_ind
//      bl_rx_apm_sta_add_ind
//      bl_rx_sm_connect_ind
//      bl_rx_sm_disconnect_ind
//      bl_rx_scanu_result_ind
//      bl_tx_push
//      bl_output
//      tcpip_stack_input
//      bl_utils_dump
//      printErrMsg
//      stateSnifferExit
//      stateSnifferAction
//      stateConnectedIPNoAction_ipgot
//      stateGlobalEnter
//      stateGlobalAction
//      stateConnectingEnter
//      stateConnectedIPNoExit
//      stateDisconnect_action_idle
//      stateDisconnect_action_reconnect
//      ip_obtaining_timeout
//      stateConnectedIPNoEnter
//      stateConnectedIPYesGuard_rcconfig
//      stateIdleAction_connect
//      stateGlobalGuard_fw_powersaving
//      stateGlobalGuard_conf_max_sta
//      stateGlobalGuard_AP
//      stateDisconnect_exit
//      disconnect_retry
//      stateGlobalGuard_fw_disconnect
//      stateConnectedIPYes_exit
//      stateIdleGuard_connect
//      stateIfaceDownGuard_phyup
//      stateGlobalGuard_stop
//      stateGlobalGuard_enable_autoreconnect
//      stateGlobalGuard_disable_autoreconnect
//      stateDisconnect_enter
//      stateGlobalGuard_fw_scan
//      stateGlobalExit
//      stateSnifferEnter
//      stateConnectingAction_connected
//      stateConnectingAction_disconnect
//      stateConnectingExit
//      stateIdleAction_sniffer
//      stateIdleEnter
//      stateIdleExit
//      stateIfaceDownAction_phyup
//      stateIfaceDownEnter
//      stateIfaceDownExit
//      stateConnectedIPNoAction_disconnect
//      stateConnectedIPYes_action
//      stateConnectedIPYes_enter
//      wifi_mgmr_event_notify
//      wifi_mgmr_start
//      cmd_wifi_state_get
//      wifi_sta_get_state_cmd
//      wifi_edca_dump_cmd
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      cmd_wifi_cfg
//      cmd_wifi_ap_stop
//      wifi_sta_ip_info
//      cmd_wifi_ap_conf_max_sta
//      wifi_rc_fixed_enable
//      wifi_connect_cmd
//      wifi_capcode_cmd
//      wifi_mgmr_cli_scanlist
//      cb_scan_complete
//      wifi_mgmr_sta_enable
//      wifi_mgmr_sta_connect_ind_stat_get
//      wifi_mgmr_sta_connect
//      wifi_mgmr_scan_complete_callback
//      wifi_mgmr_all_ap_scan
//      wifi_mgmr_profile_add
//      wifi_mgmr_profile_get
//      cb_probe_resp_ind
//      cb_disconnect_ind
//      cb_event_ind
//      cmd_mgr_llind
//      netif_status_callback
//      wifi_tx
//      bl606a0_wifi_init
//      coex_dump_ble
//      bdaddr_init
//      lld_evt_end_isr
//      lpn_cb
//      fault_get_reg
//      prov_reset
//      prov_complete
//      link_close
//      link_open
//      prov_input_complete
//      input
//      output_string
//      output_number
//      vendor_data_set
//      blemesh_lpn_set
//      blemesh_seg_send
//      blemesh_net_send
//      blemesh_reset
//      blemesh_input_str
//      blemesh_input_num
//      blemesh_ivu_test
//      blemesh_set_dev_uuid
//      blemesh_fault_set
//      blemesh_pb
//      blemesh_init
//      blemesh_iv_update
//      fault_get_cur
//      show_faults
//      health_current_status
//      friend_req_sent
//      friend_clear_sent
//      req_sent
//      sub_update
//      bt_mesh_lpn_msg_received
//      bt_mesh_lpn_group_add
//      gen_onoff_set.isra.0
//      gen_onoff_get
//      publish_start
//      model_send
//      publish_sent
//      bt_mesh_model_recv
//      bt_mesh_model_publish
//      mod_publish
//      adv_thread
//      bt_mesh_scan_cb
//      bt_mesh_adv_create_from_pool
//      bt_mesh_scan_enable
//      bt_mesh_scan_disable
//      beacon_send
//      bt_mesh_beacon_recv
//      hb_pub_status
//      hb_sub_status
//      mod_pub_status
//      relay_status
//      app_key_status
//      net_key_status
//      comp_data_status
//      mod_sub_status
//      mod_app_status
//      beacon_status
//      net_key_get
//      krp_get
//      node_identity_get
//      app_key_get
//      send_mod_sub_status
//      krp_set
//      lpn_timeout_get
//      friend_set
//      node_reset
//      mod_sub_get
//      mod_sub_get_vnd
//      net_key_update
//      net_key_add
//      send_mod_pub_status.isra.7
//      mod_app_get
//      mod_app_unbind
//      mod_app_bind
//      mod_pub_set
//      mod_pub_get
//      mod_sub_del
//      mod_sub_add
//      mod_sub_va_del
//      mod_pub_va_set
//      mod_sub_va_add
//      dev_comp_data_get
//      app_key_update
//      app_key_add
//      hb_publish
//      heartbeat_pub_set
//      hb_sub_send_status.constprop.14
//      heartbeat_sub_set
//      app_key_del
//      bt_mesh_cfg_srv_init
//      bt_mesh_heartbeat
//      net_transmit_set
//      net_transmit_get
//      relay_set
//      relay_get
//      beacon_set
//      beacon_get
//      node_identity_set
//      gatt_proxy_set
//      default_ttl_set
//      default_ttl_get
//      bt_mesh_label_uuid_get
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
//      mod_reset
//      net_key_del
//      health_period_status
//      health_current_status
//      health_fault_status
//      health_attention_status
//      health_period_set_unrel
//      health_period_get
//      health_get_registered
//      health_fault_test
//      health_fault_clear
//      health_fault_get
//      health_pub_update
//      bt_mesh_health_srv_init
//      bt_mesh_attention
//      attention_set
//      bt_mesh_provision
//      auth_match
//      net_decrypt.isra.1
//      bt_mesh_net_keys_create
//      friend_cred_set
//      friend_cred_create
//      bt_mesh_kr_update
//      bt_mesh_net_iv_update
//      bt_mesh_net_resend
//      bt_mesh_net_encode
//      bt_mesh_net_decode
//      bt_mesh_net_recv
//      prov_failed
//      adv_buf_create
//      prov_send
//      send_input_complete
//      prov_send_fail_msg
//      prov_confirm
//      prov_invite
//      prov_random
//      prov_data
//      prov_pub_key
//      prov_start
//      pub_key_ready
//      prov_retransmit
//      gen_prov_cont
//      gen_prov_start
//      send_pub_key
//      gen_prov_ctl
//      bt_mesh_pb_gatt_recv
//      bt_mesh_pb_gatt_close
//      bt_mesh_pb_adv_recv
//      bt_mesh_prov_init
//      proxy_sar_timeout
//      prov_ccc_write
//      proxy_ccc_write
//      proxy_connected
//      send_filter_status
//      proxy_complete_pdu
//      proxy_recv
//      bt_mesh_proxy_send
//      bt_mesh_proxy_adv_start
//      bt_mesh_proxy_adv_stop
//      is_replay
//      sdu_recv
//      seg_rx_reset
//      seg_tx_send_unacked
//      ctl_recv
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
//      send_ack
//      seg_ack
//      bt_mesh_trans_recv
//      create_friend_pdu
//      buf_send_end
//      friend_timeout
//      enqueue_sub_cfm
//      friend_queue_prepare_space
//      enqueue_update
//      enqueue_friend_pdu
//      bt_mesh_friend_clear
//      bt_mesh_friend_sub_add
//      bt_mesh_friend_sub_rem
//      bt_mesh_friend_poll
//      bt_mesh_friend_clear_cfm
//      bt_mesh_friend_req
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
//      bt_mesh_friend_clear_incomplete
//      k_queue_free
//      k_sem_init
//      k_sem_give
//      k_sem_delete
//      k_thread_delete
//      hci_driver_send
//      send_frag
//      bt_conn_recv
//      bt_conn_set_state
//      bt_conn_create_le
//      gatt_notify
//      gatt_indicate
//      sc_save
//      bt_gatt_attr_write_ccc
//      bt_gatt_service_register
//      update_ccc
//      bt_gatt_exchange_mtu
//      bt_gatt_discover
//      gatt_read_group_rsp
//      gatt_read_type_rsp
//      read_included_uuid_cb
//      gatt_find_info_rsp
//      gatt_read_rsp
//      hci_data_buf_overflow
//      le_remote_feat_complete
//      le_conn_update_complete
//      hci_num_completed_packets
//      update_sec_level
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
//      handle_event
//      hci_cmd_done
//      hci_disconn_complete
//      set_ad
//      bt_id_add
//      bt_id_del
//      bt_data_parse
//      bt_le_set_data_len
//      le_adv_report
//      le_ltk_request
//      le_conn_param_neg_reply
//      le_conn_param_req
//      enh_conn_complete
//      hci_tx_thread
//      bt_recv
//      bt_setup_id_addr
//      init_work
//      bt_pub_key_gen
//      l2cap_accept
//      l2cap_create_le_sig_pdu.isra.7
//      l2cap_rtx_timeout
//      bt_l2cap_create_pdu_timeout
//      bt_l2cap_send_cb
//      l2cap_chan_add
//      bt_l2cap_recv
//      l2cap_chan_le_recv_seg
//      l2cap_rx_process
//      l2cap_recv
//      smp_chan_get
//      smp_sign_buf
//      smp_pairing_failed
//      smp_timeout
//      smp_ident_info
//      smp_encrypt_info
//      legacy_request_tk
//      bt_smp_accept
//      bt_smp_distribute_keys
//      smp_signing_info
//      smp_master_ident
//      smp_security_request
//      bt_smp_recv
//      smp_ident_addr_info
//      bt_smp_pkey_ready
//      smp_pairing_random
//      bt_smp_sign_verify
//      bt_smp_sign
//      bt_smp_update_keys
//      notify_func
//      le_param_updated
//      ble_set_tx_pwr
//      ble_unsubscribe
//      write_func
//      ble_exchange_mtu
//      exchange_func
//      ble_auth_pairing_confirm
//      ble_auth_passkey_confirm
//      ble_auth_cancel
//      ble_auth
//      ble_security
//      ble_select_conn
//      ble_disconnect
//      ble_connect
//      ble_stop_advertise
//      ble_get_device_name
//      ble_start_advertise
//      ble_set_adv_channel
//      ble_stop_scan
//      ble_disable
//      discover_func
//      ble_set_data_len
//      ble_subscribe
//      ble_write
//      ble_read
//      read_func
//      ble_discover
//      ble_auth_passkey
//      ble_conn_update
//      ble_unpair
//      ble_start_scan
//      ble_set_device_name
//      ble_init
//      device_found
//      ble_read_local_address
//      connected
//      disconnected
//      security_changed
//      auth_passkey_display
//      auth_passkey_entry
//      auth_passkey_confirm
//      auth_cancel
//      auth_pairing_confirm
//      auth_pairing_complete
//      auth_pairing_failed
//      identity_resolved
//      ble_get_all_conn_info
//      ble_write_without_rsp
//      ble_tp_disconnected
//      ble_tp_connected
//      ble_tp_ccc_cfg_changed
//      ble_tp_tx_mtu_size
//      find_type_cb
//      att_send
//      bt_att_accept
//      att_timeout
//      bt_att_encrypt_change
//      att_chan_get
//      bt_att_create_pdu
//      bt_att_recv
//      att_signed_write_cmd
//      utilfdt_print_data
//      tc_blfdtdump
//      tc_fdt_wifi
//      ota_tcp_cmd
//      __ble_bytes_send
//      blsync_disconnected
//      blsync_exchange_func
//      blsync_connected
//      cb_idnoe
//      cat_cmd
//      hexdump_cmd
//      proc_onecmd
//      ls_cmd
//      console_cb_read
//      aos_cli_input_direct
//      ef_port_init
//      psm_unset_cmd
//      psm_set_cmd
//      interrupt_entry
//      exception_entry
//      bl_tsen_adc_get
//      cmd_looprt_test
//      _led_bloop_evt
//      tcpip_input
//      tcp_init
//      dhcp_server_stop
//      dhcpd_start
//      iperf_server_udp
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      romfs_lseek
//      cmd_sntp_date
//      cmd_sntp_time
//      sntp_recv
//      sntp_init
//      utils_hexdump
//      utils_getopt
//      aos_loop_init
//      aos_poll_read_fd
//      aos_loop_run
//      at_serial_write
//      at_serial_read
//      at_cmd_exec
//      at_serial_lock
//      at_serial_unlock
//      at_data_output
//      at_dump_noend
//      at_cmd_init
//      at_server_init
//      cb_altcp_recv_fn
//      cb_httpc_result
//      cwjap_info
//      scan
//      cb_httpc_headers_done_fn
//      __wifimode_set
//      set_apcfg
//      cwjap_cur
//      cwmode_cur
//      uart_set
//      wifi_mode_handler
//      domain_name_resolution
//      deep_sleep_handler
//      setautoconnect_handler
//      uart_config_handler
//      echo_on_handler
//      disconnect_handler
//      at_parse
//      set_ip_handler
//      ap_cfg_handler
//      join_ap_handler
//      at_response
//      at_version
//      at_restore
//      at_uart_config_get
//      at_uart_config
//      at_deep_sleep_mode
//      at_wifi_mode
//      at_wifi_mode_get
//      at_join_ap
//      at_disconnect
//      at_set_ap
//      at_ap_sta_get
//      at_http_request
//      at_queue_get
//      at_queue_peek
//      create_tcp_udp_handler
//      close_network_handler
//      send_data_handler
//      ap_server_handler
//      client_ssl_config_path
//      client_ssl_set_sni
//      client_ssl_set_alpn
//      tcp_sent_callback
//      tcp_receive_callback
//      udp_receive_callback
//      tcp_accept_callback
//      bl_cipstart
//      bl_cipsend
//      mfg_media_read_xtal_capcode
//      mfg_media_read_poweroffset
//      mfg_media_read_macaddr
//      mfg_flash_read
//      bl_mtd_open
//      bloop_init
//      bloop_evt_set_async
//      bloop_evt_set_sync
//      bloop_evt_unset_sync
//      bloop_run
//      bloop_status_dump
//      loop_evt_entity_sys_handler
//      loop_evt_entity_sys_evt
//      bl_hbn_enter
Eq_2 printf(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, union Eq_282 & s1Out, struct Eq_283 & a0Out, struct Eq_284 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_287 & a4Out, union Eq_288 & a5Out, ptr32 & a7Out, union Eq_290 & s2Out, union Eq_291 & s3Out, union Eq_292 & s4Out, struct Eq_293 & s5Out, struct Eq_294 & s6Out, struct Eq_295 & s7Out, ptr32 & s8Out, struct Eq_297 & s9Out, struct Eq_298 & s10Out, union Eq_299 & s11Out, union Eq_300 & t4Out)
{
	ui32 a5_7 = (word32) g_b4200ECB8;
	Eq_288 a5_22 = a5_7 & 0x00FF;
	if ((a5_7 & 0x00FF) != 0x00)
	{
		word32 a0_122;
		ra = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1, out a0_122, out a1, out a2, out a3, out a4, out a5_22, out a7, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4);
	}
	s1Out = s1;
	a0Out = null;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_22;
	a7Out = a7;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	t4Out = t4;
	return ra;
}

// 230823B8: Register Eq_2 sprintf(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_274) a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Register out ptr32 s0Out, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_338184) s2Out, Register out Eq_338185 s3Out, Register out Eq_338186 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_338189 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_338192 s10Out, Register out ptr32 s11Out)
// Called from:
//      print_number
//      print_string_ptr
//      vTaskList
//      dhcpd_start
//      log_buf_out
//      at_key_value_set
//      cipsta_ip
Eq_2 sprintf(Eq_2 ra, Eq_2 a0, struct Eq_274 * a1, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, ptr32 & s0Out, byte & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_338184 & s2Out, union Eq_338185 & s3Out, union Eq_338186 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_338189 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_338192 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_24;
	ptr32 a5_26;
	ptr32 s0_29;
	byte * s1_30;
	Eq_338192 s10_31;
	ptr32 s11_32;
	struct Eq_338184 * s2_33;
	Eq_338185 s3_34;
	Eq_338186 s4_35;
	ptr32 s6_36;
	Eq_338189 s7_37;
	ptr32 s8_38;
	ptr32 s9_39;
	ptr32 a1_43;
	ptr32 a2_44;
	ptr32 a4_45;
	ptr32 s5_46;
	word32 t0_82;
	word32 a3_83;
	word32 a7_84;
	word32 t4_85;
	Eq_2 ra_28 = vsnprintf(ra, a0, ~0x00, a1, fp + -24, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out t0_82, out s0_29, out s1_30, out a0_24, out a1_43, out a2_44, out a3_83, out a4_45, out a5_26, out a7_84, out s2_33, out s3_34, out s4_35, out s5_46, out s6_36, out s7_37, out s8_38, out s9_39, out s10_31, out s11_32, out t4_85);
	s0Out = s0_29;
	s1Out = s1_30;
	a0Out = a0_24;
	a1Out = a1_43;
	a2Out = a2_44;
	a4Out = a4_45;
	a5Out = a5_26;
	s2Out = s2_33;
	s3Out = s3_34;
	s4Out = s4_35;
	s5Out = s5_46;
	s6Out = s6_36;
	s7Out = s7_37;
	s8Out = s8_38;
	s9Out = s9_39;
	s10Out = s10_31;
	s11Out = s11_32;
	return ra_28;
}

