pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230823DA: Register Eq_2 snprintf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_274) a2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Register out (ptr32 Eq_118884) s0Out, Register out Eq_118885 s1Out, Register out ptr32 a0Out, Register out Eq_118887 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_118891) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_118893) s2Out, Register out Eq_118894 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_118896) s5Out, Register out Eq_118897 s6Out, Register out ptr32 s7Out, Register out Eq_118899 s8Out, Register out (ptr32 (arr byte)) s9Out, Register out Eq_118901 s10Out, Register out ptr32 s11Out)
// Called from:
//      cmd_wifi_ap_start
//      bt_addr_le_str_real
//      bt_uuid_to_str
//      bt_settings_encode_key
//      bt_addr_le_to_str.constprop.14
//      blog_hexdump_out
//      ls_cmd
//      hal_gpio_init_from_dts
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      httpc_create_request_string.constprop.6
//      mbedtls_x509_crt_info
//      mbedtls_debug_print_ret
//      mbedtls_debug_print_buf
//      mbedtls_debug_print_mpi
//      mbedtls_debug_print_ecp
//      mbedtls_debug_print_crt
//      mbedtls_x509_dn_gets
//      mbedtls_x509_serial_gets
//      mbedtls_x509_sig_alg_gets
//      mbedtls_x509_key_size_helper
Eq_2 snprintf(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_274 * a2, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, struct Eq_118884 & s0Out, union Eq_118885 & s1Out, ptr32 & a0Out, union Eq_118887 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_118891 & a5Out, ptr32 & a7Out, struct Eq_118893 & s2Out, union Eq_118894 & s3Out, ptr32 & s4Out, struct Eq_118896 & s5Out, union Eq_118897 & s6Out, ptr32 & s7Out, union Eq_118899 & s8Out, byte (& s9Out, union Eq_118901 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_21;
	ptr32 a3_22;
	struct Eq_118891 * a5_23;
	ptr32 a7_24;
	struct Eq_118884 * s0_26;
	Eq_118885 s1_27;
	Eq_118901 s10_28;
	ptr32 s11_29;
	struct Eq_118893 * s2_30;
	Eq_118894 s3_31;
	ptr32 s4_32;
	Eq_118897 s6_33;
	ptr32 s7_34;
	Eq_118899 s8_35;
	byte (* s9_36)[];
	Eq_118887 a1_40;
	ptr32 a2_41;
	ptr32 a4_42;
	struct Eq_118896 * s5_43;
	word32 t0_80;
	word32 t4_81;
	Eq_2 ra_25 = vsnprintf(ra, a0, a1, a2, fp + -20, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out t0_80, out s0_26, out s1_27, out a0_21, out a1_40, out a2_41, out a3_22, out a4_42, out a5_23, out a7_24, out s2_30, out s3_31, out s4_32, out s5_43, out s6_33, out s7_34, out s8_35, out s9_36, out s10_28, out s11_29, out t4_81);
	s0Out = s0_26;
	s1Out = s1_27;
	a0Out = a0_21;
	a1Out = a1_40;
	a2Out = a2_41;
	a3Out = a3_22;
	a4Out = a4_42;
	a5Out = a5_23;
	a7Out = a7_24;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = s4_32;
	s5Out = s5_43;
	s6Out = s6_33;
	s7Out = s7_34;
	s8Out = s8_35;
	s9Out = s9_36;
	s10Out = s10_28;
	s11Out = s11_29;
	return ra_25;
}

// 230823F6: Register word32 sscanf(Register word32 ra, Register ptr32 a0, Register (ptr32 byte) a1, Stack word32 dwArg14, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      get_hi_para
word32 sscanf(word32 ra, ptr32 a0, byte * a1, word32 dwArg14, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 s1_29;
	ptr32 s2_32;
	ptr32 s3_33;
	word32 s0_28 = vsscanf(ra, a0, a1, fp + -24, dwArg14, out s1_29, out s2_32, out s3_33);
	s1Out = s1_29;
	s2Out = s2_32;
	s3Out = s3_33;
	return s0_28;
}

// 23082412: void set_bit(Register (ptr32 word32) a1)
void set_bit(word32 * a1)
{
	*(a1 | 0x01 << a1) = *a1;
}

// 23082428: Register word32 vsscanf(Register word32 ra, Register ptr32 a0, Register (ptr32 byte) a1, Register ptr32 a2, Stack word32 dwArg54, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      sscanf
word32 vsscanf(word32 ra, ptr32 a0, byte * a1, ptr32 a2, word32 dwArg54, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	while (true)
	{
		word32 s1_51 = (word32) *a1;
		byte * s7_52 = a1 + 1;
		if (s1_51 == 0x00 || false)
			break;
		if (true)
		{
			<anonymous> * a3_62 = g_ptr230C6140;
			word32 s0_76;
			ptr32 s2_77;
			ptr32 s3_78;
			ptr32 s1_86;
			word32 a1_90;
			a3_62();
			s1Out = s1_86;
			s2Out = s2_77;
			s3Out = s3_78;
			return s0_76;
		}
		a1 = s7_52;
	}
	s1Out = dwLoc48->ptr011C;
	s2Out = 0x00;
	s3Out = a0;
	return 0x00;
}

<anonymous> g_t230824BA = <code>;
// 23082888: void strntoumax(Register (ptr32 Eq_476047) a0, Register Eq_476048 a1, Register Eq_476049 a2, Register up32 a3)
void strntoumax(struct Eq_476047 * a0, Eq_476048 a1, Eq_476049 a2, up32 a3)
{
	struct Eq_476047 * a5_115 = a0;
	while (true)
	{
		up32 t3_11;
		if (a3 == 0x00)
			break;
		struct Eq_476056 * a4_18 = (word32) a5_115->b0000;
		if (((word32) a4_18->b230CB5B1 & 0x08) == 0x00)
		{
			t3_11 = 0x00;
			if ((a4_18 + -43 & 0x00FD) == 0x00)
			{
				t3_11 = (word32) (a4_18 < (struct Eq_476056 *) -46);
				++a5_115;
				a3 += ~0x00;
			}
			if (a2 != 0x00)
			{
				if (a2 == 0x10 && (a3 > 0x01 && ((word32) a5_115->b0000 == 48 && ((word32) a5_115[1] & 223) == 88)))
				{
					a3 += ~0x01;
					a5_115 += 2;
				}
				goto l230828EA;
			}
			if (a3 > 0x01)
			{
				a2.u0 = 0x0A;
				if ((word32) a5_115->b0000 != 48)
					goto l230828EA;
				if (((word32) a5_115[1] & 223) == 88)
				{
					a3 += ~0x01;
					a5_115 += 2;
					a2.u0 = 0x10;
					goto l230828EA;
				}
			}
			else
			{
				if (a3 == 0x00)
					goto l23082992;
				if ((word32) a5_115->b0000 != 48)
				{
					a3 = 0x01;
					a2.u0 = 0x0A;
					goto l230828EA;
				}
			}
			a3 += ~0x00;
			++a5_115;
			a2.u0 = 0x08;
			goto l230828EA;
		}
		++a5_115;
		a3 += ~0x00;
	}
	t3_11 = 0x00;
	if (a2 == 0x00)
	{
		if (a1 == 0x00)
			return;
		t3_11 = a3;
	}
	else
	{
l230828EA:
		struct Eq_476047 * a3_68 = a5_115 + a3;
		for (; a5_115 != a3_68; ++a5_115)
		{
			up32 a7_78 = (word32) a5_115->b0000;
			Eq_476049 a6_79 = a7_78 + -48;
			if (a7_78 > ~0x38)
			{
				if (a7_78 <= ~0x59)
					a6_79 = a7_78 + -55;
				else
				{
					if (a7_78 > ~0x79)
						break;
					a6_79 = a7_78 + -87;
				}
			}
			if (a6_79 < 0x00 || a6_79 >= a2)
				break;
		}
l23082992:
		if (a1 == 0x00)
			return;
	}
	a5_115->b0000 = (byte) a1;
}

// 230829D4: Register (ptr32 Eq_365999) UART_Init(Register ui32 a0, Register uint32 a2, Register (ptr32 Eq_365999) a4)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
//      at_serial_cfg_set
struct Eq_365999 * UART_Init(ui32 a0, uint32 a2, struct Eq_365999 * a4)
{
	struct Eq_476185 * a1_10 = ((struct Eq_476185 *[]) 4)[a0];
	uint32 a5_14 = a4 >> (a0 << 2);
	if (((char *) &a4->dw0004 + 6 >> (a0 << 2) & 0x0A) > 0x04)
		++a5_14;
	uint32 a5_21 = a5_14 + ~0x00;
	struct Eq_476205 * a5_25 = (word32) (word16) a5_21 | a5_21 << 0x10;
	a5_25->dw0008 = a2;
	ui32 a4_22 = a5_21 << 0x10;
	word32 a3_29 = (word32) a1_10->b000A;
	word32 a2_31 = a5_25->dw0004;
	if (a3_29 != 0x01)
	{
		if (a3_29 != 0x00)
		{
			if (a3_29 == 0x02)
			{
				a4_22 = a5_21 << 0x10 & -33 | 16;
				a5_25 = a5_25 & -33 | 16;
			}
		}
		else
		{
			a4_22 = a5_21 << 0x10 & ~0x10;
			a5_25 &= ~0x10;
		}
	}
	else
	{
		a4_22 = a5_21 << 0x10 | 48;
		a5_25 |= 48;
	}
	ui32 a3_50 = (word32) a1_10->b0008 + 0x04 << 8;
	ui32 a4_61 = (a4_22 & -0x0701 | a3_50) & ~0x03000000 | (word32) a1_10->b0009 + 0x01 << 0x0C;
	ui32 a5_52 = a5_25 & -0x0701 | a3_50;
	word32 * a3_62 = a4_61 & -3;
	if ((word32) a1_10->b000B == 0x01)
		a3_62 = a4_61 | 2;
	ui32 a5_71;
	if ((word32) a1_10->b000C == 0x01)
		a5_71 = a5_52 | 0x00FFF800;
	else
		a5_71 = a5_52 & ~0x00FFF800;
	struct Eq_365999 * a4_80 = a5_71 & -3;
	if ((word32) a1_10->b000D == 0x01)
		a4_80 = a5_71 | 2;
	*a3_62 = a2_31;
	a4_80->dw0004 = a2_31;
	word32 a2_92 = a4_80->dw000C;
	struct Eq_476313 * a5_96 = a4_80 & -2;
	if ((word32) a1_10->b000E == 0x01)
		a5_96 = a4_80 | 1;
	a5_96->dw000C = a2_92;
	return a4_80;
}

// 23082AC8: void UART_FifoConfig(Register (ptr32 Eq_365986) a1, Register (ptr32 Eq_365987) a3)
// Called from:
//      bl_uart_init
void UART_FifoConfig(struct Eq_365986 * a1, struct Eq_365987 * a3)
{
	a3->dw0084 = ((word32) a1->b0000 + ~0x00 << 16 | a3->dw0084 & ~0x001F0000) & ~0x1F000000 | (word32) a1->b0001 + ~0x00 << 24;
	int32 a4_28 = a3->dw0080;
	ui32 a5_30 = a4_28 & -2;
	if ((word32) a1->b0002 == 0x01)
		a5_30 = a4_28 | 1;
	int32 a4_37 = a5_30 & -3;
	if ((word32) a1->b0003 == 0x01)
		a4_37 = a5_30 | 2;
	a3->dw0080 = a4_37;
}

// 23082B32: Register uint32 UART_Enable(Register ui32 a0, Register uint32 a1, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
//      at_serial_cfg_set
uint32 UART_Enable(ui32 a0, uint32 a1, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_11 = *((char *) g_a230CBB00 + a0 * 0x04);
	if ((a1 & 0x00FD) == 0x00)
	{
		a5_11 = *(a1 & 0x00FD);
		*(a1 & 0x00FD | 1) = (union Eq_2 *) a5_11;
	}
	uint32 a1_17 = a1 + ~0x00 & 0x00FF;
	if (a1_17 <= 0x01)
	{
		a5_11 = *(union Eq_2 *) 0x05;
		*(union Eq_2 *) 0x05 = a5_11;
	}
	a4Out = 0x01;
	a5Out = a5_11;
	return a1_17;
}

// 23082B66: Register word32 UART_Disable(Register ui32 a1)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
//      at_serial_cfg_set
word32 UART_Disable(ui32 a1)
{
	if ((a1 & 0x00FD) == 0x00)
		*(a1 & 0x00FD & ~0x01) = *(a1 & 0x00FD);
	word32 a4_18 = 0x01;
	if ((a1 + ~0x00 & 0x00FF) <= 0x01)
	{
		*(union Eq_2 *) 4 = *(union Eq_2 *) 0x05;
		a4_18 = 0x00;
	}
	return a4_18;
}

