pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23082B96: Register Eq_2 UART_SetRxTimeoutValue(Register word32 a1, Register Eq_2 a4)
// Called from:
//      bl_uart_int_rx_enable
Eq_2 UART_SetRxTimeoutValue(word32 a1, Eq_2 a4)
{
	struct Eq_476453 * a5_9 = *a4;
	Eq_2 a4_13 = a5_9->t0018;
	(a1 + ~0x00 | a5_9 & -0x0100)->t0018 = a4_13;
	return a4_13;
}

// 23082BB4: Register word32 UART_TxFreeRun(Register word32 a1, Register (ptr32 (ptr32 word32)) a4)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
//      at_serial_cfg_set
word32 UART_TxFreeRun(word32 a1, word32 ** a4)
{
	word32 * a5_13;
	word32 * a5_9 = *a4;
	word32 a4_11 = *a5_9;
	if (a1 == 0x01)
		a5_13 = a5_9 | 4;
	else
		a5_13 = a5_9 & ~0x04;
	*a5_13 = a4_11;
	return 0x01;
}

// 23082BD8: Register Eq_2 UART_IntMask(Register word32 a1, Register word32 a2, Register Eq_2 a4)
// Called from:
//      bl_uart_init
//      bl_uart_int_rx_enable
//      bl_uart_int_rx_disable
//      bl_uart_int_tx_enable
//      bl_uart_int_tx_disable
Eq_2 UART_IntMask(word32 a1, word32 a2, Eq_2 a4)
{
	struct Eq_476489 * a1_17;
	struct Eq_476490 * a5_9 = *a4;
	Eq_2 a4_11 = a5_9->t0024;
	if (a1 == 0x08)
	{
		a1_17 = null;
		if (a2 == 0x01)
			a1_17 = a5_9 | 0x00FF;
	}
	else
	{
		ui32 a1_14 = 0x01 << a1;
		if (a2 == 0x01)
			a1_17 = a1_14 | a5_9;
		else
			a1_17 = ~a1_14 & a5_9;
	}
	a1_17->t0024 = a4_11;
	return a4_11;
}

// 23082C16: Register Eq_2 UART_GetTxFifoCount(Register Eq_2 a0, Register out (ptr32 Eq_366036) a5Out)
// Called from:
//      bl_uart_data_send
//      bl_uart_flush
//      bflb_platform_usart_dbg_send
Eq_2 UART_GetTxFifoCount(Eq_2 a0, struct Eq_366036 & a5Out)
{
	struct Eq_366036 * a5_9 = *((char *) g_a230CBB00 + a0 * 0x04);
	Eq_2 a0_11 = a5_9->dw0084 & 63;
	a5Out = a5_9;
	return a0_11;
}

// 23082C2E: void UART_SendData(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Stack word32 dwArg34, Stack word32 dwArg0128)
// Called from:
//      bflb_platform_usart_dbg_send
void UART_SendData(Eq_2 a0, ptr32 a1, Eq_2 a2, word32 dwArg34, word32 dwArg0128)
{
	struct Eq_476532 * s3_11 = *((char *) g_a230CBB00 + a0 * 0x04);
	Eq_2 s1_25 = 0x00;
	while (s1_25 < a2)
	{
		word32 a5_97;
		if (UART_GetTxFifoCount(a0, out a5_97) == 0x00)
		{
			if (dwArg34 == ~0x00)
				break;
			continue;
		}
		s3_11->b0088 = (byte) (word32) *((word32) s1_25 + a1);
		s1_25 = (word32) s1_25 + 1;
	}
	0x00 = dwArg0128;
}

// 23082CA0: Register ui32 UART_GetRxFifoCount(Register ui32 a0, Register out (ptr32 Eq_366059) a5Out)
// Called from:
//      bl_uart_data_recv
ui32 UART_GetRxFifoCount(ui32 a0, struct Eq_366059 & a5Out)
{
	struct Eq_366059 * a5_9 = *((char *) g_a230CBB00 + a0 * 0x04);
	ui32 a0_12 = a5_9->t0084 >> 8 & 63;
	a5Out = a5_9;
	return a0_12;
}

// 23082CBA: void ADC_Reset()
// Called from:
//      bl_tsen_adc_get
void ADC_Reset()
{
	int32 a5_5 = *(int32 *) 0x4000F90C;
	*(ui32 *) 0x4001090C = a5_5 | 4;
	*(ui32 *) 0x4001090C = a5_5 & ~0x04;
}

// 23082CE2: void ADC_Enable()
// Called from:
//      bl_tsen_adc_get
void ADC_Enable()
{
	*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C | 1;
}

// 23082CF4: void ADC_Disable()
// Called from:
//      bl_tsen_adc_get
void ADC_Disable()
{
	*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x01;
}

// 23082D04: Register ui32 ADC_Channel_Config(Register ui32 a0, Register ui32 a1, Register ui32 a2)
// Called from:
//      bl_tsen_adc_get
ui32 ADC_Channel_Config(ui32 a0, ui32 a1, ui32 a2)
{
	*(ui32 *) 0x4001090C = (a0 << 8 | *((int32 *) 0x4000F90C) & 0xFE0000FF) & -0x00F9 | a1 << 3;
	*(ui32 *) 0x40010910 = (a2 << 1 | *((int32 *) 0x4000F910) & ~0x02) & ~0x02000000;
	return a1 << 3;
}

// 23082D3C: Register Eq_2 ADC_Start(Register Eq_2 ra, Register word32 s0, Register out ptr32 a0Out)
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
Eq_2 ADC_Start(Eq_2 ra, word32 s0, ptr32 & a0Out)
{
	int32 a5_9 = *(int32 *) 0x4000F90C;
	*(ui32 *) 0x4001090C = a5_9 & ~0x02;
	struct Eq_476630 * s0_15;
	Eq_2 ra_16;
	ptr32 a0_18;
	g_t4200C506();
	s0_15->dw090C = s0_15->dwFFFFF90C | 2;
	a0Out = a0_18;
	return ra_16;
}

// 23082D70: void ADC_FIFO_Cfg(Register (ptr32 Eq_381037) a0, Register (ptr32 word32) a5)
// Called from:
//      bl_tsen_adc_get
void ADC_FIFO_Cfg(struct Eq_381037 * a0, word32 * a5)
{
	word32 * a5_15 = ((word32) a0->b0000 << 22 | a5 & ~0x00C00000) & ~0x01 | (word32) a0->b0001;
	*a5_15 = *a5;
	*(a5_15 | 2) = *a5_15;
}

// 23082D9A: Register uint32 ADC_Get_FIFO_Count(Register uint32 a0)
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
uint32 ADC_Get_FIFO_Count(uint32 a0)
{
	return a0 >> 16 & 63;
}

// 23082DA8: Register Eq_2 ADC_Parse_Result(Register Eq_2 ra, Register (ptr32 Eq_476679) a0, Register Eq_2 a2, Register Eq_113940 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg74, Register out Eq_476685 s0Out, Register out (ptr32 Eq_476679) s1Out, Register out (ptr32 Eq_476679) a5Out, Register out (ptr32 Eq_476679) s2Out, Register out Eq_476689 s3Out, Register out (ptr32 Eq_476679) s4Out, Register out Eq_113940 fs1Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
Eq_2 ADC_Parse_Result(Eq_2 ra, struct Eq_476679 * a0, Eq_2 a2, Eq_113940 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg74, union Eq_476685 & s0Out, struct Eq_476679 & s1Out, struct Eq_476679 & a5Out, struct Eq_476679 & s2Out, union Eq_476689 & s3Out, struct Eq_476679 & s4Out, union Eq_113940 & fs1Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if ((word32) g_b4200ECD4 == 0x00)
		fs1 = g_t230C615C;
	Eq_8966 fs0_48;
	Eq_476784 a3_41 = *(union Eq_476784 *) 0x4000F914;
	struct Eq_476679 * s2_121 = a3_41 >> 0x02 & 1;
	if ((a3_41 & 0x08) == 0x00)
		fs0_48 = g_t230C6160;
	else
		fs0_48 = g_t230AA390;
	struct Eq_476679 * a5_100;
	Eq_476689 s3_136;
	if (s2_121 != null)
	{
		a5_100 = g_ptr230C6180;
		Eq_2 s10_254 = g_t230C6188;
		Eq_2 s11_255 = g_t230C618C;
		Eq_2 s7_264 = a2;
		struct Eq_476679 * s6_265;
		ui32 s1_266 = 0x0FFFFFFF;
		ui32 s5_267 = 0x03FFFFFF;
		s3_136.u0 = 0x00FFFFFF;
		dwLoc64 = a5_100;
		for (s6_265 = a0; s6_265 != a5_100; ++s6_265)
		{
			*s7_264 = (byte) (s6_265->t0000 >> 21);
			*((word32) s7_264 + 1) = (byte) ((word32) s6_265->w0002 & 0x1F);
			s4 = null;
			Eq_2 a3_302 = s6_265->t0000;
			if (a3_302 << 0x10 < 0x00)
			{
				a3_302 = 0x00 - a3_302;
				s6_265->t0000.u2 = a3_302;
				s4 = s2_121;
			}
			Eq_2 a1_327;
			Eq_2 a0_326;
			if (dwArg74 == 0x00)
			{
				uint32 a0_359 = (uint32) ((real32) (s6_265->t0000 >> 4 & s3_136) / fs1);
				*((word32) s7_264 + 2) = (word16) a0_359;
				a0_326 = __floatsidf(a0_359 & s1_266, out a1_327);
				goto l23082EAC;
			}
			a5_100 = (struct Eq_476679 *) 0x01;
			if (dwArg74 == 0x01)
			{
				uint32 a0_339 = (uint32) ((real32) (s6_265->t0000 >> 2 & s5_267) / fs1);
				*((word32) s7_264 + 2) = (word16) a0_339;
				a0_326 = __floatsidf(a0_339 & s1_266, out a1_327);
				a2 = s10_254;
				a3_302 = s11_255;
				goto l23082EAC;
			}
			a2 = dwArg74;
			if (false)
			{
				uint32 a0_322 = (uint32) ((real32) (s6_265->t0000 & s1_266) / fs1);
				*((word32) s7_264 + 2) = (word16) a0_322;
				a0_326 = __floatsidf(a0_322 & s1_266, out a1_327);
l23082EAC:
				word32 s9_921;
				Eq_2 a0_384;
				Eq_2 a1_385;
				ptr32 fflags_399;
				ptr32 frm_400;
				word32 s6_918;
				word32 s0_911;
				word32 a3_913;
				word32 s1_912;
				word32 s3_915;
				word32 s4_916;
				word32 s5_917;
				word32 s2_914;
				word32 s7_919;
				word32 s8_920;
				Eq_2 ra_401 = __muldf3(ra, a0_326, a1_327, a2, a3_302, fflags, frm, out s0_911, out s1_912, out a0_384, out a1_385, out a3_913, out s2_914, out s3_915, out s4_916, out s5_917, out s6_918, out s7_919, out s8_920, out s9_921, out fflags_399, out frm_400);
				Eq_2 a1_419;
				Eq_2 a0_426;
				uint32 a1_427;
				word32 s0_922;
				word32 a3_923;
				word32 s8_924;
				word32 s9_925;
				ra = __muldf3(ra_401, a0_384, a1_385, __extendsfdf2(ra_401, fs0_48, fflags_399, frm_400, out a1_419), a1_419, fflags_399, frm_400, out s0_922, out s1_266, out a0_426, out a1_427, out a3_923, out s2_121, out s3_136, out s4, out s5_267, out s6_265, out s7_264, out s8_924, out s9_925, out fflags, out frm);
				real32 fa0_461;
				word32 a3_926;
				word32 a4_927;
				__truncdfsf2(ra, a0_426, a1_427, fflags, frm, out a2, out a3_926, out a4_927, out a5_100, out fa0_461);
				a5_100[4] = (struct Eq_476679) fa0_461;
			}
			if (s4 != null)
				a5_100[4] = (struct Eq_476679) -*((word32) s7_264 + 4);
			s7_264 = (word32) s7_264 + 8;
		}
	}
	else
	{
		Eq_2 s10_67 = g_t230C6178;
		Eq_2 s11_68 = g_t230C617C;
		a5_100 = g_ptr230C6170;
		Eq_2 s6_147 = g_t230C6168;
		Eq_2 s7_149 = g_t230C616C;
		Eq_2 s5_226 = a2;
		ui32 s1_103 = 0x0FFFFFFF;
		s2_121 = (struct Eq_476679 *) 0x03FFFFFF;
		s3_136.u0 = 0x00FFFFFF;
		for (s4 = a0; a5_100 != s4; ++s4)
		{
			Eq_2 a1_112;
			Eq_2 a3_118;
			Eq_2 a0_111;
			Eq_476830 a3_94 = s4->t0000;
			*((word32) s5_226 + 1) = ~0x00;
			*s5_226 = (byte) (a3_94 >> 21);
			if (dwArg74 == 0x00)
			{
				uint32 a0_140 = (uint32) ((real32) (s4->t0000 >> 4 & s3_136) / fs1);
				*((word32) s5_226 + 2) = (word16) a0_140;
				a0_111 = __floatsidf(a0_140 & s1_103, out a1_112);
				a2 = s6_147;
				a3_118 = s7_149;
				goto l23082FA0;
			}
			a5_100 = (struct Eq_476679 *) 0x01;
			if (dwArg74 == 0x01)
			{
				a3_118 = s4->t0000 >> 2 & s2_121;
				uint32 a0_125 = (uint32) ((real32) a3_118 / fs1);
				*((word32) s5_226 + 2) = (word16) a0_125;
				a0_111 = __floatsidf(a0_125 & s1_103, out a1_112);
				goto l23082FA0;
			}
			a2 = dwArg74;
			if (false)
			{
				uint32 a0_108 = (uint32) ((real32) (s4->t0000 & s1_103) / fs1);
				*((word32) s5_226 + 2) = (word16) a0_108;
				a0_111 = __floatsidf(a0_108 & s1_103, out a1_112);
				a2 = s10_67;
				a3_118 = s11_68;
l23082FA0:
				word32 s9_938;
				word32 s8_937;
				word32 s0_928;
				Eq_2 a0_162;
				Eq_2 a1_163;
				ptr32 fflags_177;
				ptr32 frm_178;
				word32 s5_934;
				word32 s1_929;
				word32 s2_931;
				word32 s3_932;
				word32 s4_933;
				word32 s6_935;
				word32 s7_936;
				word32 a3_930;
				Eq_2 ra_179 = __muldf3(ra, a0_111, a1_112, a2, a3_118, fflags, frm, out s0_928, out s1_929, out a0_162, out a1_163, out a3_930, out s2_931, out s3_932, out s4_933, out s5_934, out s6_935, out s7_936, out s8_937, out s9_938, out fflags_177, out frm_178);
				Eq_2 a1_196;
				Eq_2 a0_203;
				uint32 a1_204;
				word32 s0_939;
				word32 s8_941;
				word32 s9_942;
				word32 a3_940;
				ra = __muldf3(ra_179, a0_162, a1_163, __extendsfdf2(ra_179, fs0_48, fflags_177, frm_178, out a1_196), a1_196, fflags_177, frm_178, out s0_939, out s1_103, out a0_203, out a1_204, out a3_940, out s2_121, out s3_136, out s4, out s5_226, out s6_147, out s7_149, out s8_941, out s9_942, out fflags, out frm);
				struct Eq_477040 * a3_233;
				real32 fa0_238;
				word32 a4_943;
				__truncdfsf2(ra, a0_203, a1_204, fflags, frm, out a2, out a3_233, out a4_943, out a5_100, out fa0_238);
				a3_233->r0010 = fa0_238;
			}
			s5_226 = (word32) s5_226 + 8;
		}
	}
	s0Out = qwArg01F8;
	s1Out = dwLoc64;
	a5Out = a5_100;
	s2Out = s2_121;
	s3Out = s3_136;
	s4Out = s4;
	fs1Out = fs1;
	fflagsOut = fflags;
	frmOut = frm;
	return dwLoc24;
}

