pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23083070: Register ui32 ADC_Tsen_Init(Register ui32 a0)
// Called from:
//      bl_tsen_adc_get
ui32 ADC_Tsen_Init(ui32 a0)
{
	*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x78000000 | 0x00040000;
	*(ui32 *) 0x40010914 = (*(union Eq_476784 *) 0x4000F914 & 0x0FC3FFDF | a0 << 5) & 0xFA00007F | 0x20000140;
	*(ui32 *) 0x40010910 = *(int32 *) 0x4000F910 | 0x04000000;
	int32 a5_30 = *(int32 *) 0x4000F90C;
	*(ui32 *) 0x4001090C = a5_30 | 0x00080000;
	return a5_30 | 0x00080000;
}

// 230830D0: void ADC_SET_TSVBE_LOW()
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
void ADC_SET_TSVBE_LOW()
{
	*(ui32 *) 0x40010914 = (word32) *(union Eq_476784 *) 0x4000F914;
}

// 230830E2: void ADC_SET_TSVBE_HIGH()
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
void ADC_SET_TSVBE_HIGH()
{
	*(ui32 *) 0x40010914 = *(union Eq_476784 *) 0x4000F914 | 0x80000000;
}

// 230830F6: void TSEN_Get_V_Error(Register Eq_2 ra, Register word32 s0, Register (ptr32 word32) a5, Register Eq_113940 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg44, Stack word32 dwArg0128)
void TSEN_Get_V_Error(Eq_2 ra, word32 s0, word32 * a5, Eq_113940 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg44, word32 dwArg0128)
{
	*(a5 | 2) = *a5;
	ADC_SET_TSVBE_LOW();
	uint32 a0_21;
	Eq_2 ra_24 = ADC_Start(ra, s0, out a0_21);
	do
		a0_21 = ADC_Get_FIFO_Count(a0_21);
	while (a0_21 == 0x00);
	g_b4200ECD4 = 0x00;
	word32 * a5_51;
	ptr32 fflags_56;
	ptr32 frm_57;
	Eq_113940 fs1_59;
	struct Eq_477177 * s0_61;
	byte * s2_65;
	word32 s3_66;
	word32 s1_180;
	word32 s4_181;
	Eq_2 ra_60 = ADC_Parse_Result(ra_24, fp + -44, fp + -40, fs1, fflags, frm, dwArg44, out s0_61, out s1_180, out a5_51, out s2_65, out s3_66, out s4_181, out fs1_59, out fflags_56, out frm_57);
	*s2_65 = (byte) s3_66;
	*(a5_51 | 2) = *a5_51;
	ADC_SET_TSVBE_HIGH();
	uint32 a0_88;
	Eq_2 ra_91 = ADC_Start(ra_60, &s0_61->bFFFFFCD4, out a0_88);
	do
		a0_88 = ADC_Get_FIFO_Count(a0_88);
	while (a0_88 == 0x00);
	s0_61->bFFFFFCD4 = 0x00;
	byte * s0_125;
	word32 s1_126;
	word32 frm_188;
	word32 fs1_186;
	word32 fflags_187;
	word32 s3_184;
	word32 s4_185;
	word32 a5_182;
	word32 s2_183;
	ADC_Parse_Result(ra_91, fp + -44, fp + -40, fs1_59, fflags_56, frm_57, dwArg44, out s0_125, out s1_126, out a5_182, out s2_183, out s3_184, out s4_185, out fs1_186, out fflags_187, out frm_188);
	*s0_125 = (byte) s1_126;
	0x00 = dwArg0128;
}

// 23083196: Register Eq_2 TSEN_Get_Temp(Register Eq_2 ra, Register word32 s0, Register (ptr32 word32) a5, Register Eq_113940 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 fs1Out, Register out ptr32 fa0Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      bl_tsen_adc_get
Eq_2 TSEN_Get_Temp(Eq_2 ra, word32 s0, word32 * a5, Eq_113940 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg44, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & fs1Out, ptr32 & fa0Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	*(a5 | 2) = *a5;
	ADC_SET_TSVBE_LOW();
	uint32 a0_25;
	Eq_2 ra_28 = ADC_Start(ra, s0, out a0_25);
	do
		a0_25 = ADC_Get_FIFO_Count(a0_25);
	while (a0_25 == 0x00);
	g_b4200ECD4 = 0x00;
	ptr32 fflags_61;
	ptr32 frm_62;
	Eq_113940 fs1_64;
	struct Eq_477283 * s0_66;
	int32 * s2_70;
	byte * s3_71;
	word32 s4_72;
	word32 a5_267;
	word32 s1_266;
	Eq_2 ra_65 = ADC_Parse_Result(ra_28, fp + -44, fp + -40, fs1, fflags, frm, dwArg44, out s0_66, out s1_266, out a5_267, out s2_70, out s3_71, out s4_72, out fs1_64, out fflags_61, out frm_62);
	*s3_71 = (byte) s4_72;
	*s2_70 |= 2;
	ADC_SET_TSVBE_HIGH();
	uint32 a0_93;
	Eq_2 ra_96 = ADC_Start(ra_65, &s0_66->bFFFFFCD4, out a0_93);
	do
		a0_93 = ADC_Get_FIFO_Count(a0_93);
	while (a0_93 == 0x00);
	real32 fa0_154;
	s0_66->bFFFFFCD4 = 0x00;
	ptr32 fflags_125;
	ptr32 frm_126;
	ptr32 fs1_128;
	byte * s0_130;
	word32 s1_131;
	word32 s2_134;
	up32 s3_135;
	word32 a5_268;
	word32 s4_269;
	Eq_2 ra_129 = ADC_Parse_Result(ra_96, fp + -44, fp + -40, fs1_64, fflags_61, frm_62, dwArg44, out s0_130, out s1_131, out a5_268, out s2_134, out s3_135, out s4_269, out fs1_128, out fflags_125, out frm_126);
	*s0_130 = (byte) s2_134;
	up32 a5_148 = (word32) wLoc26;
	real32 fa4_150 = (real32) s3_135;
	real32 fa0_151 = (real32) a5_148;
	real32 fa5_152 = (real32) s1_131;
	if (a5_148 < s3_135)
		fa0_154 = fa4_150 - fa0_151;
	else
		fa0_154 = fa0_151 - fa4_150;
	word32 s0_270;
	word32 s7_275;
	word32 s6_274;
	word32 s5_273;
	word32 s9_276;
	Eq_2 a1_163;
	Eq_2 a0_170;
	uint32 a1_171;
	ptr32 fflags_185;
	ptr32 frm_186;
	ptr32 s2_190;
	ptr32 s3_191;
	word32 s1_271;
	word32 a3_272;
	Eq_2 ra_187 = __divdf3(ra_129, __extendsfdf2(ra_129, fa0_154 - fa5_152, fflags_125, frm_126, out a1_163), a1_163, g_t230C6198, g_t230C619C, fflags_125, frm_126, out s0_270, out s1_271, out a0_170, out a1_171, out a3_272, out s2_190, out s3_191, out s5_273, out s6_274, out s7_275, out s9_276, out fflags_185, out frm_186);
	word32 a2_277;
	word32 a3_278;
	word32 a4_279;
	ptr32 fa0_205;
	word32 a5_280;
	ptr32 a1_198 = __truncdfsf2(ra_187, a0_170, a1_171, fflags_185, frm_186, out a2_277, out a3_278, out a4_279, out a5_280, out fa0_205);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	a1Out = a1_198;
	s2Out = s2_190;
	s3Out = s3_191;
	fs1Out = fs1_128;
	fa0Out = fa0_205;
	fflagsOut = fflags_185;
	frmOut = frm_186;
	return ra_187;
}

// 23083274: void ADC_Init(Register (ptr32 Eq_381021) a0)
// Called from:
//      bl_tsen_adc_get
void ADC_Init(struct Eq_381021 * a0)
{
	ui32 a4_57;
	ui32 a5_56;
	*(ui32 *) 0x40010910 = (word32) a0->b000A << 2 | (((word32) a0->b0002 << 18 | ((word32) a0->b0001 << 27 | ((word32) a0->b0000 << 29 | *((int32 *) 0x4000F910) & ~0x60000000) & ~0x18000000) & ~0x07FC0000) & ~0x20000001 | (word32) a0->b000B) & ~0x1C;
	ui32 a3_36 = (word32) a0->b0003;
	ui32 a1_40 = (word32) a0->b0004;
	ui32 a5_53 = (word32) a0->b0006 << 0x0011 | (a1_40 << 22 | (a3_36 << 0x19 | *((union Eq_476784 *) 0x4000F914) & ~0x7E000000) & ~0x01C00000) & ~0x20000000;
	if ((a3_36 | a1_40) != 0x00)
	{
		a5_56 = a5_53 & ~0x1C000000;
		a4_57 = 0x12000000;
	}
	else
	{
		a5_56 = a5_53 & ~0x1E000000;
		a4_57 = 0x08000000;
	}
	*(ui32 *) 0x40010914 = ((a5_56 | a4_57) & 0xFE00007F | (word32) a0->b0007 << 7) & ~0x0C | (word32) a0->b0008 << 3 | 0x01000000 | (word32) a0->b0009 << 2;
	int32 a5_85 = *(int32 *) 0x4000F938;
	ui32 a5_88 = (int32) a0->w000C | a5_85 & 0xF0000000;
	*(ui32 *) 0x40010938 = a5_88;
	g_t4200CB5C();
}

// 2308336E: Register word32 Sec_Eng_SHA256_Update.part.0(Register (ptr32 Eq_443217) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Stack word32 dwArgA8, Register out ptr32 s0Out, Register out (ptr32 Eq_443217) s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_477575 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_477579 s6Out, Register out ptr32 s8Out, Register out ptr32 t3Out)
// Called from:
//      Sec_Eng_SHA256_Update
//      Sec_Eng_SHA256_Finish
word32 Sec_Eng_SHA256_Update.part.0(struct Eq_443217 * a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, word32 dwArgA8, ptr32 & s0Out, struct Eq_443217 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_477575 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_477579 & s6Out, ptr32 & s8Out, ptr32 & t3Out)
{
	struct Eq_443217 * s1_115 = a0;
	Eq_2 s3_119 = a1;
	Eq_2 s0_102 = a2;
	Eq_2 a4_112 = 16000000;
	ptr32 a3_105 = 0x40004000;
	do
	{
		ptr32 a0_209;
		Eq_477579 s6_175 = *(union Eq_477579 *) 0x40004000;
		a4_112 = (word32) a4_112 - 1;
		if (a4_112 == 0x00)
		{
l230834B8:
			a0_209 = 0x02;
			goto l230834A4;
		}
	} while ((s6_175 & 1) != 0x00);
	s1_115 = (struct Eq_443217 *) *a4_112;
	s2 = (word32) s1_115->b0010;
	a4_112 += a2;
	*a4_112 = s1_115;
	ui32 s4_100 = a4_112 & 63;
	if (a4_112 < a2)
	{
		s1_115 = (s6_175 & 1)->ptr0004;
		(s6_175 & 1)->ptr0005 = s1_115;
	}
	if ((a4_112 & 63) != 0x00)
	{
		s5 = 64 - (a4_112 & 63);
		if (a2 >= s5)
		{
			word32 s0_64;
			word32 s3_66;
			word32 s4_69;
			ui32 s6_71;
			struct Eq_477636 * a5_76;
			g_t4200C52E();
			s1_115 = a5_76->ptr0008;
			a5_76->dw0004 = 0x40004000;
			ui32 a5_89 = (word32) (word16) (s2 << 0x06 | s6_71 & -65);
			*(a5_89 | 0x10000000) = 0x40004000;
			*(a5_89 | 0x10000002) = 0x40004000;
			s1_115->b0010 = 0x01;
			s6_175 = s6_71 & -65;
			a4_112.u0 = 0x10000002;
			s0_102 = s0_64 + -64 + s4_69;
			s3_119 = (word32) s5 + s3_66;
			s4_100 = 0x00;
		}
	}
	ui32 a2_103 = s0_102 & 63;
	if (s0_102 > 63)
	{
		a3_105 = 16000000;
		do
		{
			a1 = *(union Eq_2 *) 63;
			a3_105 += ~0x00;
			if (a3_105 == 0x00)
				goto l230834B8;
			a4_112.u0 = 0x01;
		} while (true);
		ui32 a5_117 = (word32) s1_115->b0010;
		*((word32) a1 + 4) = s3_119;
		a4_112 = (word32) (word16) (a5_117 << 6 | 0x3F);
		union Eq_2 * a5_128 = s0_102 >> 0x06 << 16 | a4_112;
		*a5_128 = (union Eq_2 *) a1;
		*(a5_128 | 2) = (union Eq_2 *) a1;
		s1_115->b0010 = 0x01;
		s0_102 &= -64;
		s3_119 += s0_102;
	}
	if (a2_103 != 0x00)
	{
		word32 a5_139 = 16000000;
		do
		{
			a3_105 = (ptr32) *a4_112;
			a5_139 += ~0x00;
			if (a5_139 == 0x00)
				goto l230834B8;
			a4_112 &= 0x01;
		} while (a4_112 != 0x00);
		word32 a5_196;
		g_t4200C52E();
	}
	word32 a5_202 = 16000000;
	do
	{
		a3_105 = (ptr32) *a4_112;
		a5_202 += ~0x00;
		if (a5_202 == 0x00)
			goto l230834B8;
		a4_112 &= 0x01;
	} while (a4_112 != 0x00);
	a0_209 = 0x00;
l230834A4:
	0x00 = dwArgA8;
	s0Out = s1;
	s1Out = s1_115;
	a0Out = a0_209;
	a1Out = a1;
	a3Out = a3_105;
	a4Out = a4_112;
	s2Out = s2;
	s3Out = s3_119;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6_175;
	s8Out = s4;
	t3Out = dwArg00;
	return ra;
}

// 230834BC: Register (ptr32 word32) Sec_Eng_SHA256_Init(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg84, Stack word32 dwArgA4)
// Called from:
//      bl_sha_init
word32 * Sec_Eng_SHA256_Init(Eq_2 ra, Eq_2 a0, ui32 a2, word32 * a5, Eq_2 dwArg84, word32 dwArgA4)
{
	*(a2 << 2 | a5 & ~0x1C) = *a5;
	struct Eq_477779 * a3_26;
	struct Eq_477780 * a4_27;
	word32 a5_28;
	word32 t1_80;
	word32 a0_81;
	word32 a1_82;
	word32 a2_83;
	memset(ra, a0, 0x00, 0x14, out t1_80, out a0_81, out a1_82, out a2_83, out a3_26, out a4_27, out a5_28);
	a4_27->dw000C = dwArgA4;
	a3_26->dw0008 = dwArgA4;
	word32 sp_40;
	word32 ra_41;
	word32 a3_43;
	word32 a4_44;
	word32 a5_46;
	word32 a0_48;
	g_t4200C538();
	word32 * a5_66;
	g_t4200C538();
	return a5_66;
}

// 2308350C: void Sec_Eng_SHA_Start(Register (ptr32 word32) a5)
// Called from:
//      bl_sha_init
void Sec_Eng_SHA_Start(word32 * a5)
{
	*(a5 & -65 | 32) = *a5;
}

// 2308351E: Register word32 Sec_Eng_SHA256_Update(Register (ptr32 Eq_443217) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Stack word32 dwArgA8, Register out (ptr32 Eq_477829) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_477833 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out)
// Called from:
//      Sec_Eng_SHA256_Finish
//      bl_sha_update
word32 Sec_Eng_SHA256_Update(struct Eq_443217 * a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, word32 dwArgA8, struct Eq_477829 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_477833 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out)
{
	if (a3 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a2;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return ra;
	}
	else
	{
		ptr32 a0_11;
		Eq_477833 a4_14;
		struct Eq_477829 * s0_16;
		ptr32 s1_17;
		ptr32 s3_18;
		ptr32 s4_19;
		ptr32 s6_20;
		ptr32 s2_25;
		Eq_2 a1_26;
		Eq_2 s5_28;
		word32 a3_72;
		word32 s8_73;
		word32 t3_74;
		word32 ra_27 = Sec_Eng_SHA256_Update.part.0(a0, a2, a3, s5, dwArgA8, out s0_16, out s1_17, out a0_11, out a1_26, out a3_72, out a4_14, out s2_25, out s3_18, out s4_19, out s5_28, out s6_20, out s8_73, out t3_74);
		s0Out = s0_16;
		s1Out = s1_17;
		a0Out = a0_11;
		a1Out = a1_26;
		a4Out = a4_14;
		s2Out = s2_25;
		s3Out = s3_18;
		s4Out = s4_19;
		s5Out = s5_28;
		s6Out = s6_20;
		return ra_27;
	}
}

// 2308352C: Register word32 Sec_Eng_SHA256_Finish(Register Eq_2 a2, Register (ptr32 ui32) a4, Register Eq_2 s5, Stack word32 dwArg88, Register out (ptr32 Eq_477884) s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out)
// Called from:
//      bl_sha_finish
word32 Sec_Eng_SHA256_Finish(Eq_2 a2, ui32 * a4, Eq_2 s5, word32 dwArg88, struct Eq_477884 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out)
{
	word32 a5_10 = 16000000;
	do
	{
		ui32 a3_8 = *a4;
		a5_10 += ~0x00;
		if (a5_10 == 0x00)
		{
			s0Out = s0;
			s1Out = s1;
			s2Out = s2;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			return ra;
		}
		a4 &= 0x01;
	} while (a4 != null);
	int32 a5_51;
	if ((a3_8 & 63) <= 55)
		a5_51 = 56;
	else
		a5_51 = 0x0078;
	word32 a0_67;
	word32 s3_385;
	word32 s4_386;
	word32 a1_384;
	ui32 a4_71;
	struct Eq_477884 * s0_129;
	ptr32 s1_130;
	ptr32 s2_138;
	Eq_2 s5_141;
	ptr32 s6_133;
	word32 ra_140 = Sec_Eng_SHA256_Update(*((word32) a2 + 0x0C), a2, a5_51 - (a3_8 & 63), s5, dwArg88, out s0_129, out s1_130, out a0_67, out a1_384, out a4_71, out s2_138, out s3_385, out s4_386, out s5_141, out s6_133);
	word32 a5_86 = 16000000;
	do
	{
		a5_86 += ~0x00;
		if (a5_86 == 0x00)
		{
l23083542:
			goto l23083544;
		}
		a4_71 &= 0x01;
	} while (a4_71 != 0x00);
	struct Eq_477926 * sp_102;
	Eq_2 a1_112;
	Eq_2 s5_116;
	g_t4200C52E();
	word32 s3_131;
	word32 s4_132;
	word32 s8_134;
	word32 t3_135;
	word32 a0_381;
	word32 a4_383;
	word32 a1_382;
	uint32 a3_126;
	ra_140 = Sec_Eng_SHA256_Update.part.0(*((word32) a1_112 + 0x0C), a1_112, 0x08, s5_116, sp_102->dw00A8, out s0_129, out s1_130, out a0_381, out a1_382, out a3_126, out a4_383, out s2_138, out s3_131, out s4_132, out s5_141, out s6_133, out s8_134, out t3_135);
	uint32 a4_143 = 16000000;
	do
	{
		a4_143 += ~0x00;
		if (a4_143 == 0x00)
			goto l23083542;
		a3_126 &= 0x01;
	} while (a3_126 != 0x00);
	s0_129->b0000 = (byte) a3_126;
	s0_129->b0001 = (byte) (a3_126 >> 0x08);
	s0_129->b0002 = (byte) (a3_126 >> 0x10);
	s0_129->b0003 = (byte) (a3_126 >> 24);
	s0_129->b0004 = (byte) (a3_126 >> 24);
	s0_129->b0005 = (byte) (a3_126 >> 0x20);
	s0_129->b0006 = (byte) (a3_126 >> 0x28);
	s0_129->b0007 = (byte) (a3_126 >> 48);
	s0_129->b0008 = (byte) (a3_126 >> 48);
	s0_129->b0009 = (byte) (a3_126 >> 0x38);
	s0_129->b000A = (byte) (a3_126 >> 0x40);
	s0_129->b000B = (byte) (a3_126 >> 72);
	s0_129->b000C = (byte) (a3_126 >> 72);
	s0_129->b000D = (byte) (a3_126 >> 0x50);
	s0_129->b000E = (byte) (a3_126 >> 88);
	s0_129->b000F = (byte) (a3_126 >> 96);
	struct Eq_478067 * a5_188 = (a3_126 >> 96)->ptr0020;
	s0_129->b0010 = (byte) (a3_126 >> 96);
	s0_129->b0011 = (byte) (a3_126 >> 0x68);
	s0_129->b0013 = (byte) (a3_126 >> 0x0078);
	s0_129->b0012 = (byte) (a3_126 >> 0x70);
	ui32 a4_164 = a4_143 >> 2 & 0x00FF;
	if ((a4_164 & 6) == 0x00)
	{
		s0_129->b0014 = (byte) (a4_164 & 6);
		s0_129->b0015 = (byte) ((a4_164 & 6) >> 0x08);
		s0_129->b0016 = (byte) ((a4_164 & 6) >> 0x10);
		struct Eq_478131 * a3_203 = (a4_164 & 6) >> 24;
		s0_129->b0017 = (byte) a3_203;
		a5_188 = a3_203->ptr0028;
		s0_129->b0018 = (byte) a3_203;
		s0_129->b0019 = (byte) (a3_203 >> 0x08);
		s0_129->b001A = (byte) (a3_203 >> 0x10);
		s0_129->b001B = (byte) (a3_203 >> 24);
		if ((a4_164 & 0x07) == 0x00)
		{
			uint32 a5_214 = a5_188->dw002C;
			s0_129->b001C = (byte) a5_214;
			s0_129->b001D = (byte) (a5_214 >> 0x08);
			s0_129->b001E = (byte) (a5_214 >> 0x10);
			s0_129->b001F = (byte) (a5_214 >> 24);
			a5_188 = a5_214 >> 24;
		}
	}
	*(a5_188 & -97) = a5_188->dw0000;
l23083544:
	s0Out = s0_129;
	s1Out = s1_130;
	s2Out = s2_138;
	s4Out = dwArg04;
	s5Out = s5_141;
	s6Out = s6_133;
	return ra_140;
}

// 23083716: void DMA_Enable(Register (ptr32 Eq_367081) a5)
// Called from:
//      bl_dma_init
void DMA_Enable(struct Eq_367081 * a5)
{
	(a5 | 1)->dw0030 = a5->dw0030;
}

// 23083724: void DMA_Channel_Enable()
// Called from:
//      bl_dma_IRQHandler
void DMA_Channel_Enable()
{
	*(word32 *) 0x4000C111 = *(word32 *) 0x4000C110;
}

