pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308373A: void DMA_LLI_Init(Register (ptr32 Eq_367162) a1)
// Called from:
//      bl_dma_init
void DMA_LLI_Init(struct Eq_367162 * a1)
{
	*(((word32) a1->b0000 << 11 | 0x40000110) & -0x07FF | (word32) a1->b0002 << 6 | (word32) a1->b0001 << 1) = *(word32 *) 0x4000C110;
}

// 23083770: void DMA_LLI_Update(Register word32 a0)
// Called from:
//      bl_dma_IRQHandler
void DMA_LLI_Update(word32 a0)
{
	g_t4200C524();
}

// 23083786: void DMA_IntMask(Register word32 a1, Register word32 a2)
// Called from:
//      bl_dma_init
void DMA_IntMask(word32 a1, word32 a2)
{
	word32 * a5_15;
	word32 a0_10;
	ui32 a4_12;
	word32 * a5_20;
	if (a1 == 0x01)
	{
		a5_20 = (word32 *) 0x4000C110;
		a0_10 = *(word32 *) 0x4000C110;
		if (a2 == 0x00)
		{
			a5_15 = (word32 *) 0x4000C110;
			goto l230837D0;
		}
		a4_12 = 0x04000000;
l230837D6:
		a5_15 = a5_20 | a4_12;
		goto l230837D0;
	}
	word32 a3_21;
	ui32 a3_22;
	if (a1 != 0x00)
	{
		if (a1 != 0x02)
			return;
		a5_20 = *(word32 **) 0x4000C10C;
		if (a2 == 0x00)
		{
			a3_21 = 0xF4000000;
l230837F0:
			*(a3_21 + ~0x00 & 0x4000C10C) = a5_20;
			a0_10 = *a5_20;
			a4_12 = 0x80000000;
			goto l230837D6;
		}
		a3_22 = 0x0C000000;
	}
	else
	{
		a5_20 = *(word32 **) 0x4000C10C;
		a3_21 = 0xF8000000;
		if (a2 == 0x00)
			goto l230837F0;
		a3_22 = 0x08000000;
	}
	*(a3_22 | 0x4000C10C) = a5_20;
	a0_10 = *a5_20;
	a5_15 = (word32) (word31) a5_20;
l230837D0:
	*a5_15 = a0_10;
}

// 23083802: void Default_Handler(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Stack word32 dwArgE8)
// Called from:
//      SPI_IRQHandler
void Default_Handler(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, word32 dwArgE8)
{
	bflb_platform_printf(ra, &g_t230C61A0, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, dwArgE8);
}

// 2308380E: Register word32 GLB_Set_UART_CLK(Register word32 a0, Register ui32 a1, Register ui32 a2, Register (ptr32 Eq_365911) a5, Register out ptr32 a2Out)
// Called from:
//      bl_uart_init
word32 GLB_Set_UART_CLK(word32 a0, ui32 a1, ui32 a2, struct Eq_365911 * a5, ptr32 & a2Out)
{
	(a5 & ~0x10)->dw0008 = a5->dw0008;
	struct Eq_478349 * a5_19 = a5 & ~0x10 & ~0x07;
	(a2 | a5_19)->dw0008 = (a5 & ~0x10)->dw0008;
	ui32 a4_24 = HBN_Set_UART_CLK_Sel(a1, a5_19);
	struct Eq_478367 * a5_27 = a4_24 | 16;
	if (a0 == 0x00)
		a5_27 = a4_24 & -0x0011;
	a5_27->dw0008 = 0x40000000;
	a2Out = dwArg10;
	return a0;
}

// 2308384C: void GLB_Set_EM_Sel(Register ui32 a0, Register (ptr32 Eq_366517) a5)
// Called from:
//      bl_sys_em_config
void GLB_Set_EM_Sel(ui32 a0, struct Eq_366517 * a5)
{
	(a0 | a5 & ~0x0F)->dw007C = a5->dw007C;
}

// 2308385C: void GLB_Set_ADC_CLK(Register word32 a0, Register ui32 a1, Register ui32 a2)
// Called from:
//      bl_tsen_adc_get
void GLB_Set_ADC_CLK(word32 a0, ui32 a1, ui32 a2)
{
	*(int32 *) 0x400000A4 &= -0x0101;
	*(int32 *) 0x400000A4 = (a2 | *((int32 *) 0x400000A4) & -64) & -0x0081 | a1 << 7;
	int32 a4_17 = *(int32 *) 0x400000A4;
	int32 a5_18 = a4_17 & -0x0101;
	if (a0 != 0x00)
		a5_18 = a4_17 | 0x0100;
	*(int32 *) 0x400000A4 = a5_18;
}

// 2308389C: Register word32 GLB_UART_Fun_Sel(Register ui32 a0, Register Eq_3286 a1)
// Called from:
//      bl_uart_init
word32 GLB_UART_Fun_Sel(ui32 a0, Eq_3286 a1)
{
	*(int32 *) 0x400000C0 = ~(0x0F << (a0 << 2)) & *((int32 *) 0x400000C0) | a1 << (a0 << 2);
	return 0x40000000;
}

// 230838C0: void GLB_GPIO_Write(Register ui32 a0, Register word32 a1, Register (ptr32 word32) a3)
// Called from:
//      bl_gpio_output_set
void GLB_GPIO_Write(ui32 a0, word32 a1, word32 * a3)
{
	word32 * a0_15;
	word32 a5_11 = *a3;
	ui32 a0_12 = 0x01 << a0;
	if (a1 != 0x00)
		a0_15 = a0_12 | a3;
	else
		a0_15 = ~a0_12 & a3;
	*a0_15 = a5_11;
}

// 230838EA: Register uint32 GLB_GPIO_Read(Register uint32 a0)
// Called from:
//      bl_gpio_input_get
uint32 GLB_GPIO_Read(uint32 a0)
{
	return (word32) ((0x01 << a0 & ((int32[]) 0x40000180)[a0 >> 0x05]) != 0x00);
}

// 2308390A: Register word32 HBN_Set_UART_CLK_Sel(Register ui32 a0, Register (ptr32 Eq_478349) a5)
// Called from:
//      GLB_Set_UART_CLK
word32 HBN_Set_UART_CLK_Sel(ui32 a0, struct Eq_478349 * a5)
{
	word32 a4_5 = a5->dw0030;
	(a0 << 2 | a5 & ~0x04)->dw0030 = a4_5;
	return a4_5;
}

// 2308391C: Register ptr32 HBN_Get_RTC_Timer_Val(Register ptr32 a0, Register ptr32 a1, Register Eq_2 a4)
// Called from:
//      bl_rtc_get_counter
ptr32 HBN_Get_RTC_Timer_Val(ptr32 a0, ptr32 a1, Eq_2 a4)
{
	word32 a5_5 = *((word32) a4 + 16);
	(a4 | 0x80000000)->dw0010 = a5_5;
	(a4 & 0x7FFFFFFF)->dw0010 = a5_5;
	struct Eq_478488 * a5_12 = (a4 & 0x7FFFFFFF)->ptr000C;
	*(a4 & 0x7FFFFFFF) = a0;
	*(a5_12->dw0010 & 0x00FF) = a1;
	return 0x00;
}

// 23083944: Register (ptr32 Eq_478506) HBN_Clear_IRQ(Register word32 a0, Register (ptr32 Eq_478506) a3)
// Called from:
//      bl_hbn_enter
struct Eq_478506 * HBN_Clear_IRQ(word32 a0, struct Eq_478506 * a3)
{
	ui32 a0_8 = 0x01 << a0;
	struct Eq_478506 * a3_9 = a3 | a0_8;
	a3_9->dw001C = a3->dw001C;
	(~a0_8 & 0x01)->t001C = *(union Eq_2 *) 0x1D;
	return a3_9;
}

// 23083962: void HBN_Aon_Pad_IeSmt_Cfg(Register ui32 a0, Register (ptr32 Eq_23) a5)
// Called from:
//      bl_sys_early_init
void HBN_Aon_Pad_IeSmt_Cfg(ui32 a0, struct Eq_23 * a5)
{
	(a0 << 8 | a5 & -0x0101)->dw0014 = a5->dw0014;
}

// 23083976: void TIMER_SetCompValue(Register ui32 a0, Register word32 a1, Register (ptr32 ui32) a2)
// Called from:
//      TIMER_Init
void TIMER_SetCompValue(ui32 a0, word32 a1, ui32 * a2)
{
	*a2 = (a0 + 0x03 + a1 << 2) + 0x4000A510;
}

// 2308398E: void TIMER_SetCountMode(Register ui32 a0, Register ui32 a1)
// Called from:
//      TIMER_Init
void TIMER_SetCountMode(ui32 a0, ui32 a1)
{
	*(int32 *) 0x4000A588 = ~(0x01 << a0 + 0x01) & *((int32 *) 0x4000A588) | a1 << a0 + 0x01;
}

// 230839B0: void TIMER_ClearIntStatus(Register word32 a1, Register Eq_2 a4)
// Called from:
//      int_timer_cb
//      bl_timer_tick_enable
void TIMER_ClearIntStatus(word32 a1, Eq_2 a4)
{
	*(0x01 << a1 | a4) = (word32) *a4;
}

// 230839CA: Register ui32 TIMER_Init(Register (ptr32 Eq_381654) a0, Register (ptr32 ui32) a2, Stack word32 dwArg38, Register out ptr32 a4Out, Register out (ptr32 ptr32) s2Out)
// Called from:
//      bl_timer_tick_enable
ui32 TIMER_Init(struct Eq_381654 * a0, ui32 * a2, word32 dwArg38, ptr32 & a4Out, ptr32 & s2Out)
{
	ui32 a3_18;
	ui32 a5_19;
	ui32 s1_14 = (word32) a0->b0000;
	int32 a5_15 = *(int32 *) 0x4000A500;
	ui32 a4_17 = (word32) a0->b0001;
	if (s1_14 == 0x00)
	{
		a3_18 = a5_15 & -0x0D;
		a5_19 = a4_17 << 0x02;
	}
	else
	{
		a3_18 = a5_15 & -97;
		a5_19 = a4_17 << 0x05;
	}
	ui32 a3_33;
	ui32 a5_34;
	*(int32 *) 0x4000A500 = a5_19 | a3_18;
	Eq_478601 a5_27 = *(union Eq_478601 *) 0x4000A5BC;
	ui32 a4_29 = (word32) a0->b0004;
	if (s1_14 == 0x00)
	{
		a3_33 = a5_27 & 0xF00000FF;
		a5_34 = a4_29 << 0x08;
	}
	else
	{
		a3_33 = a5_27 & ~0x00FF0000;
		a5_34 = a4_29 << 0x10;
	}
	*(union Eq_478601 *) 0x4000A5BC = a5_34 | a3_33;
	TIMER_SetCountMode(s1_14, (word32) a0->b0003);
	null[(word32) a0->b0002 / 4] = (s1_14 << 0x02) + 0x4000A55C;
	ptr32 * s2_112 = (ptr32 *) 0x4000A000;
	ptr32 a4_57 = (word32) a0->b0003;
	if (a4_57 == 0x00)
	{
		s2_112 = (s1_14 << 0x02) + 0x4000A550;
		*s2_112 = a4_57;
	}
	TIMER_SetCompValue(s1_14, 0x00, a2);
	TIMER_SetCompValue(s1_14, 0x01, a2);
	TIMER_SetCompValue(s1_14, 0x02, a2);
	0x00 = dwArg38;
	a4Out = a4_57;
	s2Out = s2_112;
	return s1_14;
}

// 23083A8A: void TIMER_Enable(Register word32 a0)
// Called from:
//      bl_timer_tick_enable
void TIMER_Enable(word32 a0)
{
	*(int32 *) 0x4000A584 = 0x01 << a0 + 0x01 | *((int32 *) 0x4000A584);
}

// 23083AA2: void TIMER_Disable(Register word32 a0)
// Called from:
//      bl_timer_tick_enable
void TIMER_Disable(word32 a0)
{
	*(int32 *) 0x4000A584 = ~(0x01 << a0 + 0x01) & *((int32 *) 0x4000A584);
}

// 23083ABE: void TIMER_IntMask(Register word32 a1, Register word32 a2)
// Called from:
//      bl_timer_tick_enable
void TIMER_IntMask(word32 a1, word32 a2)
{
	word32 * a5_12;
	word32 a0_8 = *(word32 *) 0x4000A544;
	if (a1 != 0x01)
	{
		if (a1 != 0x00)
		{
			if (a1 != 0x02)
			{
				if (a1 != 0x03)
					return;
				if (a2 == 0x00)
				{
					*(word32 *) 0x4000A545 = a0_8;
					*(word32 *) 0x4000A546 = a0_8;
l23083AFE:
					a5_12 = (word32 *) 0x4000A544;
					goto l23083AE8;
				}
				*(word32 *) 0x4000A544 = a0_8;
				*(word32 *) 0x4000A544 = a0_8;
			}
			else if (a2 == 0x00)
				goto l23083AFE;
			a5_12 = (word32 *) 0x4000A540;
		}
		else if (a2 == 0x00)
			a5_12 = (word32 *) 0x4000A545;
		else
			a5_12 = (word32 *) 0x4000A544;
	}
	else if (a2 == 0x00)
		a5_12 = (word32 *) 0x4000A546;
	else
		a5_12 = (word32 *) 0x4000A544;
l23083AE8:
	*a5_12 = a0_8;
}

// 23083B24: void WDT_Set_Clock(Register ui32 a0, Register ui32 a1)
// Called from:
//      bl_wdt_init
void WDT_Set_Clock(ui32 a0, ui32 a1)
{
	*(int32 *) 0x4000A500 = a0 << 8 | *((int32 *) 0x4000A500) & -769;
	*(union Eq_478601 *) 0x4000A5BC = (word32) *(union Eq_478601 *) 0x4000A5BC | a1 << 24;
}

