pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23083EE0: Register (ptr32 byte) EF_Ctrl_Read_CapCode_Opt(Register Eq_2 ra, Register up32 s0, Register (ptr32 byte) s1, Register up32 a0, Register word32 a1, Register (ptr32 byte) a2, Register ptr32 s2, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      mfg_media_read_xtal_capcode
byte * EF_Ctrl_Read_CapCode_Opt(Eq_2 ra, up32 s0, byte * s1, up32 a0, word32 a1, byte * a2, ptr32 s2, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out)
{
	if (a0 > 0x02)
	{
		a0Out = 0x01;
		s2Out = s2;
		s4Out = s4;
		return s1;
	}
	word32 a2_24;
	word32 a1_28;
	word32 t3_29;
	word32 s8_30;
	word32 s4_31;
	word32 a6_32;
	word32 s0_25;
	struct Eq_479223 * sp_20;
	ui32 a0_22;
	byte * s1_136;
	ptr32 s2_139;
	g_t4200C556();
	if (s2_139 != 0x00)
	{
		word32 t3_43;
		word32 s8_44;
		word32 s4_45;
		word32 a6_46;
		g_t4200C56A();
	}
	uint32 a5_55;
	if (s0_25 == 0x00)
		a5_55 = *(uint32 *) 0x4000700C >> 2;
	else
	{
		uint32 a5_51;
		if (s0_25 == 0x01)
			a5_51 = *(uint32 *) 0x40007070;
		else
			a5_51 = *(uint32 *) 0x40007008;
		a5_55 = a5_51 >> 22;
	}
	ptr32 a0_109;
	sp_20->dw0084 = a5_55;
	word32 a2_64 = sp_20->dw0044;
	if ((a0_22 & 0x0080) != 0x00)
	{
		ui32 s0_69 = a0_22 & 63;
		ptr32 a0_80;
		word32 s0_83;
		word32 t3_87;
		word32 s8_88;
		word32 s4_89;
		word32 a6_90;
		g_t4200CDC2();
		if (s2_139 == a0_80)
		{
			*s1_136 = (byte) s0_83;
			a0_109 = 0x00;
l23083EEC:
			a0Out = a0_109;
			s2Out = s2_139;
			s4Out = dwArg04;
			return s1_136;
		}
	}
	a0_109 = 0x01;
	goto l23083EEC;
}

// 23083F6C: Register Eq_2 EF_Ctrl_Is_PowerOffset_Slot_Empty(Register Eq_2 ra, Register (ptr32 byte) s0, Register word32 a0, Register word32 a1, Register out (ptr32 byte) s0Out, Register out Eq_479288 a0Out)
// Called from:
//      mfg_media_read_poweroffset
Eq_2 EF_Ctrl_Is_PowerOffset_Slot_Empty(Eq_2 ra, byte * s0, word32 a0, word32 a1, byte & s0Out, union Eq_479288 & a0Out)
{
	word32 a1_15;
	word32 a0_17;
	byte * s0_14;
	Eq_2 ra_16;
	g_t4200C556();
	if (a1_15 != 0x00)
		g_t4200C56A();
	ui32 a0_38;
	ui32 a4_52;
	word32 a5_43;
	if (s0_14 == null)
	{
		a4_52 = 0x01;
		a5_43 = (word32) (*(uint32 *) 0x40007078 >> 0x0F < 1);
	}
	else
	{
		uint32 a4_44;
		if (s0_14 == (byte *) 0x01)
		{
			a4_44 = (*(struct Eq_67419 **) 117)->dw000C;
			a5_43 = (word32) false;
		}
		else
		{
			a0_38 = 0x00;
			if (s0_14 != (byte *) 0x02)
				goto l23083FA0;
			a5_43 = (word32) true;
			a4_44 = (*(struct Eq_479331 **) 118)->dw000C >> 1;
		}
		a4_52 = ~a4_44 & 0x01;
	}
	a0_38 = 0x00;
	if (a5_43 != 0x00)
		a0_38 = a4_52;
l23083FA0:
	s0Out = s0_14;
	a0Out = a0_38 & 0x00FF;
	return ra_16;
}

// 23083FE4: Register Eq_2 EF_Ctrl_Read_PowerOffset_Opt(Register Eq_2 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register ptr32 a1, Register word32 a2, Register word32 s2, Register word32 s3, Register word32 s4, Stack word32 dwArg0128, Register out Eq_479350 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      mfg_media_read_poweroffset
Eq_2 EF_Ctrl_Read_PowerOffset_Opt(Eq_2 ra, word32 s0, word32 s1, word32 a0, ptr32 a1, word32 a2, word32 s2, word32 s3, word32 s4, word32 dwArg0128, union Eq_479350 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_479355 * sp_23;
	word32 a0_31;
	word32 a1_32;
	struct Eq_479358 * s0_24;
	Eq_2 ra_106;
	Eq_479350 s1_107;
	ptr32 s2_104;
	ptr32 s3_108;
	ptr32 s4_109;
	g_t4200C556();
	word32 a2_38 = sp_23->dw0084;
	if (a2_38 != 0x00)
		g_t4200C56A();
	ptr32 a0_117;
	uint32 s0_63;
	ui32 a5_72;
	if (s0_24 == null)
	{
		a5_72 = s0_24 >> 0x0F & 0x01;
		s1_107 = s0_24 << 0x01 >> 0x0011;
		s0_63 = s0_24 >> 31;
	}
	else
	{
		uint32 a5_64;
		if (s0_24 == (struct Eq_479358 *) 0x01)
		{
			a5_64 = s0_24->ptr0074->dw000C;
			s1_107 = (word32) (word15) s0_24;
			s0_63 = s0_24 >> 0x0F & 0x01;
		}
		else
		{
			if (s0_24 != (struct Eq_479358 *) 0x02)
				goto l23084084;
			s1_107 = s0_24 << 0x01 >> 0x0011;
			s0_63 = s0_24 >> 31;
			a5_64 = s0_24->ptr0074->dw000C >> 1;
		}
		a5_72 = a5_64 & 0x01;
	}
	if (a5_72 != 0x00)
	{
		word32 s0_103;
		word32 a0_110;
		g_t4200CDC2();
		if (a0_110 == s0_103)
		{
			word32 s0_118;
			s4_109 = 0x05;
			s3_108 = 0x03;
			for (s0_118 = 0x00; s0_118 != 0x03; ++s0_118)
			{
				ui32 a0_127 = __lshrdi3(s1_107, 0x00, s0_118 + 0x05);
				ui32 a5_131 = a0_127 & 31;
				byte * a4_134 = s2_104 + s0_118;
				if ((a0_127 & 0x10) != 0x00)
					a5_131 = (a0_127 & 31) + ~0x1F;
				*a4_134 = (byte) a5_131;
			}
			a0_117 = 0x00;
l23084086:
			0x00 = dwArg0128;
			s1Out = s1_107;
			a0Out = a0_117;
			s2Out = s2_104;
			s3Out = s3_108;
			s4Out = s4_109;
			return ra_106;
		}
	}
l23084084:
	a0_117 = 0x01;
	goto l23084086;
}

// 230840AA: Register Eq_2 mfg_media_read_xtal_capcode(Register Eq_2 ra, Register (ptr32 Eq_369609) s0, Register Eq_2 s1, Register (ptr32 byte) a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_479606)) a4, Register int32 s2, Register (ptr32 Eq_369615) s3, Register ptr32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_369609) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_efuse_read_capcode
Eq_2 mfg_media_read_xtal_capcode(Eq_2 ra, struct Eq_369609 * s0, Eq_2 s1, byte * a0, word32 a1, Eq_2 a3, struct Eq_479606 ** a4, int32 s2, struct Eq_369615 * s3, ptr32 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_369609 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if ((word32) g_b4200F6FC == 0x00)
	{
		ptr32 a0_15;
		ptr32 a3_18;
		struct Eq_369609 * s0_24;
		ptr32 s1_25;
		ptr32 s10_26;
		ptr32 s11_27;
		ptr32 s2_28;
		ptr32 s3_29;
		ptr32 s4_30;
		ptr32 s5_31;
		ptr32 s6_32;
		ptr32 s7_33;
		ptr32 s8_34;
		Eq_2 ra_23 = mfg_efuse_read_xtal_capcode(ra, s0, s1, a0, a1, a3, s2, s3, s4, out s0_24, out s1_25, out a0_15, out a3_18, out s2_28, out s3_29, out s4_30, out s5_31, out s6_32, out s7_33, out s8_34, out s10_26, out s11_27);
		s0Out = s0_24;
		s1Out = s1_25;
		a0Out = a0_15;
		a3Out = a3_18;
		s2Out = s2_28;
		s3Out = s3_29;
		s4Out = s4_30;
		s5Out = s5_31;
		s6Out = s6_32;
		s7Out = s7_33;
		s8Out = s8_34;
		s10Out = s10_26;
		s11Out = s11_27;
		mstatusOut = mstatus;
		return ra_23;
	}
	else
	{
		ptr32 a0_41;
		ptr32 a3_44;
		ptr32 mstatus_48;
		ptr32 s1_50;
		ptr32 s10_51;
		ptr32 s11_52;
		ptr32 s2_53;
		ptr32 s3_54;
		ptr32 s4_55;
		ptr32 s5_56;
		ptr32 s6_57;
		ptr32 s7_58;
		ptr32 s8_59;
		Eq_2 ra_49 = mfg_flash_read_xtal_capcode(ra, a0, a1, a3, a4, mstatus, dwArg08, dwArg38, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_50, out a0_41, out a3_44, out s2_53, out s3_54, out s4_55, out s5_56, out s6_57, out s7_58, out s8_59, out s10_51, out s11_52, out mstatus_48);
		s0Out = s0;
		s1Out = s1_50;
		a0Out = a0_41;
		a3Out = a3_44;
		s2Out = s2_53;
		s3Out = s3_54;
		s4Out = s4_55;
		s5Out = s5_56;
		s6Out = s6_57;
		s7Out = s7_58;
		s8Out = s8_59;
		s10Out = s10_51;
		s11Out = s11_52;
		mstatusOut = mstatus_48;
		return ra_49;
	}
}

// 230840B8: Register Eq_2 mfg_media_read_poweroffset(Register Eq_2 ra, Register (ptr32 Eq_369708) s0, Register Eq_2 s1, Register ptr32 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_479606)) a4, Register (ptr32 byte) s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_369708) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_efuse_read_pwroft
Eq_2 mfg_media_read_poweroffset(Eq_2 ra, struct Eq_369708 * s0, Eq_2 s1, ptr32 a0, word32 a1, Eq_2 a3, struct Eq_479606 ** a4, byte * s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0128, struct Eq_369708 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if ((word32) g_b4200F6FC == 0x00)
	{
		ptr32 a0_14;
		ptr32 a3_17;
		struct Eq_369708 * s0_23;
		ptr32 s1_24;
		ptr32 s2_27;
		ptr32 s4_29;
		ptr32 s5_30;
		ptr32 s6_31;
		ptr32 s7_32;
		ptr32 s8_33;
		ptr32 s9_34;
		Eq_2 ra_22 = mfg_efuse_read_poweroffset(ra, s0, s1, a0, a1, s2, s3, s4, dwArg0128, out s0_23, out s1_24, out a0_14, out a3_17, out s2_27, out s4_29, out s5_30, out s6_31, out s7_32, out s8_33, out s9_34);
		s0Out = s0_23;
		s1Out = s1_24;
		a0Out = a0_14;
		a3Out = a3_17;
		s2Out = s2_27;
		s4Out = s4_29;
		s5Out = s5_30;
		s6Out = s6_31;
		s7Out = s7_32;
		s8Out = s8_33;
		s9Out = s9_34;
		mstatusOut = mstatus;
		return ra_22;
	}
	else
	{
		ptr32 a0_43;
		ptr32 a3_46;
		ptr32 mstatus_50;
		ptr32 s1_52;
		ptr32 s2_55;
		ptr32 s4_57;
		ptr32 s5_58;
		ptr32 s6_59;
		ptr32 s7_60;
		ptr32 s8_61;
		ptr32 s9_62;
		Eq_2 ra_51 = mfg_flash_read_poweroffset(ra, a0, a1, a3, a4, mstatus, dwArg08, dwArg38, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_52, out a0_43, out a3_46, out s2_55, out s4_57, out s5_58, out s6_59, out s7_60, out s8_61, out s9_62, out mstatus_50);
		s0Out = s0;
		s1Out = s1_52;
		a0Out = a0_43;
		a3Out = a3_46;
		s2Out = s2_55;
		s4Out = s4_57;
		s5Out = s5_58;
		s6Out = s6_59;
		s7Out = s7_60;
		s8Out = s8_61;
		s9Out = s9_62;
		mstatusOut = mstatus_50;
		return ra_51;
	}
}

