pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230840C6: Register Eq_2 mfg_media_read_macaddr(Register Eq_2 ra, Register (ptr32 Eq_122719) s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 word32) a4, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_122719) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_efuse_read_mac_factory
Eq_2 mfg_media_read_macaddr(Eq_2 ra, struct Eq_122719 * s0, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, word32 * a4, Eq_2 s2, word32 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, struct Eq_122719 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if ((word32) g_b4200F6FC == 0x00)
	{
		ptr32 a0_15;
		ptr32 a3_18;
		struct Eq_122719 * s0_24;
		ptr32 s1_25;
		ptr32 s10_26;
		ptr32 s11_27;
		ptr32 s2_28;
		ptr32 s3_29;
		ptr32 s4_30;
		ptr32 s5_31;
		ptr32 s6_32;
		ptr32 s7_33;
		Eq_2 ra_23 = mfg_efuse_read_macaddr(ra, s0, s1, a0, a1, a3, s2, s3, s4, out s0_24, out s1_25, out a0_15, out a3_18, out s2_28, out s3_29, out s4_30, out s5_31, out s6_32, out s7_33, out s10_26, out s11_27);
		s0Out = s0_24;
		s1Out = s1_25;
		a0Out = a0_15;
		a3Out = a3_18;
		s2Out = s2_28;
		s3Out = s3_29;
		s4Out = s4_30;
		s5Out = s5_31;
		s6Out = s6_32;
		s7Out = s7_33;
		s10Out = s10_26;
		s11Out = s11_27;
		mstatusOut = mstatus;
		return ra_23;
	}
	else
	{
		ptr32 a0_41;
		ptr32 s1_44;
		ptr32 a3_47;
		ptr32 mstatus_51;
		ptr32 s10_53;
		ptr32 s11_54;
		ptr32 s2_55;
		ptr32 s3_56;
		ptr32 s4_57;
		ptr32 s5_58;
		ptr32 s6_59;
		ptr32 s7_60;
		Eq_2 ra_52 = mfg_flash_read_macaddr(ra, a0, a1, a3, a4, mstatus, dwArg08, dwArg18, dwArg38, dwArg50, dwArg54, dwArg60, dwArg64, dwArg78, dwArg88, dwArg9C, dwArgAC, out s1_44, out a0_41, out a3_47, out s2_55, out s3_56, out s4_57, out s5_58, out s6_59, out s7_60, out s10_53, out s11_54, out mstatus_51);
		s0Out = s0;
		s1Out = s1_44;
		a0Out = a0_41;
		a3Out = a3_47;
		s2Out = s2_55;
		s3Out = s3_56;
		s4Out = s4_57;
		s5Out = s5_58;
		s6Out = s6_59;
		s7Out = s7_60;
		s10Out = s10_53;
		s11Out = s11_54;
		mstatusOut = mstatus_51;
		return ra_52;
	}
}

// 230840D4: void bflb_platform_usart_dbg_send(Register ptr32 a0, Register Eq_2 a1, Stack word32 dwArg34, Stack word32 dwArg0128)
// Called from:
//      Default_Handler
void bflb_platform_usart_dbg_send(ptr32 a0, Eq_2 a1, word32 dwArg34, word32 dwArg0128)
{
	UART_SendData(0x00, a0, a1, dwArg34, dwArg0128);
}

// 230840DE: void bflb_platform_printf(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Stack word32 dwArgE8)
// Called from:
//      Default_Handler
void bflb_platform_printf(Eq_2 ra, struct Eq_274 * a0, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, word32 dwArgE8)
{
	if ((word32) g_b4200F6FD == 0x00)
	{
		word32 s0_36;
		word32 t0_139;
		word32 s1_140;
		word32 a0_141;
		word32 a1_142;
		word32 a2_143;
		word32 a3_144;
		word32 a4_145;
		word32 a5_146;
		word32 a7_147;
		word32 s2_148;
		word32 s3_149;
		word32 s4_150;
		word32 s5_151;
		word32 s6_152;
		word32 s7_153;
		word32 s8_154;
		word32 s9_155;
		word32 s10_156;
		word32 s11_157;
		word32 t4_158;
		vsnprintf(ra, 0x4201C64C, 0x007F, a0, fp + -28, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out t0_139, out s0_36, out s1_140, out a0_141, out a1_142, out a2_143, out a3_144, out a4_145, out a5_146, out a7_147, out s2_148, out s3_149, out s4_150, out s5_151, out s6_152, out s7_153, out s8_154, out s9_155, out s10_156, out s11_157, out t4_158);
		word32 a1_159;
		word32 a2_160;
		word32 a3_161;
		word32 a4_162;
		word32 a5_163;
		bflb_platform_usart_dbg_send(s0_36 + 1612, strlen(s0_36 + 1612, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163), dwLoc0C, dwArgE8);
	}
}

// 2308412C: void SPI_IRQHandler(Register Eq_2 ra, Register Eq_2 t0, Register Eq_2 a5, Register Eq_2 t5, Stack Eq_2 dwArg3C, Stack (ptr32 Eq_479873) dwArg50, Stack word32 dwArg58)
void SPI_IRQHandler(Eq_2 ra, Eq_2 t0, Eq_2 a5, Eq_2 t5, Eq_2 dwArg3C, struct Eq_479873 * dwArg50, word32 dwArg58)
{
	Default_Handler(ra, a5, t0, dwLoc2C, dwLoc10, dwLoc0C, t5, dwArg3C, dwArg58);
	0x00 = (word32) dwArg50->t0368;
	0x00 = (word32) dwArg50->t01D8;
	__mret();
}

// 230841C8: Register Eq_2 mfg_efuse_read_xtal_capcode(Register Eq_2 ra, Register (ptr32 Eq_369609) s0, Register Eq_2 s1, Register (ptr32 byte) a0, Register word32 a1, Register Eq_2 a3, Register int32 s2, Register (ptr32 Eq_369615) s3, Register ptr32 s4, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mfg_media_read_xtal_capcode
Eq_2 mfg_efuse_read_xtal_capcode(Eq_2 ra, struct Eq_369609 * s0, Eq_2 s1, byte * a0, word32 a1, Eq_2 a3, int32 s2, struct Eq_369615 * s3, ptr32 s4, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a3_140;
	word32 s4_169;
	word32 s1_167;
	word32 s0_172;
	word32 s2_168;
	word32 s3_148;
	up32 s0_104;
	word32 s0_23;
	word32 s1_24;
	word32 s2_25;
	word32 a1_26;
	word32 s4_28;
	word32 a0_29;
	word32 a3_280;
	g_t4200CDF4();
	word32 s0_40;
	word32 s1_41;
	word32 a1_43;
	word32 s3_44;
	word32 s4_45;
	word32 a0_46;
	word32 a3_290;
	g_t4200CDFE();
	struct Eq_479915 * sp_56;
	word32 s1_59;
	Eq_2 ra_100;
	g_t4200CE44();
	byte * s0_101 = &g_b4200ECDC;
	if ((word32) g_b4200ECDC > 0x02)
	{
		word32 a0_77;
		ra_100 = EF_Ctrl_Is_CapCode_Slot_Empty(ra_100, &g_b4200ECDC, 0x02, s1_59, out s0_101, out a0_77);
		if (a0_77 == 0x00)
		{
			s0_104 = 0x02;
			goto l2308424E;
		}
	}
	if ((word32) *s0_101 > 0x01)
	{
		word32 a0_95;
		ra_100 = EF_Ctrl_Is_CapCode_Slot_Empty(ra_100, s0_101, 0x01, s1_59, out s0_101, out a0_95);
		if (a0_95 == 0x00)
		{
			s0_104 = 0x01;
			goto l2308424E;
		}
	}
	if ((word32) *s0_101 == 0x00)
	{
l23084224:
		word32 s11_370;
		word32 t4_371;
		word32 s6_365;
		word32 s8_367;
		word32 s9_368;
		word32 s10_369;
		word32 s7_366;
		word32 a2_360;
		word32 a5_362;
		word32 a7_363;
		word32 s5_364;
		word32 a4_361;
		word32 a0_358;
		word32 a1_359;
		printf(ra_100, &g_t230C61C4, a3, sp_56->t0008, sp_56->t0028, sp_56->t0070, sp_56->t0074, sp_56->t0098, sp_56->t00BC, out s1_167, out a0_358, out a1_359, out a2_360, out a3_140, out a4_361, out a5_362, out a7_363, out s2_168, out s3_148, out s4_169, out s5_364, out s6_365, out s7_366, out s8_367, out s9_368, out s10_369, out s11_370, out t4_371);
		s0_172 = 0x01;
		goto l23084268;
	}
	up32 a0_112;
	word32 s0_372;
	ra_100 = EF_Ctrl_Is_CapCode_Slot_Empty(ra_100, s0_101, 0x00, s1_59, out s0_372, out a0_112);
	s0_104 = a0_112;
	if (a0_112 != 0x00)
		goto l23084224;
l2308424E:
	byte * s1_144;
	ptr32 s2_147;
	word32 s4_149;
	word32 a0_160;
	word32 a0_373;
	word32 a1_374;
	word32 a2_375;
	word32 a4_376;
	word32 a5_377;
	word32 a7_378;
	word32 s5_379;
	word32 s6_380;
	word32 s7_381;
	word32 s8_382;
	word32 s9_383;
	word32 s10_384;
	word32 s11_385;
	word32 t4_386;
	s1_167 = EF_Ctrl_Read_CapCode_Opt(printf(ra_100, &g_t230C61B4, a3, sp_56->t0008, sp_56->t0028, sp_56->t0070, sp_56->t0074, sp_56->t0098, sp_56->t00BC, out s1_144, out a0_373, out a1_374, out a2_375, out a3_140, out a4_376, out a5_377, out a7_378, out s2_147, out s3_148, out s4_149, out s5_379, out s6_380, out s7_381, out s8_382, out s9_383, out s10_384, out s11_385, out t4_386), s0_104, s1_144, s0_104, s4_149, s1_144, s2_147, out a0_160, out s2_168, out s4_169);
	s0_172 = a0_160;
l23084268:
	word32 s0_214;
	word32 s1_215;
	word32 s2_216;
	word32 a1_217;
	word32 s3_218;
	word32 s4_219;
	word32 a3_227;
	g_t4200CDEA();
	Eq_2 ra_240;
	word32 s0_241;
	ptr32 s1_242;
	ptr32 s2_243;
	ptr32 s3_245;
	ptr32 a3_254;
	ptr32 s10_256;
	ptr32 s11_257;
	ptr32 s5_258;
	ptr32 s6_259;
	ptr32 s7_260;
	g_t4200CE44();
	s0Out = s1;
	s1Out = s1_242;
	a0Out = 0x00 - (word32) (s0_241 != 0x00);
	a3Out = a3_254;
	s2Out = s2_243;
	s3Out = s3_245;
	s4Out = dwArg04;
	s5Out = s5_258;
	s6Out = s6_259;
	s7Out = s7_260;
	s8Out = s4;
	s10Out = s10_256;
	s11Out = s11_257;
	return ra_240;
}

