pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308459C: Register Eq_2 mfg_flash_read_xtal_capcode(Register Eq_2 ra, Register (ptr32 byte) a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_479606)) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_xtal_capcode
Eq_2 mfg_flash_read_xtal_capcode(Eq_2 ra, byte * a0, word32 a1, Eq_2 a3, struct Eq_479606 ** a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, byte & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_108;
	byte * s1_127 = a0;
	if (a1 != 0x00)
	{
		word32 a0_17;
		ra = mfg_flash_read(ra, a3, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_127, out a0_17, out a3, out a4, out mstatus);
		if (a0_17 != 0x00)
		{
l230845BC:
			a0_108 = ~0x00;
			goto l230845BE;
		}
	}
	struct Eq_479606 * s0_44 = *a4;
	if (a4 == (struct Eq_479606 **) 65)
	{
		struct Eq_480860 * s0_57;
		ptr32 a0_59;
		word32 a7_67;
		word32 s9_76;
		word32 t0_77;
		word32 t3_78;
		word32 t4_79;
		g_t4200C9DE();
		if (s2 == a0_59 && (word32) s0_57->b0004 == 90)
		{
			*s1_127 = (byte) (word32) s0_57->b0005;
			a0_108 = 0x00;
l230845BE:
			0x00 = (int8) dwArg38;
			s1Out = s1_127;
			a0Out = a0_108;
			a3Out = a3;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
	}
	goto l230845BC;
}

// 23084600: Register Eq_2 mfg_flash_read_poweroffset(Register Eq_2 ra, Register ptr32 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_479606)) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_479606) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_poweroffset
Eq_2 mfg_flash_read_poweroffset(Eq_2 ra, ptr32 a0, word32 a1, Eq_2 a3, struct Eq_479606 ** a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_479606 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	struct Eq_479606 * s1_214;
	ptr32 a0_165;
	if (a1 != 0x00)
	{
		word32 a0_17;
		ra = mfg_flash_read(ra, a3, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_214, out a0_17, out a3, out a4, out mstatus);
		if (a0_17 != 0x00)
		{
l23084620:
			a0_165 = ~0x00;
			goto l23084622;
		}
	}
	s1_214 = (struct Eq_479606 *) *a4;
	if (a4 == (struct Eq_479606 **) 65)
	{
		Eq_2 s0_55;
		ptr32 a0_59;
		word32 a7_65;
		word32 t3_67;
		word32 t1_68;
		word32 a6_69;
		word32 s10_71;
		word32 s11_72;
		word32 s3_73;
		word32 t0_80;
		word32 t4_81;
		g_t4200C9DE();
		if (s2 == a0_59 && (word32) s1_214->b0006 == 90)
		{
			word32 t1_297;
			word32 a0_298;
			word32 a1_299;
			word32 a2_300;
			word32 a3_301;
			word32 a4_302;
			word32 a5_303;
			ra = memset(ra, s0_55, 0x00, 0x0E, out t1_297, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303);
			int32 a7_96 = (int32) s1_214->b0008;
			int32 a3_97 = (int32) s1_214->b0007;
			int32 a6_103 = (int32) s1_214->b0009;
			*s0_55 = (byte) a3_97;
			*((word32) s0_55 + 6) = (byte) a7_96;
			*((word32) s0_55 + 0x0C) = (byte) a6_103;
			ui32 a4_109 = a7_96 - a3_97 + 100 ^ 0x06;
			*((word32) s0_55 + 2) = (byte) ((a4_109 + 25 ^ 50) + (a3_97 & 0x00FF));
			*((word32) s0_55 + 3) = (byte) ((a4_109 + 0x35 ^ 100) + (a3_97 & 0x00FF));
			*((word32) s0_55 + 4) = (byte) (((a4_109 << 0x02) + 50 ^ 100) + (a3_97 & 0x00FF));
			*((word32) s0_55 + 1) = (byte) ((a4_109 + 50 ^ 100) + (a3_97 & 0x00FF));
			*((word32) s0_55 + 5) = (byte) ((a3_97 & 0x00FF) + (a4_109 + 55 ^ 100));
			ui32 a5_134 = a6_103 - a7_96 + 100 ^ 0x06;
			*((word32) s0_55 + 8) = (byte) ((a5_134 + 25 ^ 50) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 0x0A) = (byte) (((a5_134 << 0x02) + 50 ^ 100) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 7) = (byte) ((a5_134 + 50 ^ 100) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 9) = (byte) ((a5_134 + 0x35 ^ 100) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 11) = (byte) ((a5_134 + 55 ^ 100) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 0x0D) = (byte) ((a5_134 + 0x39 ^ 100) + (a7_96 & 0x00FF));
			a3.u0 = 0x07;
			a0_165 = 0x00;
l23084622:
			0x00 = (int8) dwArg38;
			s1Out = s1_214;
			a0Out = a0_165;
			a3Out = a3;
			s2Out = s2;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			mstatusOut = mstatus;
			return ra;
		}
	}
	goto l23084620;
}

// 23084764: Register Eq_2 mfg_flash_read_macaddr(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 word32) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_macaddr
Eq_2 mfg_flash_read_macaddr(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a3, word32 * a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_123;
	Eq_2 s1_110 = a0;
	if (a1 != 0x00)
	{
		word32 a0_17;
		ra = mfg_flash_read(ra, a3, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_110, out a0_17, out a3, out a4, out mstatus);
		if (a0_17 != 0x00)
		{
			word32 a2_279;
			word32 a4_280;
			word32 a5_281;
			word32 a7_282;
			word32 a1_278;
			word32 a0_277;
			word32 s8_283;
			word32 s9_284;
			word32 t4_285;
			ra = printf(ra, &g_t230C6204, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_110, out a0_277, out a1_278, out a2_279, out a3, out a4_280, out a5_281, out a7_282, out s2, out s3, out s4, out s5, out s6, out s7, out s8_283, out s9_284, out s10, out s11, out t4_285);
			goto l23084784;
		}
	}
	word32 s0_44 = *a4;
	if (a4 == (word32 *) 65)
	{
		struct Eq_481179 * s0_57;
		ptr32 a0_59;
		word32 a7_67;
		word32 s8_75;
		word32 s9_76;
		word32 t0_77;
		word32 t3_78;
		word32 t4_79;
		word32 a6_146;
		word32 t1_147;
		word32 t5_148;
		word32 t6_149;
		g_t4200C9DE();
		if (s2 == a0_59 && (word32) s0_57->b000A == 90)
		{
			word32 a1_286;
			word32 a2_287;
			word32 a4_288;
			word32 a5_289;
			word32 a6_290;
			word32 a7_291;
			memcpy(s1_110, &s0_57->b000A + 1, 0x06, out a1_286, out a2_287, out a3, out a4_288, out a5_289, out a6_290, out a7_291);
			a0_123 = 0x00;
l23084786:
			0x00 = (int8) dwArg38;
			s1Out = s1_110;
			a0Out = a0_123;
			a3Out = a3;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
	}
l23084784:
	a0_123 = ~0x00;
	goto l23084786;
}

