pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230847D6: void bt_hcionchip_recv(Register word32 a0, Register word32 a1)
void bt_hcionchip_recv(word32 a0, word32 a1)
{
	if ((word32) (word16) (a0 + ~0x00FFF800) > 0x05)
		return;
	g_t230C621C();
}

// 2308482E: Register Eq_2 bt_onchiphci_interface_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_onchiphci_interface_init
Eq_2 bt_onchiphci_interface_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	g_dw4200F708 = a0;
	ptr32 a0_12;
	ptr32 a3_15;
	ptr32 a4_16;
	ptr32 mstatus_18;
	ptr32 s1_21;
	word32 s0_30;
	Eq_2 ra_19 = ble_ke_task_create(ra, s0, s1, 0x04, 0x230C6234, out s0_30, out s1_21, out a0_12, out a3_15, out a4_16, out mstatus_18);
	s1Out = s1_21;
	a0Out = a0_12;
	a3Out = a3_15;
	a4Out = a4_16;
	mstatusOut = mstatus_18;
	return ra_19;
}

// 23084844: Register Eq_2 bt_onchiphci_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Stack word32 dwArgDC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_onchiphci_send_2_controller
Eq_2 bt_onchiphci_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s3, word32 dwArgDC, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a1Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	struct Eq_481246 * sp_113 = fp + -48;
	Eq_2 s0_15 = a2;
	if (a0 == 0x00)
	{
		word32 a5_445;
		Eq_2 a0_24 = hci_look_for_cmd_desc((word32) *a2, out a4, out a5_445);
		Eq_2 s3_19 = a1;
		s1 = (word32) *((word32) a2 + 8);
		Eq_2 s2_27 = a0_24;
		if (s1 != 0x00)
		{
			struct Eq_481307 * a0_28 = *((word32) a4 + 4);
			if (a4 != 0x00)
			{
				ui32 a0_41;
				ui32 a5_29 = (word32) a0_28->b0002;
				struct Eq_162491 * a3_31 = (word32) (word16) s1;
				if ((a5_29 & 64) == 0x00)
				{
					a1.u0 = 0x00;
					ra = hci_util_unpack(ra, null, 0x00, fp + -42, a3_31, a5_29 & 64, dwArgDC, out s0_15, out s1, out a0_41, out s2_27, out s3_19);
				}
				else
				{
					ui32 a0_40;
					a4();
					s0_15 = *((word32) a1 + 4);
					a0_41 = a0_40 & 0x00FF;
				}
				if (a0_41 == 0x01)
					goto l2308485C;
			}
		}
		struct Eq_162717 * a0_85;
		struct Eq_481314 * s2_97;
		word32 s3_459;
		word32 s4_460;
		word32 s8_461;
		word32 a3_456;
		word32 a6_457;
		word32 a7_458;
		word32 s0_454;
		word32 a2_455;
		ra = ble_ke_msg_alloc(ra, s0_15, s1, 0x00FFF805, s3_19, (word32) *s0_15, 0x00, s2_27, s3_19, dwArgF8, out s0_454, out s1, out a0_85, out a1, out a2_455, out a3_456, out a4, out a6_457, out a7_458, out s2_97, out s3_459, out s4_460, out s8_461, out mstatus);
		struct Eq_162717 * s3_104 = a0_85;
		if (a0_85 != null)
		{
			if (false)
			{
				a4 = s2_97->t0004;
				if (a4 != 0x00)
				{
					ui32 a5_107 = (word32) s2_97->b0002;
					struct Eq_162491 * a3_109 = (word32) (word16) s1;
					Eq_2 s0_111 = *((word32) a1 + 4);
					if ((a5_107 & 64) == 0x00)
					{
						word32 a0_464;
						word32 s1_463;
						word32 s0_462;
						word32 s2_465;
						ra = hci_util_unpack(ra, a0_85, a1, fp + -42, a3_109, a5_107 & 64, dwArgDC, out s0_462, out s1_463, out a0_464, out s2_465, out s3_104);
					}
					else
					{
						word32 a3_125;
						word32 a6_128;
						word32 s11_129;
						word32 s4_130;
						word32 s5_131;
						word32 s6_132;
						word32 s7_133;
						word32 s8_134;
						word32 s9_135;
						word32 t0_136;
						word32 a7_137;
						word32 t1_138;
						word32 t4_301;
						word32 t5_302;
						word32 t6_303;
						a4();
					}
				}
			}
			sp_113->b0008 = 0x01;
			sp_113->ptr0084 = s3_104;
l230848C8:
			word32 a0_468;
			s1 = rw_main_task_post(&sp_113->b0008, a4, mstatus, sp_113->t0014, sp_113->t0094, sp_113->t0108, sp_113->t0148, sp_113->t0188, out a0_468, out a1, out a4);
l2308485E:
			0x00 = (int8) dwArg0128;
			s1Out = s1;
			a1Out = a1;
			a4Out = a4;
			mstatusOut = mstatus;
			return ra;
		}
		goto l2308485C;
	}
	else
	{
		if (a0 != 0x01)
			goto l2308485C;
		Eq_2 a0_170;
		Eq_2 s0_180;
		word32 s2_182;
		word32 s8_453;
		word32 a2_447;
		word32 a7_450;
		word32 s3_451;
		word32 s4_452;
		word32 a3_448;
		word32 a6_449;
		word32 s1_446;
		ra = ble_ke_msg_alloc(ra, a2, s1, 0x00FFF807, a1, 0x00, 0x0C, a0, s3, dwArgF8, out s0_180, out s1_446, out a0_170, out a1, out a2_447, out a3_448, out a4, out a6_449, out a7_450, out s2_182, out s3_451, out s4_452, out s8_453, out mstatus);
		s1 = a0_170;
		if (a0_170 != 0x00)
		{
			Eq_2 s3_190 = __csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			struct Eq_481449 * a0_194;
			struct Eq_481450 * s0_199;
			word32 s8_467;
			word32 a5_466;
			ra = ble_co_list_pop_front(ra, s0_180, 0x420262D0, out s0_199, out a0_194, out a1, out a5_466, out s8_467);
			__csrrw(mstatus, 0x00);
			a0_194->t0008 = a0_170;
			if (a0_194 != null)
			{
				*a0_170 = (word16) (word32) s0_199->w0000;
				*((word32) a0_170 + 2) = (byte) (word32) s0_199->b0002;
				word32 a2_208 = (word32) s0_199->w0004;
				<anonymous> * a5_210 = g_ptr4200F3D0;
				*((word32) a0_170 + 4) = (word16) a2_208;
				struct Eq_162717 * s1_218;
				word32 s2_219;
				word32 a3_227;
				word32 a6_230;
				word32 s11_231;
				word32 s4_232;
				word32 s5_233;
				word32 s6_234;
				word32 s7_235;
				word32 s8_236;
				word32 s9_237;
				word32 t0_238;
				word32 a7_239;
				word32 t1_240;
				word32 t4_304;
				word32 t5_305;
				word32 t6_306;
				a5_210();
				sp_113->b0008 = (byte) s2_219;
				sp_113->ptr0084 = s1_218;
				goto l230848C8;
			}
		}
l2308485C:
		goto l2308485E;
	}
}

// 2308497C: void bt_onchiphci_hanlde_rx_acl(Register word32 ra, Register word32 a0, Register word32 a1, Stack word32 dwArg38)
void bt_onchiphci_hanlde_rx_acl(word32 ra, word32 a0, word32 a1, word32 dwArg38)
{
	struct Eq_481548 * a0_17 = hci_build_acl_rx_data(a0 + ~0x0B);
	<anonymous> * a5_23 = g_ptr4200F3D0;
	ui32 s0_25 = (word32) a0_17->b0002 + 0x04 & 0x00FF;
	struct Eq_481566 * s1_30;
	a5_23();
	em_buf_rx_free((word32) s1_30->b0006);
	0x00 = dwArg38;
}

// 230849C0: Register Eq_2 bl_mtd_open(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_331464 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      ota_tcp_cmd
//      ef_port_init
//      romfs_register
Eq_2 bl_mtd_open(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_331464 & s2Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_42;
	Eq_2 a0_27;
	word32 s8_720;
	word32 s4_719;
	word32 s3_718;
	word32 a6_717;
	word32 a5_716;
	word32 a4_715;
	word32 a2_714;
	word32 a1_713;
	Eq_2 s1_102;
	Eq_331464 s2_36;
	ptr32 a3_30;
	pvPortMalloc(ra, a0, 32, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_102, out a0_27, out a1_713, out a2_714, out a3_30, out a4_715, out a5_716, out a6_717, out s2_36, out s3_718, out s4_719, out s8_720);
	if (a0_27 != 0x00)
	{
		Eq_2 a3_108;
		struct Eq_481606 * a5_110;
		word32 a5_727;
		word32 a3_725;
		word32 a4_726;
		word32 a1_723;
		word32 a2_724;
		word32 a0_722;
		word32 t1_721;
		Eq_2 ra_52 = memset(ra, a0_27, 0x00, 32, out t1_721, out a0_722, out a1_723, out a2_724, out a3_725, out a4_726, out a5_727);
		word32 a2_728;
		word32 a4_730;
		word32 a3_729;
		word32 a5_731;
		strncpy(a0_27, s1_102, 0x10, out a2_728, out a3_729, out a4_730, out a5_731);
		if ((s2_36 & 1) != 0x00)
		{
			if ((s2_36 & 2) != 0x00)
			{
				word32 a0_244;
				Eq_2 a3_247;
				struct Eq_481654 * a5_249;
				s1_102 = hal_boot2_partition_bus_addr_inactive(s1_102, dwArgC8, out a0_244, out a3_247, out a5_249);
				if (a0_244 != 0x00 || a5_249 == null)
				{
					word32 s1_732;
					word32 a1_734;
					word32 a0_733;
					word32 a2_735;
					word32 a4_736;
					Eq_2 a3_537;
					word32 a5_737;
					word32 a7_738;
					word32 s2_739;
					word32 s3_740;
					word32 s4_741;
					word32 s5_742;
					word32 s6_743;
					word32 s7_744;
					word32 s8_745;
					word32 s9_746;
					word32 s10_747;
					word32 s11_748;
					word32 t4_749;
					word32 s1_750;
					word32 a0_751;
					word32 a1_752;
					word32 a2_753;
					word32 a3_754;
					word32 a4_755;
					word32 a5_756;
					word32 a7_757;
					word32 s2_758;
					word32 s3_759;
					word32 s4_760;
					word32 s5_761;
					word32 s6_762;
					word32 s7_763;
					word32 s8_764;
					word32 s9_765;
					word32 s10_766;
					word32 s11_767;
					word32 t4_768;
					printf(printf(ra_52, &g_t230C626C, a3_247, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_732, out a0_733, out a1_734, out a2_735, out a3_537, out a4_736, out a5_737, out a7_738, out s2_739, out s3_740, out s4_741, out s5_742, out s6_743, out s7_744, out s8_745, out s9_746, out s10_747, out s11_748, out t4_749), &g_t230C62A0, a3_537, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_750, out a0_751, out a1_752, out a2_753, out a3_754, out a4_755, out a5_756, out a7_757, out s2_758, out s3_759, out s4_760, out s5_761, out s6_762, out s7_763, out s8_764, out s9_765, out s10_766, out s11_767, out t4_768);
					while (true)
						;
				}
				a5_249->t001C = dwArgB4;
			}
			else
				*((word32) a0_27 + 28) = 0x00;
			if (hal_boot2_partition_addr_inactive(s1_102, dwArgC8, out a3_108, out a5_110) != 0x00 || a5_110 == null)
			{
				Eq_2 a3_482;
				word32 s1_769;
				word32 a0_770;
				word32 a1_771;
				word32 a2_772;
				word32 a4_773;
				word32 a5_774;
				word32 a7_775;
				word32 s2_776;
				word32 s3_777;
				word32 s4_778;
				word32 s5_779;
				word32 s6_780;
				word32 s7_781;
				word32 s8_782;
				word32 s9_783;
				word32 s10_784;
				word32 s11_785;
				word32 t4_786;
				word32 s1_787;
				word32 a0_788;
				word32 a1_789;
				word32 a2_790;
				word32 a3_791;
				word32 a4_792;
				word32 a5_793;
				word32 a7_794;
				word32 s2_795;
				word32 s3_796;
				word32 s4_797;
				word32 s5_798;
				word32 s6_799;
				word32 s7_800;
				word32 s8_801;
				word32 s9_802;
				word32 s10_803;
				word32 s11_804;
				word32 t4_805;
				printf(printf(ra_52, &g_t230C626C, a3_108, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_769, out a0_770, out a1_771, out a2_772, out a3_482, out a4_773, out a5_774, out a7_775, out s2_776, out s3_777, out s4_778, out s5_779, out s6_780, out s7_781, out s8_782, out s9_783, out s10_784, out s11_785, out t4_786), &g_t230C62A0, a3_482, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_787, out a0_788, out a1_789, out a2_790, out a3_791, out a4_792, out a5_793, out a7_794, out s2_795, out s3_796, out s4_797, out s5_798, out s6_799, out s7_800, out s8_801, out s9_802, out s10_803, out s11_804, out t4_805);
				while (true)
					;
			}
		}
		else
		{
			if ((s2_36 & 2) != 0x00)
			{
				word32 a0_73;
				Eq_2 a3_76;
				struct Eq_482103 * a5_78;
				word32 s2_905;
				word32 s3_906;
				word32 s6_907;
				hal_boot2_partition_bus_addr_active(s1_102, dwArgC8, out s1_102, out a0_73, out a3_76, out a5_78, out s2_905, out s3_906, out s6_907);
				if (a0_73 != 0x00 || a5_78 == null)
				{
					Eq_2 a3_198;
					word32 s1_908;
					word32 a0_909;
					word32 a1_910;
					word32 a2_911;
					word32 a4_912;
					word32 a5_913;
					word32 a7_914;
					word32 s2_915;
					word32 s3_916;
					word32 s4_917;
					word32 s5_918;
					word32 s6_919;
					word32 s7_920;
					word32 s8_921;
					word32 s9_922;
					word32 s10_923;
					word32 s11_924;
					word32 t4_925;
					word32 s1_926;
					word32 a0_927;
					word32 a1_928;
					word32 a2_929;
					word32 a3_930;
					word32 a4_931;
					word32 a5_932;
					word32 a7_933;
					word32 s2_934;
					word32 s3_935;
					word32 s4_936;
					word32 s5_937;
					word32 s6_938;
					word32 s7_939;
					word32 s8_940;
					word32 s9_941;
					word32 s10_942;
					word32 s11_943;
					word32 t4_944;
					printf(printf(ra_52, &g_t230C626C, a3_76, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_908, out a0_909, out a1_910, out a2_911, out a3_198, out a4_912, out a5_913, out a7_914, out s2_915, out s3_916, out s4_917, out s5_918, out s6_919, out s7_920, out s8_921, out s9_922, out s10_923, out s11_924, out t4_925), &g_t230C62A0, a3_198, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_926, out a0_927, out a1_928, out a2_929, out a3_930, out a4_931, out a5_932, out a7_933, out s2_934, out s3_935, out s4_936, out s5_937, out s6_938, out s7_939, out s8_940, out s9_941, out s10_942, out s11_943, out t4_944);
					while (true)
						;
				}
				a5_78->t001C = dwArgB4;
			}
			else
				*((word32) a0_27 + 28) = 0x00;
			word32 a0_105;
			word32 s1_945;
			word32 s2_946;
			hal_boot2_partition_addr_active(s1_102, dwArgC8, out s1_945, out a0_105, out a3_108, out a5_110, out s2_946);
			if (a0_105 != 0x00 || a5_110 == null)
			{
				Eq_2 a3_143;
				word32 s1_947;
				word32 a0_948;
				word32 a1_949;
				word32 a2_950;
				word32 a4_951;
				word32 a5_952;
				word32 a7_953;
				word32 s2_954;
				word32 s3_955;
				word32 s4_956;
				word32 s5_957;
				word32 s6_958;
				word32 s7_959;
				word32 s8_960;
				word32 s9_961;
				word32 s10_962;
				word32 s11_963;
				word32 t4_964;
				word32 s1_965;
				word32 a0_966;
				word32 a1_967;
				word32 a2_968;
				word32 a3_969;
				word32 a4_970;
				word32 a5_971;
				word32 a7_972;
				word32 s2_973;
				word32 s3_974;
				word32 s4_975;
				word32 s5_976;
				word32 s6_977;
				word32 s7_978;
				word32 s8_979;
				word32 s9_980;
				word32 s10_981;
				word32 s11_982;
				word32 t4_983;
				printf(printf(ra_52, &g_t230C626C, a3_108, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_947, out a0_948, out a1_949, out a2_950, out a3_143, out a4_951, out a5_952, out a7_953, out s2_954, out s3_955, out s4_956, out s5_957, out s6_958, out s7_959, out s8_960, out s9_961, out s10_962, out s11_963, out t4_964), &g_t230C62A0, a3_143, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_965, out a0_966, out a1_967, out a2_968, out a3_969, out a4_970, out a5_971, out a7_972, out s2_973, out s3_974, out s4_975, out s5_976, out s6_977, out s7_978, out s8_979, out s9_980, out s10_981, out s11_982, out t4_983);
				while (true)
					;
			}
		}
		a5_110->t0014 = dwArgB4;
		a5_110->t0018 = dwArgB4;
		word32 a0_806;
		word32 a1_807;
		word32 a2_808;
		word32 a4_809;
		word32 a5_810;
		word32 s4_811;
		word32 s8_812;
		puts(588014308, out a0_806, out a1_807, out a2_808, out a4_809, out a5_810, out s4_811, out s8_812);
		Eq_2 a3_329;
		Eq_2 a3_354;
		Eq_2 a3_380;
		struct Eq_481866 * a1_404;
		Eq_2 a3_406;
		word32 s1_813;
		word32 a0_814;
		word32 a1_815;
		word32 a2_816;
		word32 a4_817;
		word32 a5_818;
		word32 a7_819;
		word32 s2_820;
		word32 s3_821;
		word32 s4_822;
		word32 s5_823;
		word32 s6_824;
		word32 s7_825;
		word32 s8_826;
		word32 s9_827;
		word32 s10_828;
		word32 s11_829;
		word32 t4_830;
		word32 s1_831;
		word32 a0_832;
		word32 a1_833;
		word32 a2_834;
		word32 a4_835;
		word32 a5_836;
		word32 a7_837;
		word32 s2_838;
		word32 s3_839;
		word32 s4_840;
		word32 s5_841;
		word32 s6_842;
		word32 s7_843;
		word32 s8_844;
		word32 s9_845;
		word32 s10_846;
		word32 s11_847;
		word32 t4_848;
		word32 s1_849;
		word32 a0_850;
		word32 a1_851;
		word32 a2_852;
		word32 a4_853;
		word32 a5_854;
		word32 a7_855;
		word32 s2_856;
		word32 s3_857;
		word32 s4_858;
		word32 s5_859;
		word32 s6_860;
		word32 s7_861;
		word32 s8_862;
		word32 s9_863;
		word32 s10_864;
		word32 s11_865;
		word32 t4_866;
		word32 s1_867;
		word32 a0_868;
		word32 a2_869;
		word32 a4_870;
		word32 a5_871;
		word32 a7_872;
		word32 s2_873;
		word32 s3_874;
		word32 s4_875;
		word32 s5_876;
		word32 s6_877;
		word32 s7_878;
		word32 s8_879;
		word32 s9_880;
		word32 s10_881;
		word32 s11_882;
		word32 t4_883;
		Eq_2 ra_409 = printf(printf(printf(printf(ra_52, &g_t230C630C, a3_108, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_813, out a0_814, out a1_815, out a2_816, out a3_329, out a4_817, out a5_818, out a7_819, out s2_820, out s3_821, out s4_822, out s5_823, out s6_824, out s7_825, out s8_826, out s9_827, out s10_828, out s11_829, out t4_830), &g_t230C631C, a3_329, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_831, out a0_832, out a1_833, out a2_834, out a3_354, out a4_835, out a5_836, out a7_837, out s2_838, out s3_839, out s4_840, out s5_841, out s6_842, out s7_843, out s8_844, out s9_845, out s10_846, out s11_847, out t4_848), &g_t230C632C, a3_354, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_849, out a0_850, out a1_851, out a2_852, out a3_380, out a4_853, out a5_854, out a7_855, out s2_856, out s3_857, out s4_858, out s5_859, out s6_860, out s7_861, out s8_862, out s9_863, out s10_864, out s11_865, out t4_866), &g_t230C6344, a3_380, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_867, out a0_868, out a1_404, out a2_869, out a3_406, out a4_870, out a5_871, out a7_872, out s2_873, out s3_874, out s4_875, out s5_876, out s6_877, out s7_878, out s8_879, out s9_880, out s10_881, out s11_882, out t4_883);
		word32 s0_423 = a1_404->dw001C;
		word32 * s3_439;
		word32 s1_884;
		word32 a0_885;
		word32 a1_886;
		word32 a2_887;
		word32 a4_888;
		word32 a5_889;
		word32 a7_890;
		word32 s4_891;
		word32 s7_892;
		word32 s8_893;
		word32 s9_894;
		word32 s10_895;
		word32 s11_896;
		word32 t4_897;
		ra = printf(ra_409, &g_t230C6360, a3_406, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_884, out a0_885, out a1_886, out a2_887, out a3_30, out a4_888, out a5_889, out a7_890, out s2_36, out s3_439, out s4_891, out s5, out s6, out s7_892, out s8_893, out s9_894, out s10_895, out s11_896, out t4_897);
		word32 a0_898;
		word32 a1_899;
		word32 a2_900;
		word32 a4_901;
		word32 a5_902;
		word32 s4_903;
		word32 s8_904;
		puts(588014452, out a0_898, out a1_899, out a2_900, out a4_901, out a5_902, out s4_903, out s8_904);
		*s3_439 = s0_423;
		a0_42 = 0x00;
	}
	else
		a0_42 = ~0x00;
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	a0Out = a0_42;
	a3Out = a3_30;
	s2Out = s2_36;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 23084B5A: void bl_mtd_close(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      ota_tcp_cmd
void bl_mtd_close(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	word32 s0_29;
	word32 s1_30;
	word32 a0_31;
	word32 a1_32;
	word32 a2_33;
	word32 a3_34;
	word32 a4_35;
	word32 a5_36;
	word32 a6_37;
	word32 s4_38;
	word32 t3_39;
	vPortFree(a0, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_29, out s1_30, out a0_31, out a1_32, out a2_33, out a3_34, out a4_35, out a5_36, out a6_37, out s4_38, out t3_39);
}

// 23084B6A: Register word32 bl_mtd_info(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      ef_port_init
//      romfs_register
word32 bl_mtd_info(Eq_2 a0, Eq_2 a1)
{
	struct Eq_482326 * a5_18;
	word32 a4_35;
	strcpy(a1, a0, out a4_35, out a5_18);
	a5_18->t0010 = a1;
	a5_18->t0014 = a1;
	word32 s1_25 = a5_18->dw001C;
	a5_18->t0018 = a1;
	return s1_25;
}

// 23084B96: Register Eq_2 bl_mtd_erase(Register Eq_2 ra, Register (ptr32 Eq_354519) a0, Register Eq_332972 a1, Register Eq_2 a2, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out)
// Called from:
//      ef_port_erase
Eq_2 bl_mtd_erase(Eq_2 ra, struct Eq_354519 * a0, Eq_332972 a1, Eq_2 a2, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a4Out)
{
	ptr32 a4_13;
	ptr32 a1_15;
	word32 a0_26;
	Eq_2 ra_17 = bl_flash_erase(ra, (word32) a1 + a0->dw0014, a2, out a0_26, out a1_15, out a4_13);
	a0Out = 0x00;
	a1Out = a1_15;
	a4Out = a4_13;
	return ra_17;
}

