pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23084BAC: void bl_mtd_erase_all(Register Eq_2 ra, Register Eq_2 a1)
// Called from:
//      ota_tcp_cmd
void bl_mtd_erase_all(Eq_2 ra, Eq_2 a1)
{
	word32 a0_20;
	word32 a1_21;
	word32 a4_22;
	bl_flash_erase(ra, *((word32) *((word32) a1 + 24) + 20), a1, out a0_20, out a1_21, out a4_22);
}

// 23084BC0: Register Eq_2 bl_mtd_write(Register Eq_2 ra, Register Eq_2 s1, Register Eq_332972 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_333069 s4Out, Register out Eq_333069 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      ota_tcp_cmd
//      write_status
Eq_2 bl_mtd_write(Eq_2 ra, Eq_2 s1, Eq_332972 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_333069 & s4Out, union Eq_333069 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	ptr32 a1_116;
	ptr32 a5_115;
	ptr32 a4_114;
	Eq_2 ra_112;
	Eq_333069 s4_207;
	Eq_2 s0_123 = a2;
	Eq_2 s2_121 = a3;
	word32 s1_23 = s1 + a1;
	if (bl_sys_isxipaddr(a3) != 0x00)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_253;
			xTaskGetTickCountFromISR(out a5_253);
		}
		else
		{
			word32 a5_252;
			xTaskGetTickCount(out a5_252);
		}
		word32 a0_262;
		word32 a2_263;
		word32 a3_264;
		word32 s4_265;
		word32 s5_266;
		word32 s8_267;
		word32 s9_268;
		word32 s10_269;
		word32 s11_270;
		word32 s1_107;
		ra_112 = bl_printk(ra, &g_t230C63A8, 0x230C639C, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_107, out a0_262, out a1_116, out a2_263, out a3_264, out a4_114, out a5_115, out s2_121, out s3, out s4_265, out s5_266, out s6, out s7, out s8_267, out s9_268, out s10_269, out s11_270);
		s4_207.u0 = 64;
		for (; s0_123 != 0x00; s0_123 -= s3)
		{
			s3 = s0_123;
			if (s0_123 > 64)
				s3.u0 = 64;
			word32 a1_254;
			word32 a2_255;
			word32 a3_256;
			word32 a4_257;
			word32 a5_258;
			word32 a6_259;
			word32 a7_260;
			memcpy(fp + -96, s2_121, s3, out a1_254, out a2_255, out a3_256, out a4_257, out a5_258, out a6_259, out a7_260);
			word32 a0_261;
			ra_112 = bl_flash_write(ra_112, s1_107, fp + -96, s3, out a0_261, out a1_116, out a4_114, out a5_115);
			s1_107 = (word32) s3 + s1_107;
			s2_121 += s3;
		}
	}
	else
	{
		word32 a0_251;
		ra_112 = bl_flash_write(ra, s1_23, a3, a2, out a0_251, out a1_116, out a4_114, out a5_115);
		s4_207 = s4;
	}
	s0Out = s0_123;
	s1Out = dwArg28;
	a0Out = 0x00;
	a1Out = a1_116;
	a3Out = dwArg08;
	a4Out = a4_114;
	a5Out = a5_115;
	s2Out = s2_121;
	s3Out = s3;
	s4Out = s4_207;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	return ra_112;
}

// 23084C64: Register Eq_2 bl_mtd_read(Register Eq_2 ra, Register (ptr32 Eq_354519) a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 a3, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      ef_port_read
Eq_2 bl_mtd_read(Eq_2 ra, struct Eq_354519 * a0, Eq_2 a1, Eq_2 a2, ptr32 a3, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a4_14;
	ptr32 a1_16;
	ptr32 a3_18;
	Eq_2 ra_19 = bl_flash_read(ra, (word32) a1 + a0->dw0014, a3, a2, out a1_16, out a3_18, out a4_14);
	a0Out = 0x00;
	a1Out = a1_16;
	a3Out = a3_18;
	a4Out = a4_14;
	return ra_19;
}

// 23084C7A: Register Eq_2 bloop_init(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out ptr32 s3Out)
// Called from:
//      looprt_start
//      cmd_looprt_test
Eq_2 bloop_init(Eq_2 ra, Eq_2 a0, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, ptr32 & s3Out)
{
	struct Eq_96932 * s1_16 = (word32) a0 + 272;
	Eq_2 a3_20;
	word32 a5_102;
	word32 a4_101;
	word32 a2_100;
	word32 a1_99;
	word32 a0_98;
	word32 t1_97;
	Eq_2 ra_23 = memset(ra, a0, 0x00, 1184, out t1_97, out a0_98, out a1_99, out a2_100, out a3_20, out a4_101, out a5_102);
	do
	{
		utils_list_init(s1_16);
		s1_16 = &s1_16->dw0004 + 1;
	} while (s1_16 != (word32) a0 + 528);
	*((word32) a0 + 0x0494) = (word32) a0 + 1168;
	*((word32) a0 + 1168) = (word32) a0 + 1168;
	*((word32) a0 + 1180) = (word32) a0 + 1176;
	*((word32) a0 + 1176) = (word32) a0 + 1176;
	word32 a1_104;
	ptr32 s1_53;
	ptr32 s3_57;
	word32 a0_103;
	word32 a2_105;
	word32 a3_106;
	word32 a4_107;
	word32 a5_108;
	word32 a7_109;
	word32 s2_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	word32 s9_116;
	word32 s10_117;
	word32 s11_118;
	word32 t4_119;
	Eq_2 ra_52 = printf(ra_23, &g_t230C63EC, a3_20, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_53, out a0_103, out a1_104, out a2_105, out a3_106, out a4_107, out a5_108, out a7_109, out s2_110, out s3_57, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115, out s9_116, out s10_117, out s11_118, out t4_119);
	0x00 = (int8) dwArg38;
	s1Out = s1_53;
	s3Out = s3_57;
	return ra_52;
}

// 23084CDA: Register int32 bloop_handler_register(Register word32 a0, Register int32 a1, Register uint32 a2)
// Called from:
//      looprt_start
//      cmd_looprt_test
//      loopset_led_hook_on_looprt
int32 bloop_handler_register(word32 a0, int32 a1, uint32 a2)
{
	int32 a5_10 = 0x1F;
	if (a2 > 0x1F)
		return a5_10;
	struct Eq_482592 * a2_8 = (a2 << 2) + a0;
	a5_10 = a2_8->dw0410;
	if (a5_10 != 0x00)
		return a5_10;
	a2_8->dw0410 = a1;
	return a5_10;
}

// 23084CF8: Register word32 bloop_timer_init(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1)
// Called from:
//      cmd_looprt_test_schedule_evt2
//      loopset_led_trigger
word32 bloop_timer_init(Eq_2 ra, Eq_2 a0, word32 a1)
{
	word32 t1_39;
	word32 a0_40;
	word32 a1_41;
	word32 a2_42;
	word32 a3_43;
	word32 a4_44;
	word32 a5_45;
	memset(ra, a0, 0x00, 36, out t1_39, out a0_40, out a1_41, out a2_42, out a3_43, out a4_44, out a5_45);
	*a0 = a0;
	*((word32) a0 + 4) = a0;
	*((word32) a0 + 8) = (byte) ((word32) (a1 != 0x00) << 1);
	return a1;
}

// 23084D26: Register word32 bloop_timer_configure(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 Eq_382441) a4, Stack Eq_2 dwArgB4)
// Called from:
//      cmd_looprt_test_schedule_evt2
//      loopset_led_trigger
word32 bloop_timer_configure(Eq_2 a0, Eq_2 a1, Eq_2 a3, struct Eq_382441 * a4, Eq_2 dwArgB4)
{
	struct Eq_482639 * a5_21;
	Eq_2 a0_20 = xTaskGetTickCount(out a5_21);
	*((word32) a0_20 + 0x0C) = a0;
	Mem29[a0_20 + a1 + 16:word32] = a0;
	*((word32) dwArgB4 + 28) = a0;
	*((word32) a3 + 32) = a0;
	a4->t0014 = a0;
	a5_21->t0018 = a0;
	return dwArgE4;
}

// 23084D5C: void bloop_timer_repeat_enable(Register Eq_2 a0)
// Called from:
//      loopset_led_trigger
void bloop_timer_repeat_enable(Eq_2 a0)
{
	*((word32) a0 + 8) = (byte) ((word32) *((word32) a0 + 8) | 1);
}

