pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23084D6A: Register Eq_2 bloop_timer_repeat_reconfigure(Register Eq_2 s0, Register Eq_2 a0)
// Called from:
//      bloop_run
Eq_2 bloop_timer_repeat_reconfigure(Eq_2 s0, Eq_2 a0)
{
	ptr32 s0_14 = s0 - *((word32) (*((word32) s0 + 16)) + 0x0C);
	word32 a5_29;
	Eq_2 a0_15 = xTaskGetTickCount(out a5_29);
	(word32) a0_15 + s0_14 + 16 = (word32) a0;
	*((word32) a0_15 + 0x0C) = a0;
	return a0;
}

// 23084D8E: Register Eq_2 bloop_timer_register(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      looprt_timer_register
//      cmd_looprt_test_schedule_evt2
//      bloop_run
Eq_2 bloop_timer_register(Eq_2 a0, Eq_2 a1, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a2_5 = *((word32) a0 + 0x0494);
	if ((word32) a0 + 1168 != a2_5)
	{
		Eq_2 a4_10 = a2_5;
		Eq_2 a5_16 = 0x00;
		while ((word32) a0 + 1168 != a4_10)
		{
			if (*((word32) a1 + 16) - *((word32) a4_10 + 16) <= 0x00)
			{
				if (a5_16 != 0x00)
					break;
				*((word32) a2_5 + 4) = a1;
				*((word32) a0 + 1168) = a1;
				*((word32) a0 + 0x0494) = a1;
				*a1 = a2_5;
				a3Out.u0 = <invalid>;
				a4Out = a4_10;
				a5Out = a5_16;
				return <invalid>;
			}
			a5_16 = a4_10;
			a4_10 = *((word32) a4_10 + 4);
		}
		Eq_2 a5_27 = *((word32) a4_10 + 4);
		*a5_27 = a1;
		*((word32) a4_10 + 4) = a1;
		*((word32) a1 + 4) = a5_27;
		*a1 = a4_10;
		a3Out.u0 = <invalid>;
		a4Out = a4_10;
		a5Out = a5_27;
		return <invalid>;
	}
	else
	{
		*((word32) a0 + 0x0494) = a1;
		*((word32) a0 + 1168) = a1;
		*((word32) a0 + 0x0494) = a1;
		*((word32) a0 + 1168) = a1;
		a3Out.u0 = <invalid>;
		a4Out = a4;
		a5Out = a5;
		return <invalid>;
	}
}

// 23084DE0: Register word32 bloop_wait_startup(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      looprt_start
//      cmd_looprt_test
word32 bloop_wait_startup(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	while (a5 == 0x00)
	{
		word32 a0_77;
		word32 a1_78;
		word32 s4_79;
		vTaskDelay(0x01, a2, a3, a4, a5, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1, out a0_77, out a1_78, out a2, out a3, out a4, out a5, out s2, out s3, out s4_79);
	}
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	return s1;
}

// 23084DFC: Register Eq_2 bloop_evt_set_async(Register Eq_2 ra, Register Eq_2 a0, Register up32 a1, Register ui32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 mstatusOut)
// Called from:
//      loopset_led_trigger
Eq_2 bloop_evt_set_async(Eq_2 ra, Eq_2 a0, up32 a1, ui32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & mstatusOut)
{
	if (a1 <= 0x1F)
	{
		struct Eq_482787 * a5_17;
		vTaskEnterCritical(a4, mstatus, out a5_17);
		Eq_2 a3_22 = 0x01 << a1;
		(a3_22 | 0x01)->t0004 = *(union Eq_2 *) 0x05;
		(a5_17 | a2)->dw0010 = a5_17->dw0010;
		Eq_2 a4_32;
		word32 a5_105;
		vTaskExitCritical(a3_22, mstatus, out a4_32, out a5_105);
		ptr32 s1_46;
		ptr32 mstatus_54;
		word32 s0_125;
		word32 a0_126;
		word32 a1_127;
		word32 a2_128;
		word32 a3_129;
		word32 a4_130;
		word32 a5_131;
		word32 s2_132;
		word32 s3_133;
		word32 s4_134;
		Eq_2 ra_55 = xTaskGenericNotify(ra, a0, 0x00, 0x02, 0x00, a4_32, mstatus, dwArg14, dwArg38, dwArg58, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_125, out s1_46, out a0_126, out a1_127, out a2_128, out a3_129, out a4_130, out a5_131, out s2_132, out s3_133, out s4_134, out mstatus_54);
		s1Out = s1_46;
		mstatusOut = mstatus_54;
		return ra_55;
	}
	else
	{
		word32 s1_106;
		word32 a0_107;
		word32 a1_108;
		word32 a2_109;
		word32 a3_110;
		word32 a4_111;
		word32 a5_112;
		word32 a7_113;
		word32 s2_114;
		word32 s3_115;
		word32 s4_116;
		word32 s5_117;
		word32 s6_118;
		word32 s7_119;
		word32 s8_120;
		word32 s9_121;
		word32 s10_122;
		word32 s11_123;
		word32 t4_124;
		printf(ra, &g_t230C3498, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_106, out a0_107, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a7_113, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7_119, out s8_120, out s9_121, out s10_122, out s11_123, out t4_124);
		while (true)
			;
	}
}

// 23084E5C: Register Eq_393154 bloop_evt_set_sync(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_482896) a1Out, Register out Eq_482897 a3Out, Register out (ptr32 Eq_2) a4Out, Register out Eq_482899 a5Out)
// Called from:
//      bloop_run
Eq_393154 bloop_evt_set_sync(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, struct Eq_482896 & a1Out, union Eq_482897 & a3Out, union Eq_2 & a4Out, union Eq_482899 & a5Out)
{
	if (a1 <= 0x1F)
	{
		Eq_482897 a3_6 = 0x01 << a1;
		(a3_6 | 0x01)->t0008 = *(union Eq_2 *) 0x09;
		Eq_393154 a0_12 = *(union Eq_393154 *) 0x2F;
		(a2 | 0x1F)->t0010 = a0_12;
		a1Out = a1 << 2;
		a3Out = a3_6;
		a4Out = a3_6 | 0x01;
		a5Out = a2 | 0x1F;
		return a0_12;
	}
	else
	{
		word32 s1_58;
		word32 a0_59;
		word32 a1_60;
		word32 a2_61;
		word32 a3_62;
		word32 a4_63;
		word32 a5_64;
		word32 a7_65;
		word32 s2_66;
		word32 s3_67;
		word32 s4_68;
		word32 s5_69;
		word32 s6_70;
		word32 s7_71;
		word32 s8_72;
		word32 s9_73;
		word32 s10_74;
		word32 s11_75;
		word32 t4_76;
		printf(ra, &g_t230C3498, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_58, out a0_59, out a1_60, out a2_61, out a3_62, out a4_63, out a5_64, out a7_65, out s2_66, out s3_67, out s4_68, out s5_69, out s6_70, out s7_71, out s8_72, out s9_73, out s10_74, out s11_75, out t4_76);
		while (true)
			;
	}
}

// 23084E98: Register word32 bloop_evt_unset_sync(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      bloop_run
word32 bloop_evt_unset_sync(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if (a1 <= 0x1F)
	{
		word32 a0_8 = *((word32) a1 + 8);
		(~(0x01 << a1) & a1)->dw0008 = a0_8;
		return a0_8;
	}
	else
	{
		word32 s1_50;
		word32 a0_51;
		word32 a1_52;
		word32 a2_53;
		word32 a3_54;
		word32 a4_55;
		word32 a5_56;
		word32 a7_57;
		word32 s2_58;
		word32 s3_59;
		word32 s4_60;
		word32 s5_61;
		word32 s6_62;
		word32 s7_63;
		word32 s8_64;
		word32 s9_65;
		word32 s10_66;
		word32 s11_67;
		word32 t4_68;
		printf(ra, &g_t230C3498, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_50, out a0_51, out a1_52, out a2_53, out a3_54, out a4_55, out a5_56, out a7_57, out s2_58, out s3_59, out s4_60, out s5_61, out s6_62, out s7_63, out s8_64, out s9_65, out s10_66, out s11_67, out t4_68);
		while (true)
			;
	}
}

