pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23084ECE: void bloop_run(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack word32 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
// Called from:
//      proc_entry_looprt
void bloop_run(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg6C, word32 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 a5_1000;
	Eq_2 a0_101 = xTaskGetCurrentTaskHandle(out a5_1000);
	*a0_101 = a0;
	word32 s0_15 = a0;
	struct Eq_483039 * s2_150 = &g_t42028000;
	struct Eq_483041 * s3_153 = &g_t42028000;
	struct Eq_483043 * s4_155 = &g_t4200F000;
	word32 s5_165 = 0x230C6000;
	do
	{
		Eq_2 s7_40 = s0_15 + 1168;
		while (true)
		{
			ui32 a5_43;
			Eq_2 a4_44 = vTaskEnterCritical(a4, mstatus, out a5_43);
			struct Eq_483080 * s0_47 = *((word32) a4_44 + 4);
			s0_47->dw0004 = 0x00;
			(a5_43 | a4_44)->ptr0008 = s0_47;
			struct Eq_483092 * a5_52;
			Eq_2 a4_104;
			a3 = vTaskExitCritical(a3, mstatus, out a4_104, out a5_52);
			Eq_2 s0_203 = a5_52->t0008;
			if (a5_52 != null)
				break;
			Eq_2 a5_487 = *((word32) s0_203 + 0x0494);
			a1.u0 = ~0x00;
			if (a5_487 != s7_40)
			{
				a0_101 = xTaskGetTickCount(out a5_487);
				a1 = s1 - a0_101;
				if (a1 <= 0x00)
					break;
			}
			a0_101.u0 = 0x01;
			s1 = ulTaskNotifyTake((struct Eq_6434 *) 0x01, a1, a2, a3, a4_104, a5_487, mstatus, s6, dwArgD8, out a2, out a3, out a4, out s2_150, out s3_153);
		}
		if (*((word32) s0_203 + 0x0494) != s7_40)
		{
			Eq_2 a5_121;
			Eq_2 a0_68 = xTaskGetTickCount(out a5_121);
			Eq_2 s1_126 = *((word32) s0_203 + 0x0494);
			Eq_2 s6_123 = 0x00;
			if (s1_126 != 0x00)
				s6_123 = *((word32) s1_126 + 4);
			Eq_2 s8_139 = (word32) s0_203 + 1176;
			a0_101 = a0_68;
			while (s1_126 != s7_40)
			{
				a5_121 = a0_68 - a5_121;
				if (a5_121 < 0x00)
					break;
				Eq_2 a5_105;
				a0_101 = bloop_evt_set_sync(ra, a1, a2, a3, s6, dwArg10, dwArg14, dwArg38, dwArg5C, out a1, out a3, out a4_104, out a5_105);
				if (a5_105 != 0x00)
					a5_105();
				Eq_2 s1_110 = *a4_104;
				*((word32) a5_105 + 4) = a4_104;
				*a4_104 = a5_105;
				Eq_2 a5_114 = *((word32) s0_203 + 1180);
				*s1_110 = (word32) s0_203 + 1176;
				*((word32) a5_114 + 4) = s1_110;
				*((word32) s0_203 + 1180) = s1_110;
				*s1_110 = a5_114;
				a5_121.u0 = 0x00;
				if (s6_123 != 0x00)
					a5_121 = *((word32) s6_123 + 4);
				s1_126 = s6_123;
				s6_123 = a5_121;
			}
			Eq_2 s1_131 = *((word32) s0_203 + 1180);
			Eq_2 s6_132 = 0x00;
			if (s1_131 != 0x00)
				s6_132 = *((word32) s1_131 + 4);
			Eq_2 s7_134 = 0x01;
			word32 s10_136 = 0x230C6000;
			word32 s11_137 = 0x230C6000;
			while (s1_131 != s8_139)
			{
				Eq_2 s1_144 = *((word32) a5_121 + 4);
				*((word32) a5_121 + 4) = a4_104;
				*a4_104 = a5_121;
				ui32 a5_147 = (word32) *((word32) s1_144 + 8);
				a4_104 = a5_147 & 2;
				if ((a5_147 & 2) != 0x00)
				{
					Eq_2 a5_218 = (word32) s2_150->b00F0;
					if (s7_134 >= a5_218)
					{
						a5_218 = (word32) s3_153->b00F1;
						if (s7_134 >= a5_218)
						{
							if (s4_155->dw0560 != 0x00)
							{
								word32 a5_1058;
								xTaskGetTickCountFromISR(out a5_1058);
							}
							else
							{
								word32 a5_1057;
								xTaskGetTickCount(out a5_1057);
							}
							word32 a4_1062;
							word32 s9_1064;
							word32 s4_1063;
							word32 a3_1061;
							word32 a0_1059;
							word32 a1_1060;
							ra = bl_printk(ra, s11_137 + 0x0404, s5_165 + 988, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_144, out a0_1059, out a1_1060, out a2, out a3_1061, out a4_1062, out a5_218, out s2_150, out s3_153, out s4_1063, out s5_165, out s6_132, out s7_134, out s8_139, out s9_1064, out s10_136, out s11_137);
						}
					}
					word32 a5_1054;
					word32 a6_1055;
					word32 t3_1056;
					word32 s1_1053;
					vPortFree(s1_144, a2, a5_218, mstatus, dwArg0108, dwArg0148, out s0_203, out s1_1053, out a0_101, out a1, out a2, out a3, out a4_104, out a5_1054, out a6_1055, out s4_155, out t3_1056);
				}
				else if ((a5_147 & 0x01) != 0x00)
				{
					if (s7_134 >= (word32) s2_150->b00F0 && s7_134 >= (word32) s3_153->b00F1)
					{
						if (s4_155->dw0560 != 0x00)
						{
							word32 a5_1067;
							xTaskGetTickCountFromISR(out a5_1067);
						}
						else
						{
							word32 a5_1066;
							xTaskGetTickCount(out a5_1066);
						}
						word32 a1_1069;
						word32 a2_1070;
						word32 a3_1071;
						word32 s9_1074;
						word32 a4_1072;
						word32 a5_1073;
						word32 a0_1068;
						ra = bl_printk(ra, s10_136 + 0x0424, s5_165 + 988, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_144, out a0_1068, out a1_1069, out a2_1070, out a3_1071, out a4_1072, out a5_1073, out s2_150, out s3_153, out s4_155, out s5_165, out s6_132, out s7_134, out s8_139, out s9_1074, out s10_136, out s11_137);
					}
					Eq_2 s1_208 = bloop_timer_repeat_reconfigure(s0_203, s1_144);
					a1 = s1_208;
					a0_101 = s0_203;
					word32 a5_1065;
					a2 = bloop_timer_register(s0_203, s1_208, out a3, out a4_104, out a5_1065);
				}
				a5_121.u0 = 0x00;
				if (s6_132 != 0x00)
					a5_121 = *((word32) s6_132 + 4);
				s1_131 = s6_132;
				s6_132 = a5_121;
			}
		}
		word32 a4_1001;
		word32 a5_1002;
		Eq_2 a0_308 = __clzsi2(a0_101, out a4_1001, out a5_1002);
		s0_15 = (word32) *((word32) a0_308 + 0x0C);
		s1 = a0_308;
		word32 a5_1003;
		Eq_2 a0_313 = __clzsi2(a0_308, out a4, out a5_1003);
		if (a0_313 >= a0_308)
		{
			s1 = 0x1F - a0_308;
			if (s1 != ~0x00)
			{
				struct Eq_483192 * s6_320 = (s1 << 0x02) + s0_15;
				if (s6_320->dw0410 != 0x00)
				{
					word32 a5_1024;
					vTaskEnterCritical(a4, mstatus, out a5_1024);
					int32 a4_330 = s6_320->dw0010;
					int32 a5_331 = s6_320->dw0090;
					s6_320->dw0010 = 0x00;
					s6_320->dw0090 = a5_331 | a4_330;
					word32 a5_1026;
					word32 a4_1025;
					vTaskExitCritical(a3, mstatus, out a4_1025, out a5_1026);
					a5_350();
					<anonymous> * a5_350;
					word32 a1_1027;
					word32 a4_1030;
					word32 a2_1028;
					word32 a3_1029;
					Eq_2 a0_345 = bl_timer_now_us(out a1_1027, out a2_1028, out a3_1029, out a4_1030, out a5_350);
					word32 a1_1031;
					word32 a4_1032;
					word32 a5_1033;
					Eq_2 a0_377 = bl_timer_now_us(out a1_1031, out a2, out a3, out a4_1032, out a5_1033);
					struct Eq_483251 * a5_390 = (s1 << 0x04) + s0_15;
					int32 a4_391 = a5_390->dw0218;
					Eq_483259 a0_392 = a0_377 - a0_345;
					a5_390->t0214 = a0_392;
					a5_390->dw0218 = (word32) a0_392.u1 + a4_391;
					if (a5_390->t0210 < a0_392)
						a5_390->t0210 = a0_392;
					int32 a4_400 = a5_390->dw021C;
					a5_390->dw021C = a4_400 + 0x01;
					a1 = s1;
					a4 = a4_400 + 0x01;
					a0_101 = bloop_evt_unset_sync(ra, s1, a3, s6, dwArg10, dwArg14, dwArg38, dwArg5C);
					continue;
				}
				else
				{
					word32 a4_1039;
					word32 a0_1035;
					word32 s3_1043;
					word32 s7_1047;
					word32 s10_1050;
					word32 s11_1051;
					word32 t4_1052;
					word32 s8_1048;
					word32 s9_1049;
					word32 s6_1046;
					word32 s4_1044;
					word32 s5_1045;
					word32 s2_1042;
					word32 a5_1040;
					word32 a7_1041;
					word32 a3_1038;
					word32 a1_1036;
					word32 a2_1037;
					word32 s1_1034;
					printf(ra, &g_t230C3498, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_1034, out a0_1035, out a1_1036, out a2_1037, out a3_1038, out a4_1039, out a5_1040, out a7_1041, out s2_1042, out s3_1043, out s4_1044, out s5_1045, out s6_1046, out s7_1047, out s8_1048, out s9_1049, out s10_1050, out s11_1051, out t4_1052);
					while (true)
						;
				}
			}
		}
		a0_101 = 0x1F - a0_313;
		if (a0_101 == ~0x00)
			continue;
		word32 a5_1004;
		a0_101 = utils_list_pop_front(a4, (struct Eq_105929 *) ~0x00, out a5_1004);
	} while (a0_101 != 0x00);
	word32 s8_1019;
	word32 t4_1023;
	word32 s11_1022;
	word32 s9_1020;
	word32 s10_1021;
	word32 s7_1018;
	word32 s1_1005;
	word32 a7_1012;
	word32 s2_1013;
	word32 s3_1014;
	word32 s6_1017;
	word32 s4_1015;
	word32 s5_1016;
	word32 a0_1006;
	word32 a1_1007;
	word32 a4_1010;
	word32 a5_1011;
	word32 a2_1008;
	word32 a3_1009;
	printf(ra, &g_t230C3498, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_1005, out a0_1006, out a1_1007, out a2_1008, out a3_1009, out a4_1010, out a5_1011, out a7_1012, out s2_1013, out s3_1014, out s4_1015, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1021, out s11_1022, out t4_1023);
	while (true)
		;
}

