pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230852E2: void loop_evt_entity_sys_evt(Register Eq_2 ra, Register (ptr32 Eq_2) s0, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgFC)
void loop_evt_entity_sys_evt(Eq_2 ra, union Eq_2 * s0, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgFC)
{
	word32 a0_182;
	word32 a1_183;
	word32 a2_184;
	word32 a4_185;
	word32 a5_186;
	word32 a7_187;
	word32 s2_188;
	word32 s3_189;
	word32 s4_190;
	word32 s6_191;
	word32 s7_192;
	word32 s8_193;
	word32 s9_194;
	word32 s10_195;
	word32 s11_196;
	word32 t4_197;
	Eq_2 a3_26;
	Eq_2 s5_36;
	word32 * s1_109;
	Eq_2 ra_29 = printf(ra, &g_t230C65BC, *s0, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_109, out a0_182, out a1_183, out a2_184, out a3_26, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_36, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
	do
	{
		if ((s0 & 1) == 0x00)
		{
			if (s0 == null)
				break;
			word32 s1_198;
			word32 a0_199;
			word32 a1_200;
			word32 a2_201;
			word32 a3_202;
			word32 a4_203;
			word32 a5_204;
			word32 a7_205;
			word32 s2_206;
			word32 s3_207;
			word32 s4_208;
			word32 s5_209;
			word32 s6_210;
			word32 s7_211;
			word32 s8_212;
			word32 s9_213;
			word32 s10_214;
			word32 s11_215;
			word32 t4_216;
			printf(ra_29, &g_t230C3498, a3_26, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_198, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
			while (true)
				;
		}
		ra_29 = bloop_status_dump(ra_29, a3_26, s5_36, dwArg10, dwArg14, dwArg5C, dwArgFC, out s0, out s1_109, out a3_26, out s5_36);
	} while (s0 != null);
	*s1_109 = 0x00;
	0x00 = dwArg38;
}

// 23085340: void misaligned_load_trap(Register Eq_2 gp, Register (ptr32 word32) a0, Register (ptr32 Eq_367697) a2, Register (ptr32 (ptr32 Eq_367697)) a5, Register ptr32 mstatus, Register ptr32 mcause, Register ptr32 mtval)
// Called from:
//      exception_entry
void misaligned_load_trap(Eq_2 gp, word32 * a0, struct Eq_367697 * a2, struct Eq_367697 ** a5, ptr32 mstatus, ptr32 mcause, ptr32 mtval)
{
	__csrrs(mstatus, 0x00);
	if ((a2 & 2) == 0x00)
	{
		a2 = (struct Eq_367697 *) *a5;
		if ((a5 & 0x03) != 0x03)
			a5 = (word32) (word16) a5;
	}
	else
	{
		a5 = (word32) a2->w0000;
		if ((a5 & 0x03) == 0x03)
			a5 = (struct Eq_367697 **) ((char *) a5 + ((word32) a2->w0002 << 16));
	}
	__csrrw(mstatus, 0x00);
	struct Eq_367697 ** t6_121 = a5;
	word32 t3_26 = 0x04;
	if ((a5 & 3) != 0x03)
		t3_26 = 0x02;
	word32 a7_147;
	word32 t1_119;
	word32 a6_48;
	word32 t3_31 = a2 + t3_26 / 4;
	Eq_2 t5_38 = __csrrs(mtval, gp);
	ui32 a4_43 = a5 & 0x0700007F;
	if (a4_43 != 0x02000003)
	{
		if (a4_43 == 0x02000007)
		{
l230853DE:
			a6_48 = 0x04;
			t1_119 = 0x01;
			a7_147 = 0x00;
			goto l230853E4;
		}
		if (a4_43 == 0x01000003)
		{
			a6_48 = 0x02;
			t1_119 = 0x00;
			a7_147 = 0x10;
			goto l230853E4;
		}
		if (a4_43 == 0x05000003)
		{
			a6_48 = 0x02;
			t1_119 = 0x00;
			a7_147 = 0x00;
			goto l230853E4;
		}
		ui32 a4_58 = a5 & 0x0E000003;
		if (a4_58 == 0x04000000)
		{
			t6_121 = (a5 >> 2 & 0x07) + 0x08 << 0x07;
			a6_48 = 0x04;
			t1_119 = 0x00;
			a7_147 = 0x00;
			goto l230853E4;
		}
		if (a4_58 != 0x04000002)
		{
			if (a4_58 != 0x06000000)
			{
				if (a4_58 != 0x06000002)
				{
l230853D6:
					__csrrw(mcause, 0x05);
					__ebreak();
					while (true)
						;
				}
				goto l230853DE;
			}
			t6_121 = (a5 >> 2 & 0x07) + 0x08 << 0x07;
			a6_48 = 0x04;
			t1_119 = 0x01;
			a7_147 = 0x00;
l230853E4:
			Eq_2 a6_99 = (word32) t5_38 + a6_48;
			Eq_2 a5_100 = t5_38;
			do
			{
				__csrrs(mstatus, 0x00);
				a5_100 = (word32) a5_100 + 1;
				word32 t0_114 = (word32) *((word32) a5_100 - 1);
				__csrrw(mstatus, 0x00);
				union Eq_484364 * a4_106 = (word32) (a5_100 - t5_38) + ((word32) fp - 8);
				*a4_106 = (union Eq_484364 *) (byte) t0_114;
			} while (a6_99 != a5_100);
			if (t1_119 != 0x00)
			{
				*a4_106 = (union Eq_484364 *) (a0 + ((t6_121 >> 0x07 & 0x1F) + 0x01 << 2));
				*a0 = t3_31;
				return;
			}
			else
			{
				(a0 + (t6_121 >> 0x05 & 0x007C))[31] = a4_106 << a7_147 >> a7_147;
				*a0 = t3_31;
				return;
			}
		}
		if ((a5 >> 7 & 0x1F) == 0x00)
			goto l230853D6;
	}
	a6_48 = 0x04;
	t1_119 = 0x00;
	a7_147 = 0x00;
	goto l230853E4;
}

// 23085492: void misaligned_store_trap(Register Eq_2 gp, Register (ptr32 word32) a0, Register (ptr32 Eq_367697) a2, Register (ptr32 (ptr32 Eq_367697)) a5, Register word32 fs0, Register word32 fs1, Register word32 fa0, Register word32 fa1, Register word32 fa2, Register word32 fa3, Register word32 fa4, Register word32 fa5, Register ptr32 mstatus, Register ptr32 mcause, Register ptr32 mtval)
// Called from:
//      exception_entry
void misaligned_store_trap(Eq_2 gp, word32 * a0, struct Eq_367697 * a2, struct Eq_367697 ** a5, word32 fs0, word32 fs1, word32 fa0, word32 fa1, word32 fa2, word32 fa3, word32 fa4, word32 fa5, ptr32 mstatus, ptr32 mcause, ptr32 mtval)
{
	__csrrs(mstatus, 0x00);
	if ((a2 & 2) == 0x00)
	{
		a2 = (struct Eq_367697 *) *a5;
		if ((a5 & 0x03) != 0x03)
			a5 = (word32) (word16) a5;
	}
	else
	{
		a5 = (word32) a2->w0000;
		if ((a5 & 0x03) == 0x03)
			a5 = (struct Eq_367697 **) ((char *) a5 + ((word32) a2->w0002 << 16));
	}
	__csrrw(mstatus, 0x00);
	word32 t4_30 = 0x04;
	if ((a5 & 3) != 0x03)
		t4_30 = 0x02;
	word32 a4_104;
	ui32 a4_48 = a5 & 0x0700007F;
	word32 t4_51 = a2 + t4_30 / 4;
	if (a4_48 != 0x02000023)
	{
		if (a4_48 == 0x02000027)
		{
			uint32 a5_54 = a5 >> 0x0011;
			ptr32 a5_58 = 587748676 + (a5_54 & 0x00F8);
			word32 mcause_73;
			word32 mtval_75;
			word32 gp_76;
			word32 fa4_78;
			word32 fa5_79;
			word32 fa3_80;
			word32 fa2_81;
			word32 fa1_82;
			word32 fa0_83;
			word32 fs1_84;
			word32 fs0_85;
			(a5_58 + 0x009A)();
			return;
		}
		if (a4_48 != 0x01000023)
		{
			ui32 a4_91 = a5 & 0x0E000003;
			if (a4_91 != 0x0C000000)
			{
				if (a4_91 != 0x0C000002)
				{
					if (a4_91 == 0x0E000000)
					{
						ui32 a0_142 = (a5 >> 0x02 & 0x07) + 0x08;
						ptr32 a5_146 = 587748772 + (a0_142 << 3);
						switch (a0_142 << 3)
						{
						case 0x00:
							word32 mcause_367;
							word32 t0_368;
							g_t230855AE();
							return;
						case 0x01:
							word32 mcause_338;
							word32 t0_339;
							word32 fs0_350;
							g_t230855AE();
							return;
						case 0x02:
							word32 mcause_309;
							word32 t0_310;
							word32 fs1_320;
							word32 fs0_321;
							g_t230855AE();
							return;
						case 0x03:
							word32 mcause_280;
							word32 t0_281;
							word32 fa0_290;
							word32 fs1_291;
							word32 fs0_292;
							g_t230855AE();
							return;
						case 0x04:
							word32 mcause_251;
							word32 t0_252;
							word32 fa1_260;
							word32 fa0_261;
							word32 fs1_262;
							word32 fs0_263;
							g_t230855AE();
							return;
						case 0x05:
							word32 mcause_222;
							word32 t0_223;
							word32 fa2_230;
							word32 fa1_231;
							word32 fa0_232;
							word32 fs1_233;
							word32 fs0_234;
							g_t230855AE();
							return;
						case 0x06:
							word32 mcause_193;
							word32 t0_194;
							word32 fa3_200;
							word32 fa2_201;
							word32 fa1_202;
							word32 fa0_203;
							word32 fs1_204;
							word32 fs0_205;
							g_t230855AE();
							return;
						case 0x07:
							word32 mcause_164;
							word32 t0_165;
							word32 fa4_169;
							word32 fa3_171;
							word32 fa2_172;
							word32 fa1_173;
							word32 fa0_174;
							word32 fs1_175;
							word32 fs0_176;
							g_t230855AE();
							return;
						}
					}
					if (a4_91 == 0x0E000002)
					{
						ui32 a5_381 = a5 << 1;
						ptr32 a5_385 = 0x230855D0 + (a5_381 & 0x00F8);
						word32 mcause_399;
						(a5_385 + 0x0E)();
						return;
					}
l23085534:
					__csrrw(mcause, 0x07);
					__ebreak();
					while (true)
						;
				}
				if ((a5 >> 0x07 & 0x1F) == 0x00)
					goto l23085534;
				a4_104 = 0x04;
			}
			else
				a4_104 = 0x04;
		}
		else
			a4_104 = 0x02;
	}
	else
		a4_104 = 0x04;
	byte * a5_116 = (word32) fp - 8;
	byte * a4_118 = a4_104 + ((word32) fp - 8);
	int32 a7_119 = __csrrs(mtval, gp) - ((word32) fp - 8);
	do
	{
		word32 a0_124 = (word32) *a5_116;
		__csrrs(mstatus, 0x00);
		a5_116[a7_119] = (byte) a0_124;
		__csrrw(mstatus, 0x00);
		++a5_116;
	} while (a4_118 != a5_116);
	*a0 = t4_51;
}

