pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
<anonymous> g_t230855AE = <code>;
// 230857DE: void backtrace_riscv()
// Called from:
//      exception_entry
void backtrace_riscv()
{
}

// 230857E2: Register Eq_2 bl_sha_mutex_take(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      Bl_F_fast.constprop.0
Eq_2 bl_sha_mutex_take(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 a0_14;
	word32 a1_143;
	word32 a2_144;
	word32 a3_145;
	word32 a4_146;
	word32 a5_147;
	word32 s8_148;
	ptr32 s1_114;
	ptr32 s2_119;
	ptr32 s3_120;
	ptr32 s4_121;
	xQueueSemaphoreTake(g_t4200F594, ~0x00, a2, a3, a4, 0x4200F000, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_114, out a0_14, out a1_143, out a2_144, out a3_145, out a4_146, out a5_147, out s2_119, out s3_120, out s4_121, out s8_148);
	if (a0_14 != 0x01 && ((word32) g_b420266B4 <= 0x04 && (word32) g_b420280F2 <= 0x04))
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_150;
			xTaskGetTickCountFromISR(out a5_150);
		}
		else
		{
			word32 a5_149;
			xTaskGetTickCount(out a5_149);
		}
		word32 a0_151;
		word32 a1_152;
		word32 a2_153;
		word32 a3_154;
		word32 a4_155;
		word32 a5_156;
		word32 s6_157;
		word32 s7_158;
		word32 s8_159;
		word32 s9_160;
		word32 s10_161;
		word32 s11_162;
		ra = bl_printk(ra, &g_t230C66D0, 0x230C66C0, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_114, out a0_151, out a1_152, out a2_153, out a3_154, out a4_155, out a5_156, out s2_119, out s3_120, out s4_121, out s5, out s6_157, out s7_158, out s8_159, out s9_160, out s10_161, out s11_162);
	}
	s1Out = s1_114;
	s2Out = s2_119;
	s3Out = s3_120;
	s4Out = s4_121;
	s5Out = s5;
	return ra;
}

// 23085858: Register Eq_2 bl_sha_mutex_give(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      Bl_F_fast.constprop.0
Eq_2 bl_sha_mutex_give(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a0_14;
	word32 a7_156;
	word32 s6_159;
	word32 s5_158;
	word32 s4_157;
	word32 a4_154;
	word32 a5_155;
	word32 a2_152;
	word32 a3_153;
	word32 a1_151;
	word32 s8_160;
	ptr32 s1_122;
	ptr32 s2_127;
	ptr32 s3_128;
	xQueueGenericSend(g_t4200F594, 0x00, 0x00, a4, 0x4200F000, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_122, out a0_14, out a1_151, out a2_152, out a3_153, out a4_154, out a5_155, out a7_156, out s2_127, out s3_128, out s4_157, out s5_158, out s6_159, out s8_160);
	if (a0_14 != 0x01 && ((word32) g_b420266B4 <= 0x04 && (word32) g_b420280F2 <= 0x04))
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_162;
			xTaskGetTickCountFromISR(out a5_162);
		}
		else
		{
			word32 a5_161;
			xTaskGetTickCount(out a5_161);
		}
		word32 a0_163;
		word32 a1_164;
		word32 a2_165;
		word32 a3_166;
		word32 a4_167;
		word32 a5_168;
		word32 s4_169;
		word32 s5_170;
		word32 s6_171;
		word32 s7_172;
		word32 s8_173;
		word32 s9_174;
		word32 s10_175;
		word32 s11_176;
		ra = bl_printk(ra, &g_t230C6694, 0x230C66C0, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_122, out a0_163, out a1_164, out a2_165, out a3_166, out a4_167, out a5_168, out s2_127, out s3_128, out s4_169, out s5_170, out s6_171, out s7_172, out s8_173, out s9_174, out s10_175, out s11_176);
	}
	s1Out = s1_122;
	s2Out = s2_127;
	s3Out = s3_128;
	return ra;
}

// 230858D2: void bl_sha_init(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register (ptr32 word32) a5, Stack word32 dwArg94)
// Called from:
//      utils_hmac_sha1_fast
void bl_sha_init(Eq_2 ra, Eq_2 a0, ui32 a1, word32 * a5, word32 dwArg94)
{
	word32 * a5_18 = Sec_Eng_SHA256_Init(ra, a0, a1, a5, ra, dwArg94);
	Sec_Eng_SHA_Start(a5_18);
}

// 230858F0: Register word32 bl_sha_update(Register (ptr32 Eq_443217) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Stack word32 dwArg98, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      utils_hmac_sha1_fast
word32 bl_sha_update(struct Eq_443217 * a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, word32 dwArg98, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	ptr32 a1_14;
	ptr32 a4_17;
	word32 s0_21;
	ptr32 s2_23;
	ptr32 s3_24;
	ptr32 s4_25;
	ptr32 s5_26;
	word32 s1_43;
	word32 a0_44;
	word32 s6_45;
	Sec_Eng_SHA256_Update(a0, a1, a2, s5, dwArg98, out s0_21, out s1_43, out a0_44, out a1_14, out a4_17, out s2_23, out s3_24, out s4_25, out s5_26, out s6_45);
	a1Out = a1_14;
	a2Out = dwArg10;
	a4Out = a4_17;
	s2Out = s2_23;
	s3Out = s3_24;
	s4Out = s4_25;
	s5Out = s5_26;
	return s0_21;
}

// 23085904: Register word32 bl_sha_finish(Register Eq_2 a1, Register (ptr32 ui32) a4, Register Eq_2 s5, Stack word32 dwArg78, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      utils_hmac_sha1_fast
word32 bl_sha_finish(Eq_2 a1, ui32 * a4, Eq_2 s5, word32 dwArg78, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s0_19;
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s4_23;
	ptr32 s5_24;
	ptr32 s6_25;
	word32 ra_18 = Sec_Eng_SHA256_Finish(a1, a4, s5, dwArg78, out s0_19, out s1_20, out s2_21, out s4_23, out s5_24, out s6_25);
	s0Out = s0_19;
	s1Out = s1_20;
	s2Out = s2_21;
	s4Out = s4_23;
	s5Out = s5_24;
	s6Out = s6_25;
	return ra_18;
}

// 23085916: Register Eq_2 hal_hbn_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_454178) s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out)
// Called from:
//      deep_sleep
Eq_2 hal_hbn_init(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0118, Eq_2 dwArg0158, struct Eq_454178 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out)
{
	ptr32 a2_160;
	ptr32 a4_141;
	ptr32 a3_140;
	Eq_2 ra_104;
	struct Eq_454178 * s1_145;
	ptr32 s3_147;
	struct Eq_274 * a0_239;
	int32 a5_6 = (word32) a1 - 1 << 24;
	if (a5_6 >> 24 < 0x00)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_560;
			xTaskGetTickCountFromISR(out a5_560);
		}
		else
		{
			word32 a5_559;
			xTaskGetTickCount(out a5_559);
		}
		a0_239 = (struct Eq_274 *) &g_t230C671C;
		goto l23085956;
	}
	Eq_2 a0_21;
	word32 s3_556;
	word32 s8_558;
	word32 s4_557;
	word32 a1_549;
	word32 a2_550;
	word32 a5_553;
	word32 a6_554;
	word32 s2_555;
	word32 a3_551;
	word32 a4_552;
	word32 s1_548;
	Eq_2 s0_28 = pvPortMalloc(ra, s1, (word32) a1 + 3, a3, a4, a5_6 >> 24, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_548, out a0_21, out a1_549, out a2_550, out a3_551, out a4_552, out a5_553, out a6_554, out s2_555, out s3_556, out s4_557, out s8_558);
	Eq_2 s1_105 = a0_21;
	if (a0_21 == 0x00)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_567;
			xTaskGetTickCountFromISR(out a5_567);
		}
		else
		{
			word32 a5_566;
			xTaskGetTickCount(out a5_566);
		}
		a0_239 = (struct Eq_274 *) &g_t230C673C;
l23085956:
		word32 a0_568;
		word32 s4_572;
		word32 s6_574;
		word32 s7_575;
		word32 s2_571;
		word32 a1_569;
		word32 a5_570;
		word32 s5_573;
		word32 s9_577;
		word32 s8_576;
		word32 s10_578;
		word32 s11_579;
		ra_104 = bl_printk(ra, a0_239, 0x230C6710, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_145, out a0_568, out a1_569, out a2_160, out a3_140, out a4_141, out a5_570, out s2_571, out s3_147, out s4_572, out s5_573, out s6_574, out s7_575, out s8_576, out s9_577, out s10_578, out s11_579);
		goto l2308595C;
	}
	struct Eq_274 * a0_175;
	*((word32) a0_21 + 1) = 0x01;
	*a0_21 = (byte) a1;
	word32 a5_563;
	word32 a6_564;
	word32 a7_565;
	word32 a1_561;
	word32 a2_562;
	Eq_2 a4_102;
	Eq_2 a3_101;
	memcpy((word32) a0_21 + 2, s0_28, a1, out a1_561, out a2_562, out a3_101, out a4_102, out a5_563, out a6_564, out a7_565);
	Eq_2 a5_118 = g_t4200F70C;
	ra_104 = ra;
	if (a5_118 == 0x00)
	{
		struct Eq_96932 * a0_60;
		word32 a2_588;
		word32 a1_587;
		word32 a6_589;
		word32 s2_590;
		word32 s3_591;
		word32 s4_592;
		word32 s8_593;
		a0_60->t0000 = pvPortMalloc(ra, a0_21, 0x08, a3_101, a4_102, a5_118, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_105, out a0_60, out a1_587, out a2_588, out a3_101, out a4_102, out a5_118, out a6_589, out s2_590, out s3_591, out s4_592, out s8_593);
		if (a0_60 == null)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_595;
				xTaskGetTickCountFromISR(out a5_595);
			}
			else
			{
				word32 a5_594;
				xTaskGetTickCount(out a5_594);
			}
			word32 a0_598;
			word32 a1_599;
			word32 a2_600;
			word32 s2_601;
			word32 s3_602;
			word32 s4_603;
			word32 s5_604;
			word32 s6_605;
			word32 s7_606;
			word32 s8_607;
			word32 s9_608;
			word32 s10_609;
			word32 s11_610;
			ra_104 = bl_printk(ra, &g_t230C675C, 0x230C6710, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_105, out a0_598, out a1_599, out a2_600, out a3_101, out a4_102, out a5_118, out s2_601, out s3_602, out s4_603, out s5_604, out s6_605, out s7_606, out s8_607, out s9_608, out s10_609, out s11_610);
		}
		else
		{
			utils_notifier_chain_init(a0_60);
			ra_104 = ra;
		}
		if (a5_118 == 0x00)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_597;
				xTaskGetTickCountFromISR(out a5_597);
			}
			else
			{
				word32 a5_596;
				xTaskGetTickCount(out a5_596);
			}
			a0_175 = (struct Eq_274 *) &g_t230C6780;
			goto l23085A3C;
		}
	}
	Eq_2 a0_137;
	word32 a1_580;
	word32 a5_582;
	word32 a2_581;
	word32 s4_585;
	word32 a6_583;
	word32 s8_586;
	word32 s2_584;
	pvPortMalloc(ra_104, s1_105, 0x10, a3_101, a4_102, a5_118, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_145, out a0_137, out a1_580, out a2_581, out a3_140, out a4_141, out a5_582, out a6_583, out s2_584, out s3_147, out s4_585, out s8_586);
	if (a0_137 != 0x00)
	{
		g_t23085AC8 = a0_137;
		s1_145->t0008 = a0_137;
		a2_160 = utils_notifier_chain_register(a0_137, a0_137);
		goto l23085A40;
	}
	if (g_t4200F560 != 0x00)
	{
		word32 a5_612;
		xTaskGetTickCountFromISR(out a5_612);
	}
	else
	{
		word32 a5_611;
		xTaskGetTickCount(out a5_611);
	}
	a0_175 = (struct Eq_274 *) &g_t230C675C;
l23085A3C:
	word32 a0_613;
	word32 a1_614;
	word32 a5_615;
	word32 s2_616;
	word32 s4_617;
	word32 s5_618;
	word32 s6_619;
	word32 s7_620;
	word32 s8_621;
	word32 s9_622;
	word32 s10_623;
	word32 s11_624;
	ra_104 = bl_printk(ra_104, a0_175, 0x230C6710, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_145, out a0_613, out a1_614, out a2_160, out a3_140, out a4_141, out a5_615, out s2_616, out s3_147, out s4_617, out s5_618, out s6_619, out s7_620, out s8_621, out s9_622, out s10_623, out s11_624);
l2308595C:
	s1Out = s1_145;
	a2Out = a2_160;
	a3Out = a3_140;
	a4Out = a4_141;
	s3Out = s3_147;
	return ra_104;
}

// 23085AA8: Register Eq_2 hal_hbn_enter(Register Eq_2 ra, Register Eq_2 s0, Register out ptr32 s1Out, Register out ptr32 a2Out)
// Called from:
//      deep_sleep
Eq_2 hal_hbn_enter(Eq_2 ra, Eq_2 s0, ptr32 & s1Out, ptr32 & a2Out)
{
	ptr32 a2_14;
	ptr32 s1_17;
	Eq_2 ra_16 = utils_notifier_chain_call(ra, s0, g_t4200F70C, fp + ~0x13, &g_t4200F000, out s1_17, out a2_14);
	s1Out = s1_17;
	a2Out = a2_14;
	return ra_16;
}

