pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23085AC4: void bl_hbn_enter(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_485173) a0, Register (ptr32 Eq_485217) a1, Stack Eq_2 dwArg00, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArgDC, Stack word32 dwArg0128)
void bl_hbn_enter(Eq_2 ra, Eq_2 s0, struct Eq_485173 * a0, union Eq_485217 * a1, Eq_2 dwArg00, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArgDC, word32 dwArg0128)
{
	word32 a4_497;
	word32 a7_500;
	word32 a2_496;
	word32 a6_499;
	word32 a1_495;
	word32 a5_498;
	Eq_2 a3_131;
	memcpy(fp + -36, 588015528, 0x14, out a1_495, out a2_496, out a3_131, out a4_497, out a5_498, out a6_499, out a7_500);
	union Eq_485217 * s2_103 = a1;
	struct Eq_485173 * s0_124 = a0;
	word32 s1_100 = &a0->b0002;
	if (a0 != null)
	{
		Eq_2 a3_42;
		Eq_2 s1_71;
		Eq_2 s5_77;
		Eq_2 s6_78;
		word32 t4_534;
		word32 s11_533;
		word32 s9_531;
		word32 s10_532;
		word32 s7_529;
		word32 s8_530;
		word32 s4_528;
		word32 s3_527;
		word32 s1_501;
		word32 a0_502;
		word32 a2_504;
		word32 a4_505;
		word32 a7_507;
		word32 s2_508;
		word32 s4_510;
		word32 a3_522;
		word32 s3_509;
		word32 a7_525;
		word32 a5_506;
		word32 a0_519;
		word32 s2_526;
		word32 a2_521;
		word32 a1_520;
		word32 s5_511;
		word32 a5_524;
		word32 a4_523;
		word32 t4_518;
		word32 s9_515;
		word32 s11_517;
		word32 s8_514;
		word32 s7_513;
		word32 a1_503;
		word32 s6_512;
		word32 s10_516;
		word32 a4_535;
		word32 a5_536;
		word32 s3_537;
		word32 s4_538;
		word32 s5_539;
		word32 s6_540;
		word32 s7_541;
		word32 s8_542;
		word32 s9_543;
		ra = log_buf_out(printf(printf(ra, &g_t230C67BC, a3_131, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_501, out a0_502, out a1_503, out a2_504, out a3_42, out a4_505, out a5_506, out a7_507, out s2_508, out s3_509, out s4_510, out s5_511, out s6_512, out s7_513, out s8_514, out s9_515, out s10_516, out s11_517, out t4_518), &g_t230C67D0, a3_42, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_71, out a0_519, out a1_520, out a2_521, out a3_522, out a4_523, out a5_524, out a7_525, out s2_526, out s3_527, out s4_528, out s5_77, out s6_78, out s7_529, out s8_530, out s9_531, out s10_532, out s11_533, out t4_534), s1_71, (word32) a0->b0000, 0x00, s5_77, s6_78, s0, dwLoc10, dwLoc0C, dwArg00, dwArg28, dwArg3C, dwArg4C, dwArgDC, out s0_124, out s1_100, out a3_131, out a4_535, out a5_536, out s2_103, out s3_537, out s4_538, out s5_539, out s6_540, out s7_541, out s8_542, out s9_543);
	}
	struct Eq_274 * a0_171;
	Eq_2 a5_120 = (char *) *s2_103 + 999 >> 1000;
	if (s1_100 == 0x00)
	{
l23085B46:
		a0_171 = (struct Eq_274 *) &g_t230C67F0;
		goto l23085B4E;
	}
	uint32 s1_125 = (word32) s0_124->b0000;
	if ((s1_125 + -1 & 0x00FF) > 0x01)
		goto l23085B46;
	word32 s1_154;
	word32 a1_148;
	word32 s2_157;
	struct Eq_478506 * a3_150;
	word32 a5_129 = (word32) s0_124->b0002;
	if (s1_125 == 0x01)
	{
		if (s1_125 >= (a5_129 + -7 & 0x00FF))
		{
			if (a5_129 == 0x07)
			{
				word32 a0_559;
				word32 a2_560;
				word32 a4_561;
				word32 a5_562;
				word32 a7_563;
				word32 s3_564;
				word32 s4_565;
				word32 s5_566;
				word32 s6_567;
				word32 s7_568;
				word32 s8_569;
				word32 s9_570;
				word32 s10_571;
				word32 s11_572;
				word32 t4_573;
				printf(ra, &g_t230C6804, a3_131, a5_120, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_154, out a0_559, out a1_148, out a2_560, out a3_150, out a4_561, out a5_562, out a7_563, out s2_157, out s3_564, out s4_565, out s5_566, out s6_567, out s7_568, out s8_569, out s9_570, out s10_571, out s11_572, out t4_573);
				goto l23085B8A;
			}
			word32 a0_544;
			word32 a2_545;
			word32 a4_546;
			word32 a5_547;
			word32 a7_548;
			word32 s3_549;
			word32 s4_550;
			word32 s5_551;
			word32 s6_552;
			word32 s7_553;
			word32 s8_554;
			word32 s9_555;
			word32 s10_556;
			word32 s11_557;
			word32 t4_558;
			printf(ra, &g_t230C6814, a3_131, a5_120, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_154, out a0_544, out a1_148, out a2_545, out a3_150, out a4_546, out a5_547, out a7_548, out s2_157, out s3_549, out s4_550, out s5_551, out s6_552, out s7_553, out s8_554, out s9_555, out s10_556, out s11_557, out t4_558);
l23085B8A:
			bl_flash_get_flashCfg();
			HBN_Clear_IRQ(0x01, HBN_Clear_IRQ(0x00, a3_150));
			g_t4200C60A();
l23085B52:
			0x00 = dwArg0128;
			return;
		}
		goto l23085BE8;
	}
	word32 a5_132;
	word32 a4_130 = 0x07;
	if (a5_129 == 0x07)
	{
		a4_130 = (word32) s0_124->b0003;
		a5_132 = 0x08;
	}
	else
	{
		a3_131.u0 = 0x08;
		if (a5_129 != 0x08)
			goto l23085BE8;
		a5_132 = (word32) s0_124->b0003;
	}
	if (a5_132 == a4_130)
	{
		word32 a0_574;
		word32 a2_575;
		word32 a4_576;
		word32 a5_577;
		word32 a7_578;
		word32 s3_579;
		word32 s4_580;
		word32 s5_581;
		word32 s6_582;
		word32 s7_583;
		word32 s8_584;
		word32 s9_585;
		word32 s10_586;
		word32 s11_587;
		word32 t4_588;
		printf(ra, &g_t230C6824, a3_131, a5_120, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_154, out a0_574, out a1_148, out a2_575, out a3_150, out a4_576, out a5_577, out a7_578, out s2_157, out s3_579, out s4_580, out s5_581, out s6_582, out s7_583, out s8_584, out s9_585, out s10_586, out s11_587, out t4_588);
		goto l23085BB6;
	}
l23085BE8:
	a0_171 = (struct Eq_274 *) &g_t230C6834;
l23085B4E:
	word32 s1_589;
	word32 a0_590;
	word32 a1_591;
	word32 a2_592;
	word32 a3_593;
	word32 a4_594;
	word32 a5_595;
	word32 a7_596;
	word32 s2_597;
	word32 s3_598;
	word32 s4_599;
	word32 s5_600;
	word32 s6_601;
	word32 s7_602;
	word32 s8_603;
	word32 s9_604;
	word32 s10_605;
	word32 s11_606;
	word32 t4_607;
	printf(ra, a0_171, a3_131, a5_120, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_589, out a0_590, out a1_591, out a2_592, out a3_593, out a4_594, out a5_595, out a7_596, out s2_597, out s3_598, out s4_599, out s5_600, out s6_601, out s7_602, out s8_603, out s9_604, out s10_605, out s11_606, out t4_607);
	goto l23085B52;
}

Eq_2 g_t23085AC8 = 
	{
		46
	};
// 23085BF2: void httpc_tcp_sent()
void httpc_tcp_sent()
{
}

// 23085BF6: Register Eq_2 httpc_get_internal_addr(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      httpc_dns_found
//      httpc_get_file
//      httpc_get_file_dns
Eq_2 httpc_get_internal_addr(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 & a3Out, ptr32 & a5Out)
{
	if ((word32) a0 + 4 != a1)
		*((word32) a4 + 4) = a0;
	Eq_2 a0_13 = *a0;
	ptr32 a5_20;
	Eq_2 a0_18 = altcp_connect(a0_13, (word32) a0 + 4, out a5_20);
	a3Out = 587751320;
	a5Out = a5_20;
	return a0_18;
}

// 23085C16: Register word32 httpc_free_state(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_485595) a5Out, Register out (ptr32 Eq_485596) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out (ptr32 Eq_2) s6Out)
// Called from:
//      httpc_tcp_connected
//      httpc_init_connection_common.constprop.5
//      httpc_get_file
//      httpc_get_file_dns
word32 httpc_free_state(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, struct Eq_485595 & a5Out, struct Eq_485596 & s2Out, ptr32 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s0_19;
	Eq_2 ra_41;
	Eq_2 a0_12 = *((word32) a0 + 16);
	ra_41 = ra;
	s0_19 = s0;
	if (a0_12 != 0x00)
	{
		struct Eq_485610 * s1_26;
		word32 a7_253;
		word32 a2_251;
		word32 s5_254;
		word32 s6_255;
		word32 s8_256;
		word32 a5_252;
		word32 a1_250;
		ra_41 = pbuf_free(ra, a0_12, a3, a4, s4, mstatus, dwArg0118, out s0_19, out s1_26, out a0_12, out a1_250, out a2_251, out a3, out a4, out a5_252, out a7_253, out s2, out s3, out s4, out s5_254, out s6_255, out s8_256, out mstatus);
		s1_26->dw0010 = 0x00;
	}
	if (a0_12 != 0x00)
	{
		struct Eq_485673 * s1_61;
		word32 a0_261;
		word32 a1_262;
		word32 a2_263;
		word32 a5_264;
		word32 a7_265;
		word32 s5_266;
		word32 s8_268;
		word32 s6_267;
		pbuf_free(ra_41, a0_12, a3, a4, s4, mstatus, dwArg0118, out s0_19, out s1_61, out a0_261, out a1_262, out a2_263, out a3, out a4, out a5_264, out a7_265, out s2, out s3, out s4, out s5_266, out s6_267, out s8_268, out mstatus);
		s1_61->dw0014 = 0x00;
	}
	ptr32 a3_97;
	ptr32 a4_98;
	word32 s1_103;
	struct Eq_485596 * s2_104;
	ptr32 s3_105;
	ptr32 s5_107;
	union Eq_2 * s6_108;
	word32 a1_257;
	word32 a7_258;
	word32 s4_259;
	word32 s8_260;
	struct Eq_485595 * a5_136;
	Eq_2 s0_102 = mem_free(*s0_19, a3, a4, s2, s3, s4, mstatus, s0, dwLoc08, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s1_103, out a1_257, out a3_97, out a4_98, out a5_136, out a7_258, out s2_104, out s3_105, out s4_259, out s5_107, out s6_108, out s8_260);
	if (s0_102 != 0x00)
	{
		altcp_arg(s0_102, 0x00);
		altcp_recv(s0_102, null);
		altcp_err(s0_102, null);
		Eq_2 a5_130;
		altcp_poll(s0_102, null, 0x00, a5_136, out a5_130);
		altcp_sent(s0_102, null);
		if (altcp_close(s0_102, a5_130, out a5_136) != 0x00)
		{
			a5_136 = altcp_abort(s0_102, a5_136);
l23085C44:
			a3Out = a3_97;
			a4Out = a4_98;
			a5Out = a5_136;
			s2Out = s2_104;
			s3Out = s3_105;
			s5Out = s5_107;
			s6Out = s6_108;
			return s1_103;
		}
	}
	goto l23085C44;
}

// 23085C8A: void httpc_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_485743) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
// Called from:
//      httpc_tcp_recv
//      httpc_dns_found
//      httpc_tcp_poll
//      httpc_tcp_err
//      httpc_tcp_connected
void httpc_close(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, struct Eq_485743 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_10 = a5->t0020;
	Eq_2 a4_12 = a3;
	Eq_2 s0_13 = a0_10;
	Eq_2 a3_15 = a2;
	if (a5 != null)
	{
		<anonymous> * a5_16 = a5->ptr0014;
		if (a5_16 != null)
		{
			word32 a1_73;
			word32 a6_74;
			word32 a7_75;
			word32 s1_76;
			word32 s5_77;
			word32 s6_78;
			word32 s8_79;
			word32 t0_80;
			word32 t1_81;
			word32 t3_82;
			word32 t4_83;
			word32 t5_84;
			word32 t6_85;
			word32 tp_86;
			a5_16();
		}
	}
	word32 s6_157;
	word32 s5_156;
	word32 s3_155;
	word32 s2_154;
	word32 a5_153;
	word32 a4_152;
	word32 a3_151;
	httpc_free_state(ra, s0, s0_13, a3_15, a4_12, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out a3_151, out a4_152, out a5_153, out s2_154, out s3_155, out s5_156, out s6_157);
}

// 23085CB4: void httpc_tcp_recv(Register Eq_2 ra, Register Eq_2 a0, Register int32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register word32 s7, Register word32 s8, Register word32 s9, Register ptr32 mstatus, Stack ptr32 dwArg14, Stack ptr32 dwArg34, Stack word32 dwArgC8, Stack word32 dwArgE8, Stack word32 dwArg0198)
void httpc_tcp_recv(Eq_2 ra, Eq_2 a0, int32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, word32 s7, word32 s8, word32 s9, ptr32 mstatus, ptr32 dwArg14, ptr32 dwArg34, word32 dwArgC8, word32 dwArgE8, word32 dwArg0198)
{
	Eq_2 a2_481;
	Eq_2 a3_283;
	*(union Eq_2 *) 0x2A = a0;
	struct Eq_485829 * sp_3 = fp + -64;
	Eq_2 s0_101 = a0;
	struct Eq_485743 * a5_265 = (word32) *((word32) a0 + 48);
	if (a2 == 0x00)
	{
		a2_481 = (word32) *((word32) a0 + 26);
		a3_283.u0 = 0x00;
		goto l23085CF8;
	}
	int32 s3_104 = a1;
	Eq_2 s1_102 = a2;
	Eq_2 s4_191 = a3;
	if (a5_265 == (struct Eq_485743 *) 0x02)
	{
l23085D24:
		Eq_2 a4_488 = (word32) *((word32) s1_102 + 8);
		word32 a5_491 = a5_265 + a4_488;
		*((word32) a5_491 + 40) = a5_265->dw0028;
		if (a5_491 != 0x00)
		{
			word32 t0_600;
			word32 t1_601;
			word32 a7_602;
			word32 t4_603;
			word32 t5_604;
			word32 t6_605;
			word32 t2_606;
			a5_491();
			goto l23085CFE;
		}
		word32 a5_954;
		altcp_recved(s3_104, a5_491, out a5_954);
		word32 s4_966;
		word32 mstatus_970;
		word32 s8_969;
		word32 s5_967;
		word32 s6_968;
		word32 a1_958;
		word32 a4_961;
		word32 a5_962;
		word32 s2_964;
		word32 s3_965;
		word32 a7_963;
		word32 a2_959;
		word32 a3_960;
		word32 a0_957;
		word32 s0_955;
		word32 s1_956;
		pbuf_free(ra, s1_102, a3, a4_488, s4_191, mstatus, sp_3->t0128, out s0_955, out s1_956, out a0_957, out a1_958, out a2_959, out a3_960, out a4_961, out a5_962, out a7_963, out s2_964, out s3_965, out s4_966, out s5_967, out s6_968, out s8_969, out mstatus_970);
		goto l23085F10;
	}
	a0 = *((word32) a0 + 20);
	if (a0 == 0x00)
		*((word32) a2 + 20) = a0;
	else
		pbuf_cat(a0, a2, 0x02);
	if ((word32) *((word32) a0 + 48) == 0x00)
	{
		s6 = *((word32) a0 + 20);
		word32 a5_973;
		word32 a2_971;
		word32 a4_972;
		s0_101 = pbuf_memfind(s6, 0x02, 0x00, dwArg14, dwArgC8, out s1_102, out a0, out a2_971, out a3, out a4_972, out a5_973, out s2, out s3_104, out s4_191, out s8);
		s7 = 0x0FFFFFFF;
		s5 = a0;
		if (a0 != 0x0FFFFFFF)
		{
			s9 = 0x230BF000;
			word32 a2_974;
			word32 a5_976;
			word32 s2_977;
			word32 a4_975;
			s0_101 = pbuf_memfind(s6, 0x01, 0x00, dwArg14, dwArgC8, out s1_102, out a0, out a2_974, out a3, out a4_975, out a5_976, out s2_977, out s3_104, out s4_191, out s8);
			s2 = a0;
			if (a0 != 0x0FFFFFFF)
			{
				word32 a4_978;
				word32 a5_979;
				s0_101 = pbuf_memcmp(s6, 0x00, 0x05, dwArg34, dwArgE8, out s1_102, out a0, out a3, out a4_978, out a5_979, out s2, out s3_104);
				if (a0 == 0x00)
				{
					word32 a4_980;
					a0 = pbuf_get_at(s6, 0x06, out a3, out a4_980);
					if (a0 == 46)
					{
						ptr32 s2_161;
						word32 a4_982;
						word32 a3_983;
						word32 a4_984;
						word32 a3_981;
						*((word32) s0_101 + 24) = (word16) ((word32) pbuf_get_at(s6, 0x07, out a3_983, out a4_984) - 48 | (word32) ((word16) ((word32) pbuf_get_at(s6, 0x05, out a3_981, out a4_982) - 48)) << 8);
						word32 a0_146;
						Eq_2 s8_153;
						ui32 s2_158;
						word32 s3_990;
						word32 s4_991;
						word32 s1_985;
						word32 a2_986;
						word32 a4_988;
						word32 a5_989;
						word32 a3_987;
						pbuf_memfind(s6, 0x01, (word32) (word16) ((word32) s2 + 1), dwArg14, dwArgC8, out s1_985, out a0_146, out a2_986, out a3_987, out a4_988, out a5_989, out s2_158, out s3_990, out s4_991, out s8_153);
						if (a0_146 != 0x0FFFFFFF)
							s2_161 = a0_146 - s2_158;
						else
							s2_161 = a0 - s2_158;
						word32 a5_1014;
						word32 a0_1009;
						word32 a1_1010;
						word32 a3_1012;
						word32 a4_1013;
						word32 a2_1011;
						word32 t1_1008;
						ra = memset(ra, fp + -64, 0x00, 0x0A, out t1_1008, out a0_1009, out a1_1010, out a2_1011, out a3_1012, out a4_1013, out a5_1014);
						word32 a5_1018;
						word32 a4_1017;
						word32 a1_1015;
						word32 a2_1016;
						s0_101 = pbuf_copy_partial(s6, fp + -64, (word32) (word16) (s2_161 + ~0x00), s8_153, out s1_102, out a0, out a1_1015, out a2_1016, out a3, out a4_1017, out a5_1018, out s2, out s3_104, out s4_191, out s8);
						if (s2 == a0)
						{
							word32 a4_994;
							word32 a5_995;
							word32 a2_993;
							word32 a1_992;
							a0 = atoi(fp + -64, out a1_992, out a2_993, out a3, out a4_994, out a5_995);
							if (a0 <= 0xF0000001)
							{
								((word32) s0_101 + 26)->u2 = (word16) a0;
								*((word32) s0_101 + 48) = 0x01;
l23085E34:
								s6 = *((word32) s0_101 + 20);
								word32 a5_1021;
								word32 s2_1022;
								word32 a2_1019;
								word32 a4_1020;
								s0_101 = pbuf_memfind(s6, 0x04, 0x00, dwArg14, dwArgC8, out s1_102, out a0, out a2_1019, out a3, out a4_1020, out a5_1021, out s2_1022, out s3_104, out s4_191, out s8);
								s7 = 0x10000000;
								s2 = a0;
								if (a0 <= 0x0FFFFFFC)
								{
									*(union Eq_2 *) 0x2B = s0_101;
									Eq_2 a0_273;
									word32 s1_996;
									word32 s2_285;
									int32 s3_286;
									Eq_2 a5_276;
									word32 s8_280;
									Eq_2 a2_274;
									Eq_2 a4_275;
									pbuf_memfind(s6, 0x10, 0x00, dwArg14, dwArgC8, out s1_996, out a0_273, out a2_274, out a3_283, out a4_275, out a5_276, out s2_285, out s3_286, out s4, out s8_280);
									s7 = 0x0FFFFFFF;
									if (a0_273 != 0x0FFFFFFF)
									{
										word32 a0_295;
										word32 s1_997;
										pbuf_memfind(s6, 0x02, a0_273, dwArg14, dwArgC8, out s1_997, out a0_295, out a2_274, out a3_283, out a4_275, out a5_276, out s2_285, out s3_286, out s4, out s8_280);
										if (a0_295 != 0x0FFFFFFF)
										{
											word32 a3_1002;
											word32 a4_1003;
											word32 a5_1004;
											word32 t1_998;
											word32 a1_1000;
											word32 a2_1001;
											word32 a0_999;
											ra = memset(ra, fp + -64, 0x00, 0x10, out t1_998, out a0_999, out a1_1000, out a2_1001, out a3_1002, out a4_1003, out a5_1004);
											word32 a0_334;
											word32 s1_341;
											word32 a1_1005;
											Eq_2 s0_337 = pbuf_copy_partial(s6, fp + -64, (word32) (word16) (a0_295 - a0_273 + ~0x0F), (word32) (word16) ((word32) a0_273 + 16), out s1_341, out a0_334, out a1_1005, out a2_274, out a3_283, out a4_275, out a5_276, out s2_285, out s3_286, out s4, out s8_280);
											if (s1_341 == a0_334)
											{
												word32 a1_1006;
												Eq_2 a0_355 = atoi(fp + -64, out a1_1006, out a2_274, out a3_283, out a4_275, out a5_276);
												if (a0_355 >= 0x00)
													*((word32) a0_355 + 44) = s0_337;
											}
										}
									}
									Eq_2 s1_374 = (word32) (word16) (s2_285 + 4);
									struct Eq_486126 * a5_381;
									Eq_2 a0_379 = altcp_recved(s3_286, a5_276, out a5_381);
									if (a5_381 != null)
									{
										<anonymous> * a5_384 = a5_381->ptr0018;
										if (a5_384 != null)
										{
											Eq_2 s0_389 = *((word32) s1_374 + 36);
											word32 t0_425;
											word32 t1_426;
											word32 a7_427;
											word32 t4_428;
											word32 t5_429;
											word32 t6_430;
											word32 t2_431;
											a5_384();
											a3_283 = a0_379;
											if (a0_379 != 0x00)
											{
												a2_481 = (word32) *((word32) s0_101 + 26);
l23085CF8:
												httpc_close(ra, s0_101, s0_101, a2_481, a3_283, a5_265, s2, s3, s4, mstatus, sp_3->t0014, sp_3->t0094, sp_3->t00C8, sp_3->t00E8, sp_3->t0108, sp_3->t0118, sp_3->t0128, sp_3->t0148, sp_3->t0168, sp_3->t0188);
l23085CFE:
												0x00 = dwArg0198;
												return;
											}
										}
									}
									struct Eq_486212 * s0_452;
									word32 s1_1007;
									ra = pbuf_free_header(ra, s1_374, a0_379, s1_374, a2_274, a3_283, a4_275, s4, mstatus, sp_3->t0044, sp_3->t0108, out s0_452, out s1_1007, out a0, out a3, out s2, out s3_104, out s4_191, out s5, out s6, out s8, out mstatus);
									s0_452->dw0014 = 0x00;
									s0_452->b0030 = 0x02;
									a5_265 = (struct Eq_485743 *) 0x02;
									s1_102 = a0;
									if (a0 == 0x00)
									{
l23085F10:
										goto l23085CFE;
									}
									goto l23085D24;
								}
l23085F06:
								a5_265 = (struct Eq_485743 *) 0x02;
								if ((word32) *((word32) s0_101 + 48) != 0x02)
									goto l23085F10;
								goto l23085D24;
							}
						}
					}
				}
			}
		}
	}
	if ((word32) *((word32) s0_101 + 48) != 0x01)
		goto l23085F06;
	goto l23085E34;
}

// 23085F3C: void httpc_dns_found(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register (ptr32 Eq_485743) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_dns_found(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a4, struct Eq_485743 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	Eq_2 a3_12;
	if (a1 != 0x00)
	{
		word32 a3_129;
		Eq_2 a0_15 = httpc_get_internal_addr(a2, a1, a4, out a3_129, out a5);
		a3_12 = a0_15;
		if (a0_15 == 0x00)
			return;
	}
	else
		a3_12.u0 = ~0x0F;
	httpc_close(ra, s0, a2, 0x00, a3_12, a5, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

// 23085F6C: void httpc_tcp_poll(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register (ptr32 Eq_485743) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_tcp_poll(Eq_2 ra, Eq_2 s0, word32 a0, struct Eq_485743 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_6 = a5->t000C;
	if (a5 != null)
	{
		a5->t000B = a0_6;
		a5 = (struct Eq_485743 *) ((char *) a5 - 1);
		if (a5 != (struct Eq_485743 *) ~0x00)
			return;
	}
	httpc_close(ra, s0, a0_6, 0x00, 0x00, a5, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

// 23085F86: void httpc_tcp_err(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_485743) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_tcp_err(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, struct Eq_485743 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	*a0 = 0x00;
	httpc_close(ra, s0, a0, 0x00, a1, a5, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

