pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308626C: Register Eq_2 httpc_get_file_dns(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      http_url_req
Eq_2 httpc_get_file_dns(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a6, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a2 == 0x00 || a4 == 0x00))
	{
l230862BA:
		0x00 = (int8) dwArg0128;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		mstatusOut = mstatus;
		return dwArg0100;
	}
	word32 a0_40;
	Eq_2 s1_50;
	Eq_2 s5_56;
	Eq_2 s6_57;
	Eq_2 s8_59;
	Eq_2 s4_111;
	Eq_2 s3_121;
	Eq_2 ra_135 = httpc_init_connection_common.constprop.5(ra, ~0x0F, a3, a1, a6, s5, s6, s7, s8, s9, mstatus, dwLoc2C, dwLoc28, s2, s0, dwLoc18, dwLoc14, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_50, out a0_40, out a3, out a4, out a5, out s2, out s3_121, out s4_111, out s5_56, out s6_57, out s8_59, out mstatus);
	if (a0_40 != 0x00)
		goto l230862BA;
	Eq_2 a0_114;
	Eq_2 s1_107;
	if ((word32) *((word32) s2 + 6) == 0x00)
	{
		word32 s0_348;
		word32 s1_349;
		ra_135 = dns_gethostbyname(ra_135, s1_50, (word32) s4_111 + 4, s4_111, (word32) s4_111 + 4, s5_56, s6_57, s8_59, mstatus, dwLoc28, dwLoc14, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArgB8, dwArgF8, dwArg0138, out s0_348, out s1_349, out a0_114, out a3, out a4, out s2, out s3_121, out s4_111, out mstatus);
		s1_107 = a0_114;
		if (a0_114 != 0x00)
		{
			a5 = ~0x04;
			if (a0_114 != ~0x04)
			{
l230862B2:
				word32 s3_350;
				word32 s5_351;
				word32 s6_352;
				httpc_free_state(ra_135, s1_107, a0_114, a3, a4, s2, s3_121, s4_111, mstatus, s0, ra, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out a3, out a4, out a5, out s2, out s3_350, out s5_351, out s6_352);
				goto l230862BA;
			}
l230862EC:
			if (s3_121 != 0x00)
				*s3_121 = a5;
			goto l230862BA;
		}
	}
	a0_114 = httpc_get_internal_addr(s4_111, s2, a4, out a3, out a5);
	s1_107 = a0_114;
	if (a0_114 != 0x00)
		goto l230862B2;
	goto l230862EC;
}

// 230862F8: Register Eq_2 set_if(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out)
// Called from:
//      dhcpd_start
Eq_2 set_if(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArg0128, union Eq_2 & s1Out)
{
	Eq_2 s0_108 = a0;
	Eq_2 s2_15 = a2;
	Eq_2 s1_17 = a3;
	if (a1 != 0x00)
	{
		word32 a0_21;
		Eq_2 a3_23;
		Eq_2 a4_24;
		Eq_2 a5_25;
		Eq_2 s4_36;
		word32 s8_259;
		s0_108 = ip4addr_aton(a1, fp + ~0x13, out a0_21, out a3_23, out a4_24, out a5_25, out s4_36, out s8_259);
		if (a0_21 != 0x00)
			s0_108 = netif_set_ipaddr(ra, a3, s0_108, fp + ~0x13, a3_23, a4_24, a5_25, a2, s3, s4_36, s7, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArgA8, dwArg0128, out s1_17, out s2_15);
	}
	if (s2_15 != 0x00)
	{
		word32 a0_76;
		struct Eq_402345 * a4_79;
		struct Eq_402345 * a5_80;
		word32 s8_262;
		word32 a3_260;
		word32 s4_261;
		s0_108 = ip4addr_aton(s2_15, fp + ~0x13, out a0_76, out a3_260, out a4_79, out a5_80, out s4_261, out s8_262);
		if (a0_76 != 0x00)
			netif_set_gw(s0_108, fp + ~0x13, a4_79, a5_80);
	}
	if (s1_17 != 0x00)
	{
		word32 a0_102;
		struct Eq_402329 * a4_105;
		struct Eq_402329 * a5_106;
		word32 s4_264;
		word32 s8_265;
		word32 a3_263;
		s0_108 = ip4addr_aton(s1_17, fp + ~0x13, out a0_102, out a3_263, out a4_105, out a5_106, out s4_264, out s8_265);
		if (a0_102 != 0x00)
			netif_set_netmask(s0_108, fp + ~0x13, a4_105, a5_106);
	}
	s1Out = s1_17;
	return s0_108;
}

// 23086352: Register Eq_2 altcp_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      altcp_tcp_accept
//      altcp_tcp_new_ip_type
//      altcp_mbedtls_lower_accept
//      altcp_tls_wrap
Eq_2 altcp_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_13;
	word32 a2_62;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_14;
	Eq_2 s1_18 = memp_malloc(s1, 0x05, a3, a4, mstatus, out a0_13, out a2_62, out a3_16, out a4_17, out a5_14);
	if (a0_13 != 0x00)
	{
		word32 t1_63;
		word32 a0_64;
		word32 a2_65;
		ra = memset(ra, a0_13, 0x00, 44, out t1_63, out a0_64, out a1, out a2_65, out a3_16, out a4_17, out a5_14);
	}
	s1Out = s1_18;
	a1Out = a1;
	a2Out = dwArg10;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_14;
	return ra;
}

// 23086376: Register Eq_2 altcp_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_485595) a5, Register ptr32 mstatus, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_485595) a5Out)
// Called from:
//      altcp_tcp_err
//      altcp_tcp_close
//      altcp_mbedtls_lower_err
//      altcp_mbedtls_lower_accept
//      altcp_mbedtls_close
//      altcp_tls_wrap
Eq_2 altcp_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, struct Eq_485595 * a5, ptr32 mstatus, union Eq_2 & a1Out, union Eq_2 & a4Out, struct Eq_485595 & a5Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	Eq_2 a0_6 = a5->t0000;
	Eq_2 a1_17 = a0_6;
	if (a5 != null)
	{
		<anonymous> * a5_8 = a5->ptr0044;
		if (a5_8 != null)
		{
			struct Eq_487466 * sp_14;
			word32 s1_21;
			word32 s0_22;
			word32 tp_24;
			a5_8();
			word32 a2_25 = sp_14->dw0064;
			word32 t3_26 = sp_14->dw0020;
l23086392:
			struct Eq_485595 * a5_41;
			Eq_2 a4_45;
			word32 a2_83;
			word32 a0_82;
			word32 a3_84;
			Eq_2 s1_46 = memp_free(0x05, a1_17, a3, a4, mstatus, out a0_82, out a2_83, out a3_84, out a4_45, out a5_41);
			a1Out = a1_17;
			a4Out = a4_45;
			a5Out = a5_41;
			return s1_46;
		}
	}
	goto l23086392;
}

// 2308639C: Register Eq_2 altcp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_486972) a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_new
Eq_2 altcp_new_ip_type(Eq_2 ra, Eq_2 s1, struct Eq_486972 * a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	if (a0 != null)
	{
		<anonymous> * t1_8 = a0->ptr0000;
		if (t1_8 == null)
		{
			s1Out = s1;
			a0Out = 0x00;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s9Out = s9;
			s10Out = s10;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			ptr32 a0_12;
			Eq_2 ra_52;
			Eq_2 s1_53;
			Eq_2 s3_54;
			ptr32 mstatus_55;
			Eq_2 a4_56;
			Eq_2 a3_57;
			Eq_2 s4_58;
			word32 a2_60;
			word32 a6_61;
			word32 a7_62;
			ptr32 s10_63;
			word32 s11_64;
			ptr32 s2_65;
			word32 s5_66;
			word32 s6_67;
			word32 s8_68;
			ptr32 s9_69;
			word32 t0_70;
			word32 t3_71;
			word32 t4_72;
			word32 t5_73;
			word32 t6_74;
			word32 tp_75;
			t1_8();
			s1Out = s1_53;
			a0Out = a0_12;
			a3Out = a3_57;
			a4Out = a4_56;
			s2Out = s2_65;
			s3Out = s3_54;
			s4Out = s4_58;
			s9Out = s9_69;
			s10Out = s10_63;
			mstatusOut = mstatus_55;
			return ra_52;
		}
	}
	else
	{
		ptr32 a0_24;
		Eq_2 a3_27;
		Eq_2 a4_28;
		ptr32 mstatus_32;
		Eq_2 s1_34;
		ptr32 s2_37;
		Eq_2 s3_38;
		Eq_2 s4_39;
		ptr32 s9_44;
		word32 a1_159;
		word32 a5_160;
		word32 s6_161;
		word32 s7_162;
		word32 s8_163;
		Eq_2 ra_33 = altcp_tcp_new_ip_type(ra, s1, a1, a3, a4, s3, s4, s7, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgEC, dwArgF8, dwArg0108, dwArg0118, out s1_34, out a0_24, out a1_159, out a3_27, out a4_28, out a5_160, out s2_37, out s3_38, out s4_39, out s6_161, out s7_162, out s8_163, out s9_44, out mstatus_32);
		s1Out = s1_34;
		a0Out = a0_24;
		a3Out = a3_27;
		a4Out = a4_28;
		s2Out = s2_37;
		s3Out = s3_38;
		s4Out = s4_39;
		s9Out = s9_44;
		s10Out = s10_35;
		mstatusOut = mstatus_32;
		return ra_33;
	}
}

