pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230863B4: Register Eq_2 altcp_new(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_486972) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      httpc_init_connection_common.constprop.5
Eq_2 altcp_new(Eq_2 ra, Eq_2 s1, struct Eq_486972 * a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	ptr32 a3_19;
	ptr32 a4_20;
	ptr32 mstatus_23;
	ptr32 s1_25;
	ptr32 s10_26;
	ptr32 s2_28;
	ptr32 s3_29;
	ptr32 s4_30;
	ptr32 s9_35;
	Eq_2 ra_24 = altcp_new_ip_type(ra, s1, a0, 0x00, a3, a4, s3, s4, s7, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgEC, dwArgF8, dwArg0108, dwArg0118, out s1_25, out a0_14, out a3_19, out a4_20, out s2_28, out s3_29, out s4_30, out s9_35, out s10_26, out mstatus_23);
	s1Out = s1_25;
	a0Out = a0_14;
	a3Out = a3_19;
	a4Out = a4_20;
	s2Out = s2_28;
	s3Out = s3_29;
	s4Out = s4_30;
	s9Out = s9_35;
	s10Out = s10_26;
	mstatusOut = mstatus_23;
	return ra_24;
}

// 230863BA: void altcp_arg(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      tcp_accept_callback
//      bl_cipstart
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
//      altcp_mbedtls_setup_callbacks
//      altcp_mbedtls_close
void altcp_arg(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a1 + 8) = a0;
}

// 230863C0: void altcp_accept(Register (ptr32 Eq_472928) a0, Register (ptr32 Eq_472957) a1)
// Called from:
//      bl_tcpserver
//      altcp_mbedtls_listen
void altcp_accept(struct Eq_472928 * a0, struct Eq_472957 * a1)
{
	if (a0 != null)
		a1->ptr0010 = a0;
}

// 230863C6: void altcp_recv(Register Eq_2 a0, Register (ptr32 Eq_468051) a1)
// Called from:
//      tcp_connected_callback
//      tcp_accept_callback
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
//      altcp_mbedtls_setup_callbacks
//      altcp_mbedtls_close
void altcp_recv(Eq_2 a0, struct Eq_468051 * a1)
{
	if (a0 != 0x00)
		a1->t0018 = a0;
}

// 230863CC: void altcp_sent(Register Eq_2 a0, Register (ptr32 Eq_468057) a1)
// Called from:
//      tcp_connected_callback
//      tcp_accept_callback
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
//      altcp_mbedtls_setup_callbacks
//      altcp_mbedtls_close
void altcp_sent(Eq_2 a0, struct Eq_468057 * a1)
{
	if (a0 != 0x00)
		a1->t001C = a0;
}

// 230863D2: Register Eq_2 altcp_poll(Register Eq_2 a0, Register (ptr32 Eq_485717) a1, Register word32 a2, Register (ptr32 Eq_485595) a5, Register out (ptr32 Eq_485595) a5Out)
// Called from:
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
//      altcp_mbedtls_close
//      altcp_mbedtls_set_poll
Eq_2 altcp_poll(Eq_2 a0, struct Eq_485717 * a1, word32 a2, struct Eq_485595 * a5, struct Eq_485595 & a5Out)
{
	if (a0 != 0x00)
	{
		a0 = a5->t0000;
		a1->t0020 = a0;
		*((word32) a0 + 40) = (byte) a2;
		if (a5 != null)
		{
			Eq_2 t1_11 = a5->t0000;
			if (t1_11 != 0x00)
			{
				Eq_2 a0_14;
				struct Eq_485595 * a5_15;
				word32 t1_18;
				t1_11();
				a5Out = a5_15;
				return a0_14;
			}
		}
	}
	a5Out = a5;
	return a0;
}

// 230863EC: void altcp_err(Register Eq_2 a0, Register (ptr32 Eq_470499) a1)
// Called from:
//      tcp_accept_callback
//      bl_cipstart
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
//      altcp_mbedtls_setup_callbacks
//      altcp_mbedtls_close
void altcp_err(Eq_2 a0, struct Eq_470499 * a1)
{
	if (a0 != 0x00)
		a1->t0024 = a0;
}

// 230863F2: Register int32 altcp_recved(Register int32 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      cb_altcp_recv_fn
//      tcp_receive_callback
//      httpc_tcp_recv
//      altcp_mbedtls_recved
//      altcp_mbedtls_handle_rx_appldata
//      altcp_mbedtls_lower_recv
int32 altcp_recved(int32 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		a0 = (int32) *a5;
		if (a5 != 0x00)
		{
			<anonymous> * t1_7 = *((word32) a5 + 4);
			if (t1_7 != null)
			{
				int32 a0_9;
				Eq_2 a5_10;
				word32 t1_11;
				t1_7();
				a5Out = a5_10;
				return a0_9;
			}
		}
	}
	a5Out = a5;
	return a0;
}

// 23086404: Register (ptr32 Eq_472853) altcp_bind(Register (ptr32 Eq_472853) a0, Register (ptr32 Eq_472917) a5, Register out (ptr32 Eq_472917) a5Out)
// Called from:
//      bl_tcpserver
//      altcp_default_bind
struct Eq_472853 * altcp_bind(struct Eq_472853 * a0, struct Eq_472917 * a5, struct Eq_472917 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr0008;
			if (t1_7 != null)
			{
				struct Eq_472853 * a0_10;
				struct Eq_472917 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return (struct Eq_472853 *) ~0x05;
}

// 23086418: Register Eq_2 altcp_connect(Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      bl_cipstart
//      httpc_get_internal_addr
//      altcp_mbedtls_connect
Eq_2 altcp_connect(Eq_2 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = *a5;
		if (a5 != 0x00)
		{
			<anonymous> * t1_7 = *((word32) a5 + 0x0C);
			if (t1_7 != null)
			{
				Eq_2 a0_10;
				Eq_2 a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return ~0x05;
}

