pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308642C: Register Eq_2 altcp_listen_with_backlog_and_err(Register Eq_2 a0, Register Eq_2 a5)
// Called from:
//      bl_tcpserver
//      altcp_mbedtls_listen
Eq_2 altcp_listen_with_backlog_and_err(Eq_2 a0, Eq_2 a5)
{
	if (a0 == 0x00)
		return 0x00;
	word32 a0_6 = *a5;
	if (a5 == 0x00)
		return 0x00;
	<anonymous> * t1_7 = *((word32) a5 + 16);
	if (t1_7 == null)
		return 0x00;
	Eq_2 a0_10;
	word32 t1_12;
	t1_7();
	return a0_10;
}

// 23086440: Register (ptr32 Eq_485595) altcp_abort(Register Eq_2 a0, Register (ptr32 Eq_485595) a5)
// Called from:
//      httpc_free_state
//      altcp_mbedtls_abort
//      altcp_mbedtls_handle_rx_appldata
//      altcp_mbedtls_lower_recv
struct Eq_485595 * altcp_abort(Eq_2 a0, struct Eq_485595 * a5)
{
	if (a0 == 0x00)
		return a5;
	Eq_2 a0_6 = a5->t0000;
	if (a5 == null)
		return a5;
	<anonymous> * t1_7 = a5->ptr0014;
	if (t1_7 == null)
		return a5;
	struct Eq_485595 * a5_10;
	word32 t1_11;
	t1_7();
	return a5_10;
}

// 23086452: Register Eq_2 altcp_close(Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      tcp_connected_callback
//      tcp_receive_callback
//      tcp_accept_callback
//      bl_cipstart
//      bl_cipclose
//      bl_tcpserver
//      httpc_free_state
//      altcp_tls_new
//      altcp_mbedtls_close
//      altcp_mbedtls_lower_recv
Eq_2 altcp_close(Eq_2 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = *a5;
		if (a5 != 0x00)
		{
			<anonymous> * t1_7 = *((word32) a5 + 24);
			if (t1_7 != null)
			{
				Eq_2 a0_10;
				Eq_2 a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return ~0x05;
}

// 23086466: void altcp_shutdown(Register (ptr32 Eq_487783) a0, Register (ptr32 Eq_487784) a5)
// Called from:
//      altcp_default_shutdown
void altcp_shutdown(struct Eq_487783 * a0, struct Eq_487784 * a5)
{
	if (a0 == null)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr001C;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 2308647A: Register int32 altcp_write(Register int32 a0, Register (ptr32 Eq_470798) a5, Register out (ptr32 Eq_470798) a5Out)
// Called from:
//      tcp_send_data
//      httpc_tcp_connected
//      altcp_mbedtls_bio_send
int32 altcp_write(int32 a0, struct Eq_470798 * a5, struct Eq_470798 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr0020;
			if (t1_7 != null)
			{
				int32 a0_10;
				struct Eq_470798 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return ~0x05;
}

// 2308648E: Register (ptr32 Eq_486509) altcp_output(Register (ptr32 Eq_486509) a0, Register (ptr32 Eq_486510) a5)
// Called from:
//      httpc_tcp_connected
//      altcp_default_output
//      altcp_mbedtls_write
//      altcp_mbedtls_lower_recv
struct Eq_486509 * altcp_output(struct Eq_486509 * a0, struct Eq_486510 * a5)
{
	if (a0 == null)
		return (struct Eq_486509 *) ~0x05;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return (struct Eq_486509 *) ~0x05;
	<anonymous> * t1_7 = a5->ptr0024;
	if (t1_7 == null)
		return (struct Eq_486509 *) ~0x05;
	struct Eq_486509 * a0_10;
	word32 t1_12;
	t1_7();
	return a0_10;
}

// 230864A2: void altcp_mss(Register word32 a0, Register (ptr32 Eq_487836) a5)
// Called from:
//      altcp_mbedtls_mss
void altcp_mss(word32 a0, struct Eq_487836 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0028;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 230864B6: Register word32 altcp_sndbuf(Register word32 a0, Register (ptr32 Eq_487853) a5, Register out (ptr32 Eq_487853) a5Out)
// Called from:
//      altcp_mbedtls_sndbuf
word32 altcp_sndbuf(word32 a0, struct Eq_487853 * a5, struct Eq_487853 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr002C;
			if (t1_7 != null)
			{
				word32 a0_10;
				struct Eq_487853 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return 0x00;
}

// 230864CA: void altcp_sndqueuelen(Register word32 a0, Register (ptr32 Eq_487874) a5)
// Called from:
//      altcp_default_sndqueuelen
void altcp_sndqueuelen(word32 a0, struct Eq_487874 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0030;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 230864DE: void altcp_nagle_disable(Register word32 a0, Register (ptr32 Eq_487891) a5)
// Called from:
//      altcp_default_nagle_disable
void altcp_nagle_disable(word32 a0, struct Eq_487891 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0034;
	if (t1_7 == null)
		return;
	word32 t1_11;
	t1_7();
}

// 230864F0: void altcp_nagle_enable(Register word32 a0, Register (ptr32 Eq_487908) a5)
// Called from:
//      altcp_default_nagle_enable
void altcp_nagle_enable(word32 a0, struct Eq_487908 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0038;
	if (t1_7 == null)
		return;
	word32 t1_11;
	t1_7();
}

// 23086502: void altcp_nagle_disabled(Register word32 a0, Register (ptr32 Eq_487925) a5)
// Called from:
//      altcp_default_nagle_disabled
void altcp_nagle_disabled(word32 a0, struct Eq_487925 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr003C;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 23086516: void altcp_setprio(Register word32 a0, Register (ptr32 Eq_487942) a5)
// Called from:
//      altcp_default_setprio
void altcp_setprio(word32 a0, struct Eq_487942 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0040;
	if (t1_7 == null)
		return;
	word32 t1_11;
	t1_7();
}

// 23086528: void altcp_get_tcp_addrinfo(Register word32 a0, Register (ptr32 Eq_487959) a5)
// Called from:
//      altcp_default_get_tcp_addrinfo
void altcp_get_tcp_addrinfo(word32 a0, struct Eq_487959 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0048;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 2308653C: void altcp_get_ip(Register Eq_2 a0, Register (ptr32 Eq_470295) a5)
// Called from:
//      tcp_accept_callback
//      altcp_default_get_ip
void altcp_get_ip(Eq_2 a0, struct Eq_470295 * a5)
{
	if (a0 == 0x00)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr004C;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 23086550: Register Eq_2 altcp_get_port(Register Eq_2 a0, Register (ptr32 Eq_470299) a5, Register out (ptr32 Eq_470299) a5Out)
// Called from:
//      tcp_accept_callback
//      altcp_default_get_port
Eq_2 altcp_get_port(Eq_2 a0, struct Eq_470299 * a5, struct Eq_470299 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr0050;
			if (t1_7 != null)
			{
				Eq_2 a0_10;
				struct Eq_470299 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return 0x00;
}

// 23086564: void altcp_default_bind(Register (ptr32 Eq_488008) a0, Register (ptr32 Eq_472917) a5)
void altcp_default_bind(struct Eq_488008 * a0, struct Eq_472917 * a5)
{
	if (a0 == null)
		return;
	struct Eq_472853 * a0_5 = a0->ptr0004;
	if (a0_5 == null)
		return;
	word32 a5_19;
	altcp_bind(a0_5, a5, out a5_19);
}

// 23086572: void altcp_default_shutdown(Register (ptr32 Eq_487783) a0, Register word32 a1, Register word32 a2, Register (ptr32 Eq_488025) a4)
void altcp_default_shutdown(struct Eq_487783 * a0, word32 a1, word32 a2, struct Eq_488025 * a4)
{
	if (a0 == null)
		return;
	if (a1 != 0x00 && a2 != 0x00)
	{
		a0 = a4->ptr0000;
		if (a4 != null)
		{
			<anonymous> * t1_10 = a4->ptr0018;
			if (t1_10 != null)
			{
				word32 t1_24;
				t1_10();
				return;
			}
		}
	}
	struct Eq_487784 * a5_13 = a0->ptr0004;
	if (a0 == null)
		return;
	altcp_shutdown(a0, a5_13);
}

// 23086594: void altcp_default_output(Register (ptr32 Eq_488053) a0, Register (ptr32 Eq_486510) a5)
void altcp_default_output(struct Eq_488053 * a0, struct Eq_486510 * a5)
{
	if (a0 == null)
		return;
	struct Eq_486509 * a0_5 = a0->ptr0004;
	if (a0_5 == null)
		return;
	altcp_output(a0_5, a5);
}

