pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230865A2: void altcp_default_sndbuf(Register (ptr32 Eq_488065) a0, Register (ptr32 Eq_487853) a5)
// Called from:
//      altcp_mbedtls_sndbuf
void altcp_default_sndbuf(struct Eq_488065 * a0, struct Eq_487853 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	word32 a5_19;
	altcp_sndbuf(a0_5, a5, out a5_19);
}

// 230865B0: void altcp_default_sndqueuelen(Register (ptr32 Eq_488080) a0, Register (ptr32 Eq_487874) a5)
void altcp_default_sndqueuelen(struct Eq_488080 * a0, struct Eq_487874 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	altcp_sndqueuelen(a0_5, a5);
}

// 230865BE: void altcp_default_nagle_disable(Register (ptr32 Eq_488093) a0, Register (ptr32 Eq_487891) a5)
void altcp_default_nagle_disable(struct Eq_488093 * a0, struct Eq_487891 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	altcp_nagle_disable(a0_5, a5);
}

// 230865CA: void altcp_default_nagle_enable(Register (ptr32 Eq_488106) a0, Register (ptr32 Eq_487908) a5)
void altcp_default_nagle_enable(struct Eq_488106 * a0, struct Eq_487908 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	altcp_nagle_enable(a0_5, a5);
}

// 230865D6: void altcp_default_nagle_disabled(Register (ptr32 Eq_488119) a0, Register (ptr32 Eq_487925) a5)
void altcp_default_nagle_disabled(struct Eq_488119 * a0, struct Eq_487925 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	altcp_nagle_disabled(a0_5, a5);
}

// 230865E4: void altcp_default_setprio(Register (ptr32 Eq_488132) a0, Register (ptr32 Eq_487942) a5)
void altcp_default_setprio(struct Eq_488132 * a0, struct Eq_487942 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	altcp_setprio(a0_5, a5);
}

// 230865F0: void altcp_default_get_tcp_addrinfo(Register (ptr32 Eq_488145) a0, Register (ptr32 Eq_487959) a5)
void altcp_default_get_tcp_addrinfo(struct Eq_488145 * a0, struct Eq_487959 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	if (a0_5 == 0x00)
		return;
	altcp_get_tcp_addrinfo(a0_5, a5);
}

// 230865FE: void altcp_default_get_ip(Register (ptr32 Eq_488158) a0, Register (ptr32 Eq_470295) a5)
void altcp_default_get_ip(struct Eq_488158 * a0, struct Eq_470295 * a5)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t0004;
	if (a0_5 == 0x00)
		return;
	altcp_get_ip(a0_5, a5);
}

// 2308660C: void altcp_default_get_port(Register (ptr32 Eq_488170) a0, Register (ptr32 Eq_470299) a5)
void altcp_default_get_port(struct Eq_488170 * a0, struct Eq_470299 * a5)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t0004;
	if (a0_5 == 0x00)
		return;
	word32 a5_19;
	altcp_get_port(a0_5, a5, out a5_19);
}

// 2308661A: Register Eq_2 altcp_tls_new(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_cipstart
Eq_2 altcp_tls_new(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 s0_48;
	Eq_2 a0_20;
	Eq_2 a3_23;
	ptr32 mstatus_28;
	Eq_2 a4_133;
	ptr32 a1_131;
	Eq_2 a5_134;
	Eq_2 s1_139;
	Eq_2 s2_142;
	Eq_2 s3_143;
	Eq_2 s4_144;
	ptr32 s6_146;
	ptr32 s7_147;
	ptr32 s8_148;
	ptr32 s9_149;
	Eq_2 ra_138 = altcp_tcp_new_ip_type(ra, s1, a1, a3, a4, s3, s4, s7, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg34, dwArg38, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s1_139, out a0_20, out a1_131, out a3_23, out a4_133, out a5_134, out s2_142, out s3_143, out s4_144, out s6_146, out s7_147, out s8_148, out s9_149, out mstatus_28);
	if (a0_20 != 0x00)
	{
		ptr32 a0_52;
		ra_138 = altcp_tls_wrap(ra_138, a0, a0_20, a3_23, a4_133, s2_142, s3_143, s4_144, mstatus_28, dwArg14, dwArg68, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_139, out a0_52, out a1_131, out a4_133, out a5_134, out s2_142, out s3_143, out s4_144, out s6_146, out s7_147, out s8_148, out s9_149);
		s0_48 = a0_52;
		if (a0_52 == 0x00)
			altcp_close(s1_139, a5_134, out a5_134);
	}
	else
		s0_48 = 0x00;
	s1Out = s1_139;
	a0Out = s0_48;
	a1Out = a1_131;
	a4Out = a4_133;
	a5Out = a5_134;
	s2Out = s2_142;
	s3Out = s3_143;
	s4Out = s4_144;
	s6Out = s6_146;
	s7Out = s7_147;
	s8Out = s8_148;
	s9Out = s9_149;
	mstatusOut = mstatus_28;
	return ra_138;
}

// 2308664E: void altcp_tcp_connected(Register (ptr32 Eq_488276) a0)
void altcp_tcp_connected(struct Eq_488276 * a0)
{
	if (a0 == null)
		return;
	<anonymous> * t1_6 = a0->ptr0014;
	if (t1_6 == null)
		return;
	word32 t1_12;
	t1_6();
}

// 23086662: void altcp_tcp_sent(Register (ptr32 Eq_488286) a0)
void altcp_tcp_sent(struct Eq_488286 * a0)
{
	if (a0 == null)
		return;
	<anonymous> * t1_6 = a0->ptr001C;
	if (t1_6 == null)
		return;
	word32 t1_12;
	t1_6();
}

// 23086676: void altcp_tcp_poll(Register (ptr32 Eq_488296) a0)
void altcp_tcp_poll(struct Eq_488296 * a0)
{
	if (a0 == null)
		return;
	<anonymous> * t1_6 = a0->ptr0020;
	if (t1_6 == null)
		return;
	word32 t1_12;
	t1_6();
}

// 2308668A: void altcp_tcp_mss(Register word32 a0)
void altcp_tcp_mss(word32 a0)
{
	if (a0 == 0x00)
		;
}

