pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23086698: void altcp_tcp_sndbuf(Register word32 a0)
void altcp_tcp_sndbuf(word32 a0)
{
	if (a0 == 0x00)
		;
}

// 230866A6: void altcp_tcp_sndqueuelen(Register word32 a0)
void altcp_tcp_sndqueuelen(word32 a0)
{
	if (a0 == 0x00)
		;
}

// 230866B4: void altcp_tcp_nagle_disable(Register word32 a0, Register (ptr32 Eq_488316) a5)
void altcp_tcp_nagle_disable(word32 a0, struct Eq_488316 * a5)
{
	if (a0 != 0x00 && a5 != null)
		a5->w001A = (word16) ((word32) a5->w001A | 64);
}

// 230866C8: void altcp_tcp_nagle_enable(Register word32 a0, Register (ptr32 Eq_488332) a5)
void altcp_tcp_nagle_enable(word32 a0, struct Eq_488332 * a5)
{
	if (a0 != 0x00 && a5 != null)
		a5->w001A = (word16) ((word32) a5->w001A & -65);
}

// 230866DC: void altcp_tcp_nagle_disabled(Register word32 a0, Register word32 a5)
void altcp_tcp_nagle_disabled(word32 a0, word32 a5)
{
	if (a0 == 0x00 || a5 == 0x00)
		;
}

// 230866F2: void altcp_tcp_dealloc()
void altcp_tcp_dealloc()
{
}

// 230866F4: void altcp_tcp_get_ip(Register (ptr32 Eq_488353) a0, Register word32 a1)
void altcp_tcp_get_ip(struct Eq_488353 * a0, word32 a1)
{
	if (a0 != null)
		a0->dw000C == 0x00;
}

// 23086700: void altcp_tcp_get_port(Register word32 a0, Register word32 a1, Register word32 a5)
void altcp_tcp_get_port(word32 a0, word32 a1, word32 a5)
{
	if (a0 == 0x00 || a5 == 0x00)
		return;
	if (a1 == 0x00)
		;
}

// 2308671A: Register Eq_2 altcp_tcp_setup_callbacks(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a1Out)
// Called from:
//      altcp_tcp_close
//      altcp_tcp_accept
//      altcp_tcp_new_ip_type
Eq_2 altcp_tcp_setup_callbacks(Eq_2 a0, Eq_2 a1, ptr32 & a1Out)
{
	tcp_arg(a1, a0);
	tcp_recv(a1, 0x230868A0);
	tcp_sent(a1, 587753058);
	tcp_err(a1, 587753306);
	a1Out = 587753306;
	return a1;
}

// 2308675A: void altcp_tcp_err(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_485595) a5, Register ptr32 mstatus)
void altcp_tcp_err(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_485595 * a5, ptr32 mstatus)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_10 = a5->t0024;
	*((word32) a0_10 + 0x0C) = 0x00;
	Eq_2 s0_12 = a0_10;
	if (a5 != null)
	{
		word32 a2_19;
		word32 a1_48;
		word32 s1_49;
		word32 tp_50;
		a5();
	}
	word32 a4_71;
	word32 a1_70;
	word32 a5_72;
	altcp_free(ra, s0_12, a3, a4, a5, mstatus, out a1_70, out a4_71, out a5_72);
}

// 2308677E: void altcp_tcp_get_tcp_addrinfo(Register (ptr32 Eq_488420) a0, Register word32 a1, Register (ptr32 Eq_407055) a2, Register (ptr32 word16) a3, Register (ptr32 Eq_407059) a5)
void altcp_tcp_get_tcp_addrinfo(struct Eq_488420 * a0, word32 a1, struct Eq_407055 * a2, word16 * a3, struct Eq_407059 * a5)
{
	if (a0 == null)
		return;
	struct Eq_407055 * a0_6 = a0->ptr000C;
	tcp_tcp_get_tcp_addrinfo(a0_6, a1, a2, a3, a5);
}

// 2308678A: void altcp_tcp_setprio(Register (ptr32 Eq_488434) a0, Register word32 a1)
void altcp_tcp_setprio(struct Eq_488434 * a0, word32 a1)
{
	if (a0 == null)
		return;
	struct Eq_406514 * a0_5 = a0->ptr000C;
	tcp_setprio(a0_5, a1);
}

// 23086794: void altcp_tcp_output(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_488447) a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118)
void altcp_tcp_output(Eq_2 ra, Eq_2 s1, struct Eq_488447 * a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 s0_108;
	word32 s1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 s2_116;
	word32 s3_117;
	word32 s4_118;
	word32 s5_119;
	word32 s6_120;
	word32 s7_121;
	word32 s8_122;
	word32 s9_123;
	word32 s10_124;
	word32 s11_125;
	word32 mstatus_126;
	tcp_output(ra, s1, a0_6, a2, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_108, out s1_109, out a0_110, out a1_111, out a2_112, out a3_113, out a4_114, out a5_115, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120, out s7_121, out s8_122, out s9_123, out s10_124, out s11_125, out mstatus_126);
}

// 230867A0: void altcp_tcp_write(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_488513) a0, Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Register ptr32 mstatus, Stack word32 dwArg04, Stack Eq_2 dwArg19, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8)
void altcp_tcp_write(Eq_2 ra, Eq_2 s1, struct Eq_488513 * a0, Eq_2 a1, Eq_2 a2, ui32 a3, ptr32 mstatus, word32 dwArg04, Eq_2 dwArg19, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 a0_104;
	word32 a1_105;
	word32 a2_106;
	word32 a3_107;
	word32 a5_108;
	word32 s2_109;
	word32 s3_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	word32 mstatus_116;
	tcp_write(ra, s1, a0_6, a1, a2, a3, mstatus, dwArg04, dwArg19, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a0_104, out a1_105, out a2_106, out a3_107, out a5_108, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115, out mstatus_116);
}

// 230867AC: void altcp_tcp_shutdown(Register Eq_2 ra, Register (ptr32 Eq_488563) a0, Register Eq_2 a1, Register ui32 a2, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void altcp_tcp_shutdown(Eq_2 ra, struct Eq_488563 * a0, Eq_2 a1, ui32 a2, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 s1_115;
	word32 a0_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 s3_120;
	word32 s4_121;
	word32 s5_122;
	word32 s6_123;
	word32 s7_124;
	word32 mstatus_125;
	tcp_shutdown(ra, a0_6, a1, a2, s4, s7, mstatus, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, dwArg0128, out s1_115, out a0_116, out a3_117, out a4_118, out a5_119, out s3_120, out s4_121, out s5_122, out s6_123, out s7_124, out mstatus_125);
}

// 230867B8: void altcp_tcp_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_485595) a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void altcp_tcp_close(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_485595 * a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	if (a0 == 0x00)
		return;
	Eq_2 s1_17 = *((word32) s0 + 0x0C);
	if (s0 != 0x00)
	{
		tcp_arg(s0, 0x00);
		tcp_recv(s0, 0x00);
		tcp_sent(s0, 0x00);
		tcp_err(s0, 0x00);
		Eq_2 a2_27 = (word32) *((word32) s0 + 29);
		tcp_poll(s0, 0x00, a2_27);
		word32 a0_35;
		Eq_2 s3_49;
		word32 a1_192;
		word32 s2_193;
		word32 s4_194;
		word32 s5_195;
		word32 s6_196;
		word32 s7_197;
		word32 s8_198;
		word32 s9_199;
		word32 s10_200;
		word32 s11_201;
		ra = tcp_close(ra, s0, a2_27, a3, s4, s7, mstatus, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s1_17, out a0_35, out a1_192, out a3, out a4, out a5, out s2_193, out s3_49, out s4_194, out s5_195, out s6_196, out s7_197, out s8_198, out s9_199, out s10_200, out s11_201, out mstatus);
		if (a0_35 != 0x00)
		{
			word32 a1_202;
			altcp_tcp_setup_callbacks(s1_17, s0, out a1_202);
			tcp_poll(s0, s3_49, (word32) *((word32) s0 + 29));
			return;
		}
		*((word32) s1_17 + 0x0C) = 0x00;
	}
	word32 a1_189;
	word32 a4_190;
	word32 a5_191;
	altcp_free(ra, s1_17, a3, a4, a5, mstatus, out a1_189, out a4_190, out a5_191);
}

// 2308683A: void altcp_tcp_abort(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_488741) a0, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void altcp_tcp_abort(Eq_2 ra, Eq_2 s1, struct Eq_488741 * a0, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t000C;
	if (a0_5 == 0x00)
		return;
	word32 mstatus_156;
	word32 s11_155;
	word32 s10_154;
	word32 s9_153;
	word32 s7_152;
	word32 s6_151;
	word32 s5_150;
	word32 s4_149;
	word32 s2_147;
	word32 s3_148;
	word32 a5_146;
	word32 a4_145;
	word32 a3_144;
	word32 a1_143;
	word32 a0_142;
	word32 s1_141;
	word32 s0_140;
	tcp_abort(ra, s1, a0_5, a3, s3, s4, s7, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArg48, dwArg58, dwArg74, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s0_140, out s1_141, out a0_142, out a1_143, out a3_144, out a4_145, out a5_146, out s2_147, out s3_148, out s4_149, out s5_150, out s6_151, out s7_152, out s9_153, out s10_154, out s11_155, out mstatus_156);
}

// 23086846: void altcp_tcp_listen(Register Eq_2 s1, Register (ptr32 Eq_488809) a0, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28)
void altcp_tcp_listen(Eq_2 s1, struct Eq_488809 * a0, byte * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28)
{
	if (a0 == null)
		return;
	word32 a2_66;
	word32 a3_67;
	word32 a4_68;
	word32 a5_69;
	Eq_2 a0_16 = tcp_listen_with_backlog_and_err(s1, a0->t000C, a2, a3, a4, mstatus, dwArg24, dwArg28, out a2_66, out a3_67, out a4_68, out a5_69);
	if (a0_16 == 0x00)
		return;
	*((word32) a0_16 + 0x0C) = a0;
	tcp_accept(a0_16, &g_t230868DC);
}

// 23086874: void altcp_tcp_connect(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_488842) a0, Register word32 a1, Register Eq_2 a2, Register (ptr32 Eq_488845) a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void altcp_tcp_connect(Eq_2 ra, Eq_2 s1, struct Eq_488842 * a0, word32 a1, Eq_2 a2, struct Eq_488845 * a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	a3->ptr0014 = a0;
	Eq_2 a0_7 = a0->t000C;
	word32 s1_113;
	word32 a0_114;
	word32 a4_115;
	word32 a5_116;
	word32 mstatus_117;
	tcp_connect(ra, s1, a0_7, a1, a2, 587753038, s7, mstatus, dwArg04, dwArg24, dwArg38, dwArg48, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArg0118, out s1_113, out a0_114, out a4_115, out a5_116, out mstatus_117);
}

