pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308688A: void altcp_tcp_bind(Register Eq_2 s1, Register (ptr32 Eq_488888) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44)
void altcp_tcp_bind(Eq_2 s1, struct Eq_488888 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg44)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 a4_52;
	tcp_bind(s1, a0_6, a1, a2, a5, mstatus, dwArg24, dwArg44, out a4_52);
}

// 23086896: void altcp_tcp_recved(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_488907) a0, Register word32 a1, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118)
void altcp_tcp_recved(Eq_2 ra, Eq_2 s1, struct Eq_488907 * a0, word32 a1, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t000C;
	word32 s0_108;
	word32 s1_109;
	word32 a0_110;
	word32 a3_111;
	word32 a4_112;
	word32 a5_113;
	word32 s3_114;
	word32 s4_115;
	word32 s7_116;
	word32 s9_117;
	word32 s10_118;
	word32 s11_119;
	word32 mstatus_120;
	tcp_recved(ra, s1, a0_5, a1, s7, mstatus, dwArg10, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_108, out s1_109, out a0_110, out a3_111, out a4_112, out a5_113, out s3_114, out s4_115, out s7_116, out s9_117, out s10_118, out s11_119, out mstatus_120);
}

// 230868A0: void altcp_tcp_recv(Register Eq_2 ra, Register (ptr32 Eq_488961) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack word32 dwArg10, Stack Eq_2 dwArg0118)
void altcp_tcp_recv(Eq_2 ra, struct Eq_488961 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, word32 dwArg10, Eq_2 dwArg0118)
{
	if (a0 != null)
	{
		<anonymous> * t1_8 = a0->ptr0018;
		if (t1_8 != null)
		{
			word32 t1_57;
			word32 s0_63;
			word32 t3_64;
			word32 tp_65;
			word32 a5_66;
			word32 s1_67;
			word32 s2_68;
			word32 s3_69;
			word32 a6_70;
			word32 a7_71;
			word32 s5_72;
			word32 s6_73;
			word32 s8_74;
			word32 t0_75;
			word32 t4_76;
			word32 t5_77;
			word32 t6_78;
			t1_8();
			return;
		}
	}
	if (a2 == 0x00)
		return;
	word32 mstatus_162;
	word32 s8_161;
	word32 s6_160;
	word32 s5_159;
	word32 s4_158;
	word32 s3_157;
	word32 s2_156;
	word32 a7_155;
	word32 a5_154;
	word32 a4_153;
	word32 a3_152;
	word32 a2_151;
	word32 a1_150;
	word32 a0_149;
	word32 s1_148;
	word32 s0_147;
	pbuf_free(ra, a2, a3, a4, s4, mstatus, dwArg0118, out s0_147, out s1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_153, out a5_154, out a7_155, out s2_156, out s3_157, out s4_158, out s5_159, out s6_160, out s8_161, out mstatus_162);
}

// 230868C8: void altcp_tcp_set_poll(Register (ptr32 Eq_489030) a0, Register Eq_2 a1)
void altcp_tcp_set_poll(struct Eq_489030 * a0, Eq_2 a1)
{
	if (a0 == null)
		return;
	Eq_2 a0_7 = a0->t000C;
	tcp_poll(a0_7, 587753078, a1);
}

// 230868DC: void altcp_tcp_accept(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_489048) a5, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg28, Stack word32 dwArg48)
void altcp_tcp_accept(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, struct Eq_489048 * a5, ptr32 mstatus, word32 dwArg00, word32 dwArg04, word32 dwArg28, word32 dwArg48)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_6 = a5->t0010;
	if (a5 == null)
		return;
	word32 a3_28;
	word32 a4_29;
	word32 a5_142;
	word32 a2_141;
	word32 a1_140;
	word32 s1_139;
	Eq_2 ra_34 = altcp_alloc(ra, s1, a3, a4, mstatus, out s1_139, out a1_140, out a2_141, out a3_28, out a4_29, out a5_142);
	if (a0_6 == 0x00)
		return;
	word32 a1_143;
	word32 a0_46 = altcp_tcp_setup_callbacks(a0_6, a1, out a1_143);
	*((word32) a0_6 + 0x0C) = a1;
	g_t230C6A40 = a0_6;
	word32 t1_72;
	word32 tp_80;
	word32 t0_81;
	(*((word32) a0_6 + 16))();
}

// 2308693C: Register Eq_2 altcp_tcp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_471499) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_cipstart
//      bl_tcpserver
//      altcp_new
//      altcp_tls_new
Eq_2 altcp_tcp_new_ip_type(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, struct Eq_471499 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a0_17;
	Eq_2 a4_142;
	Eq_2 a3_141;
	ptr32 a1_140;
	ptr32 a5_143;
	ptr32 mstatus_146;
	Eq_2 s1_148;
	struct Eq_471499 * s2_151;
	ptr32 s3_152;
	Eq_2 s4_153;
	ptr32 s6_155;
	Eq_2 s7_156;
	ptr32 s8_157;
	ptr32 s9_158;
	Eq_2 ra_147 = tcp_new_ip_type(ra, s1, a1, a3, a4, s3, s4, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgF8, out s1_148, out a0_17, out a1_140, out a3_141, out a4_142, out a5_143, out s2_151, out s3_152, out s4_153, out s6_155, out s7_156, out s8_157, out s9_158, out mstatus_146);
	Eq_2 s0_46 = 0x00;
	if (a0_17 != 0x00)
	{
		Eq_2 a2_48;
		word32 a1_179;
		word32 a5_180;
		ra_147 = altcp_alloc(ra_147, a0_17, a3_141, a4_142, mstatus_146, out s1_148, out a1_179, out a2_48, out a3_141, out a4_142, out a5_180);
		s0_46 = a0_17;
		if (a0_17 != 0x00)
		{
			altcp_tcp_setup_callbacks(a0_17, s1_148, out a1_140);
			*((word32) s1_148 + 0x0C) = a0_17;
			g_t230C6A40 = a0_17;
			a5_143 = 0x230C6A40;
		}
		else
		{
			word32 a0_181;
			word32 s5_182;
			word32 s10_183;
			word32 s11_184;
			ra_147 = tcp_close(ra_147, s1_148, a2_48, a3_141, s4_153, s7_156, mstatus_146, dwArg04, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArgEC, dwArgF8, dwArg0108, dwArg0118, out s1_148, out a0_181, out a1_140, out a3_141, out a4_142, out a5_143, out s2_151, out s3_152, out s4_153, out s5_182, out s6_155, out s7_156, out s8_157, out s9_158, out s10_183, out s11_184, out mstatus_146);
		}
	}
	s1Out = s1_148;
	a0Out = s0_46;
	a1Out = a1_140;
	a3Out = a3_141;
	a4Out = a4_142;
	a5Out = a5_143;
	s2Out = s2_151;
	s3Out = s3_152;
	s4Out = s4_153;
	s6Out = s6_155;
	s7Out = s7_156;
	s8Out = s8_157;
	s9Out = s9_158;
	mstatusOut = mstatus_146;
	return ra_147;
}

// 2308697C: void dummy_rng(Register ptr32 a1, Register int32 a2)
void dummy_rng(ptr32 a1, int32 a2)
{
	int32 a0_5 = g_dw4200F710;
	word32 a3_18 = 0x00;
	int32 a5_10;
	for (a5_10 = 0x00; a5_10 != a2; ++a5_10)
	{
		a1 + a5_10 = (byte *) (byte) (a0_5 + 1 + a5_10);
		a3_18 = 0x01;
	}
	word32 * a5_20 = a5_10 + a0_5;
	if (a3_18 != 0x00)
		*a5_20 = 0x4200F710;
}

// 230869B0: void altcp_mbedtls_lower_err(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_485595) a5, Register ptr32 mstatus)
void altcp_mbedtls_lower_err(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_485595 * a5, ptr32 mstatus)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_10 = a5->t0024;
	*((word32) a0_10 + 4) = 0x00;
	Eq_2 s0_12 = a0_10;
	if (a5 != null)
	{
		word32 a2_19;
		word32 a1_48;
		word32 s1_49;
		word32 tp_50;
		a5();
	}
	word32 a4_71;
	word32 a1_70;
	word32 a5_72;
	altcp_free(ra, s0_12, a3, a4, a5, mstatus, out a1_70, out a4_71, out a5_72);
}

// 230869D4: void altcp_mbedtls_bio_recv(Register Eq_2 ra, Register (ptr32 Eq_489236) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void altcp_mbedtls_bio_recv(Eq_2 ra, struct Eq_489236 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	struct Eq_489247 * s2_113 = a0->ptr000C;
	if (s2_113 != null)
	{
		Eq_2 s1_16 = s2_113->t00C4;
		if (s1_16 == 0x00)
		{
l23086A04:
			ui32 a5_130 = (word32) s2_113->t00CC;
			s2_113->t00C4.u0 = 0x00;
			goto l23086A1C;
		}
		Eq_2 a2_19 = (word32) *((word32) s1_16 + 0x0A);
		if (a2_19 == 0x00)
		{
			s1_16 = *a2;
			if (a2 == 0x00)
			{
				word32 s0_279;
				word32 s1_280;
				word32 a0_281;
				word32 a1_282;
				word32 a2_283;
				word32 a3_284;
				word32 a4_285;
				word32 a5_286;
				word32 a7_287;
				word32 s3_288;
				word32 s4_289;
				word32 s5_290;
				word32 s6_291;
				word32 s8_292;
				word32 mstatus_293;
				pbuf_free(ra, s1_16, a3, a4, s4, mstatus, dwArg0118, out s0_279, out s1_280, out a0_281, out a1_282, out a2_283, out a3_284, out a4_285, out a5_286, out a7_287, out s2_113, out s3_288, out s4_289, out s5_290, out s6_291, out s8_292, out mstatus_293);
				goto l23086A04;
			}
		}
		else if (a2 < a2_19)
			a2_19 = (word32) (word16) a2;
		Eq_2 a0_29;
		Eq_2 a2_30;
		Eq_2 s4_33;
		Eq_2 s1_36;
		word32 a3_272;
		word32 a1_271;
		word32 a4_273;
		word32 a5_274;
		word32 s3_275;
		word32 s8_276;
		struct Eq_489296 * s2_37;
		pbuf_copy_partial(s1_16, a1, a2_19, 0x00, out s1_36, out a0_29, out a1_271, out a2_30, out a3_272, out a4_273, out a5_274, out s2_37, out s3_275, out s4_33, out s8_276);
		Eq_2 a4_54;
		Eq_2 a3_55;
		word32 a1_277;
		word32 a5_278;
		pbuf_remove_header(s1_36, a0_29, a2_30, out a1_277, out a3_55, out a4_54, out a5_278);
		Eq_2 s0_50 = a0_29;
		Eq_2 a5_58 = (word32) *((word32) s1_36 + 0x0A);
		if (a5_58 == 0x00)
		{
			Eq_2 s1_59 = *a5_58;
			s2_37->t00C4 = a5_58;
			*s1_59 = 0x00;
			word32 s1_294;
			word32 a0_295;
			word32 a1_296;
			word32 a2_297;
			word32 a3_298;
			word32 a4_299;
			word32 a5_300;
			word32 a7_301;
			word32 s3_302;
			word32 s4_303;
			word32 s5_304;
			word32 s6_305;
			word32 s8_306;
			word32 mstatus_307;
			pbuf_free(ra, s1_59, a3_55, a4_54, s4_33, mstatus, dwArg0118, out s0_50, out s1_294, out a0_295, out a1_296, out a2_297, out a3_298, out a4_299, out a5_300, out a7_301, out s2_37, out s3_302, out s4_303, out s5_304, out s6_305, out s8_306, out mstatus_307);
		}
		s2_37->dw00D4 = (word32) s0_50 + s2_37->dw00D4;
	}
l23086A1C:
	0x00 = dwArg38;
}

// 23086A6E: Register Eq_2 altcp_mbedtls_setup_callbacks(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      altcp_mbedtls_setup
//      altcp_mbedtls_close
Eq_2 altcp_mbedtls_setup_callbacks(Eq_2 a0, Eq_2 a1)
{
	altcp_arg(a1, a0);
	altcp_recv(a1, &g_t230872F4);
	altcp_sent(a1, &g_t23086F94);
	altcp_err(a1, &g_t230869B0);
	return 0x230869B0;
}

// 23086AAE: Register Eq_2 altcp_mbedtls_setup(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack word32 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out)
// Called from:
//      altcp_mbedtls_lower_accept
//      altcp_tls_wrap
Eq_2 altcp_mbedtls_setup(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, word32 dwArg18, Eq_2 dwArg44, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0F;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		return ra;
	}
	else
	{
		Eq_2 a0_26;
		Eq_2 a1_110;
		Eq_2 a3_112;
		Eq_2 a4_113;
		ptr32 a5_102;
		Eq_2 s1_118;
		Eq_2 s3_120;
		ptr32 s6_123;
		Eq_2 ra_195 = altcp_mbedtls_alloc(ra, a3, a4, s2, mstatus, s4, dwArg44, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0138, out s1_118, out a0_26, out a1_110, out a3_112, out a4_113, out a5_102, out s3_120, out s6_123);
		Eq_2 s2_119 = a0_26;
		ptr32 a0_106 = ~0x00;
		if (a0_26 != 0x00)
		{
			Eq_2 a3_56;
			Eq_2 a4_57;
			Eq_2 a5_58;
			word32 a0_64;
			Eq_2 a3_67;
			Eq_2 a4_68;
			Eq_2 s4_78;
			ra_195 = mbedtls_ssl_setup(mbedtls_ssl_init(ra_195, (word32) a0_26 + 4, out a3_56, out a4_57, out a5_58), (word32) a0_26 + 4, s1_118, a3_56, a4_57, a5_58, mstatus, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s1_118, out a0_64, out a3_67, out a4_68, out s2_119, out s3_120, out s4_78, out s6_123, out s7, out s9);
			if (a0_64 != 0x00)
			{
				s1_118 = altcp_mbedtls_free(s2_119, a3_67, a4_68, s2_119, s3_120, s4_78, mstatus, s4, s2, dwArg04, s3, dwArg84, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a1_110, out a3_112, out a4_113, out a5_102, out s2_119, out s3_120, out s6_123);
				a0_106 = ~0x00;
			}
			else
			{
				mbedtls_ssl_set_bio(s4_78, a1, &g_t23086F1A, &g_t230869B0.t0024, null);
				a1_110 = altcp_mbedtls_setup_callbacks(a1, s3_120);
				*((word32) a1 + 4) = s3_120;
				g_t230C6A94 = a1;
				*((word32) a1 + 0x0C) = s2_119;
				a4_113.u0 = 0x00;
				a3_112.u0 = 587753940;
				a5_102 = 588016276;
				a0_106 = 0x00;
			}
		}
		s0Out = s1;
		s1Out = s1_118;
		a0Out = a0_106;
		a1Out = a1_110;
		a3Out = a3_112;
		a4Out = a4_113;
		a5Out = a5_102;
		s2Out = s2_119;
		s3Out = s3_120;
		s4Out = dwArg04;
		s6Out = s6_123;
		s7Out = s7;
		s9Out = s9;
		return ra_195;
	}
}

