pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23086B3A: void altcp_mbedtls_lower_accept(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_489661) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack word32 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void altcp_mbedtls_lower_accept(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_489661 * a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, word32 dwArg38, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	if (a0 != 0x00 && s1 != 0x00)
	{
		Eq_2 a0_17 = a5->t0010;
		if (a5 != null)
		{
			Eq_2 a3_28;
			Eq_2 a4_29;
			word32 a5_261;
			word32 a2_260;
			word32 a1_259;
			word32 s1_258;
			Eq_2 ra_34 = altcp_alloc(ra, s1, a3, a4, mstatus, out s1_258, out a1_259, out a2_260, out a3_28, out a4_29, out a5_261);
			if (a0_17 != 0x00)
			{
				word32 a0_43;
				Eq_2 a3_46;
				Eq_2 a4_47;
				struct Eq_485595 * a5_48;
				struct Eq_489713 * s0_52;
				Eq_2 s2_54;
				word32 s3_55;
				word32 s4_56;
				word32 s9_266;
				word32 s7_265;
				word32 s6_264;
				word32 a1_263;
				word32 s1_262;
				Eq_2 ra_51 = altcp_mbedtls_setup(ra_34, a0_17, a0_17, a3_28, a4_29, a0_17, a2, s4, mstatus, dwLoc2C, dwLoc18, dwArg14, a1, dwArg68, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_52, out s1_262, out a0_43, out a1_263, out a3_46, out a4_47, out a5_48, out s2_54, out s3_55, out s4_56, out s6_264, out s7_265, out s9_266);
				if (a0_43 == 0x00)
				{
					<anonymous> * t1_72 = s0_52->ptr0010;
					0x00 = (int8) dwArg0128;
					word32 t1_93;
					word32 t0_97;
					word32 a6_99;
					word32 a7_100;
					word32 s5_101;
					word32 s6_102;
					word32 s8_103;
					word32 t4_104;
					word32 t5_105;
					word32 t6_106;
					word32 s10_107;
					word32 s11_108;
					word32 s7_109;
					word32 s9_110;
					t1_72();
					return;
				}
				word32 a5_269;
				word32 a4_268;
				word32 a1_267;
				altcp_free(ra_51, s2_54, a3_46, a4_47, a5_48, mstatus, out a1_267, out a4_268, out a5_269);
			}
l23086B72:
			0x00 = (int8) dwArg0128;
			return;
		}
	}
	goto l23086B72;
}

// 23086BA2: void altcp_mbedtls_abort(Register (ptr32 Eq_489771) a0, Register (ptr32 Eq_485595) a5)
void altcp_mbedtls_abort(struct Eq_489771 * a0, struct Eq_485595 * a5)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t0004;
	altcp_abort(a0_5, a5);
}

// 23086BAC: void altcp_mbedtls_recved(Register word32 a0, Register Eq_2 a1, Register (ptr32 Eq_489783) a4)
void altcp_mbedtls_recved(word32 a0, Eq_2 a1, struct Eq_489783 * a4)
{
	if (a0 == 0x00)
		return;
	struct Eq_489786 * a0_6 = a4->ptr000C;
	if (a4 == null || ((word32) a4->b00CC & 0x01) == 0x00)
		return;
	Eq_2 a5_9 = a4->t00D0;
	if (a5_9 < a1)
		a1 = (word32) (word16) a5_9;
	Eq_2 a5_15 = a5_9 - a1;
	a4->t00D0 = a5_15;
	int32 a0_19 = a0_6->dw0004;
	word32 a5_36;
	altcp_recved(a0_19, a5_15, out a5_36);
}

// 23086BD6: Register Eq_2 altcp_tls_create_config(Register Eq_2 ra, Register Eq_2 s0, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      altcp_tls_create_config_client_common
Eq_2 altcp_tls_create_config(Eq_2 ra, Eq_2 s0, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	altcp_mbedtls_mem_init();
	Eq_401688 a0_24 = 0x0500;
	if (a1 == 0x00)
		a0_24.u0 = 0x03CC;
	if (a3 != 0x00)
		a0_24 = (word32) a0_24.u0 + 308;
	if (a2 != 0x00)
		a0_24 = (word32) a0_24 + 8;
	Eq_2 a0_56;
	ptr32 s6_156;
	Eq_2 s3_153;
	ptr32 s4_182;
	ptr32 s5_183;
	Eq_2 s2_152;
	Eq_2 s1_149;
	ptr32 a3_175;
	ptr32 a4_176;
	ptr32 a5_190;
	Eq_2 ra_147 = altcp_mbedtls_alloc_config(ra, a0_24, a3, a4, a3, mstatus, s0, dwArg44, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0138, out s1_149, out a0_56, out a3_175, out a4_176, out a5_190, out s2_152, out s3_153, out s4_182, out s5_183, out s6_156);
	Eq_2 s0_148 = a0_56;
	if (a0_56 != 0x00)
	{
		Eq_2 a5_81 = (word32) a0_56 + 0x03CC;
		if (s3_153 != 0x00)
		{
			*((word32) a0_56 + 960) = (word32) a0_56 + 0x03CC;
			a5_81 = (word32) a0_56 + 0x0500;
		}
		if (s2_152 != 0x00)
		{
			*((word32) a0_56 + 968) = a5_81;
			a5_81 = (word32) a5_81 + 308;
		}
		if (s1_149 != 0x00)
			*((word32) a0_56 + 964) = a5_81;
		word32 a0_139;
		ui32 s4_154;
		Eq_2 a5_144;
		Eq_2 a2_141;
		ra_147 = mbedtls_ctr_drbg_seed(mbedtls_ctr_drbg_init(mbedtls_entropy_init(mbedtls_ssl_config_init(ra_147, a0_56), (word32) a0_56 + 0x0078), (word32) a0_56 + 640), (word32) a0_56 + 640, 587753852, (word32) a0_56 + 0x0078, dwArgA8, out s0_148, out s1_149, out a0_139, out a2_141, out a5_144, out s2_152, out s3_153, out s4_154, out s6_156, out s7, out s10, out s11);
		if (a0_139 != 0x00)
		{
l23086C64:
			word32 s8_474;
			altcp_mbedtls_free_config(s1_149, s0_148, a2_141, a5_144, s2_152, s3_153, mstatus, dwLoc2C, dwLoc28, dwLoc0C, (word32) a0_56 + 0x0078, dwArg74, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s1_149, out a3_175, out a4_176, out a5_190, out s2_152, out s3_153, out s4_182, out s5_183, out s6_156, out s8_474);
			s0_148.u0 = 0x00;
			goto l23086C6C;
		}
		word32 a0_172;
		s1_149 = mbedtls_ssl_config_defaults(s0_148, s4_154, 0x00, 0x00, out a0_172, out a2_141, out a3_175, out a4_176, out a5_144, out s2_152, out s3_153, out s4_182, out s5_183);
		if (a0_172 != 0x00)
			goto l23086C64;
		mbedtls_ssl_conf_authmode(s0_148, 0x01, out a5_190);
		mbedtls_ssl_conf_rng(s0_148, &g_t2308792C, s1_149);
	}
l23086C6C:
	0x00 = (int8) dwArg0128;
	s1Out = s1_149;
	a0Out = s0_148;
	a3Out = a3_175;
	a4Out = a4_176;
	a5Out = a5_190;
	s2Out = s2_152;
	s3Out = s3_153;
	s4Out = s4_182;
	s5Out = s5_183;
	s6Out = s6_156;
	s7Out = s7;
	s8Out = dwArg58;
	s10Out = s10;
	s11Out = s11;
	return ra_147;
}

