pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23086CA6: Register Eq_2 altcp_tls_create_config_client_common(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register word32 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tls_create_config_client
//      altcp_tls_create_config_client_2wayauth
Eq_2 altcp_tls_create_config_client_common(Eq_2 ra, Eq_2 s0, word32 a0, word32 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a0_45;
	Eq_2 a5_104;
	ptr32 a4_103;
	ptr32 a3_102;
	Eq_2 s1_108;
	Eq_2 s10_180;
	Eq_2 s11_181;
	Eq_2 s2_109;
	Eq_2 s3_110;
	ptr32 s4_111;
	Eq_2 s5_112;
	Eq_2 s6_113;
	ptr32 s7_187;
	Eq_2 s8_114;
	Eq_2 ra_178 = altcp_tls_create_config(ra, s0, a2, a2, (word32) (a0 != 0x00), a4, mstatus, dwArg34, dwArg64, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out s1_108, out a0_45, out a3_102, out a4_103, out a5_104, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_187, out s8_114, out s10_180, out s11_181);
	Eq_2 s0_122 = a0_45;
	if (a0_45 != 0x00 && s1_108 != 0x00)
	{
		Eq_2 a3_56;
		Eq_2 a4_57;
		Eq_2 a5_58;
		word32 a0_65;
		Eq_2 a2_66;
		word32 a0_212;
		word32 a1_213;
		ra_178 = mbedtls_x509_crt_parse(mbedtls_x509_crt_init(ra_178, *((word32) a0_45 + 968), out a0_212, out a1_213, out a3_56, out a4_57, out a5_58), a0_45, *((word32) a0_45 + 968), s1_108, s2_109, a3_56, a4_57, a5_58, s2_109, s5_112, s6_113, s8_114, s10_180, s11_181, mstatus, s0, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg24, dwArg28, dwArg48, dwArg64, dwArg68, dwArg84, dwArg88, dwArgA8, dwArgE4, dwArgE8, dwArgFC, dwArg0128, out s0_122, out s1_108, out a0_65, out a2_66, out a3_102, out a4_103, out a5_104, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_187, out s8_114, out s10_180, out s11_181, out mstatus);
		if (a0_65 != 0x00)
		{
			altcp_mbedtls_free_config(s1_108, s0_122, a2_66, a5_104, s2_109, s3_110, mstatus, s0, dwLoc08, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s1_108, out a3_102, out a4_103, out a5_104, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s8_114);
			s0_122.u0 = 0x00;
		}
		else
			mbedtls_ssl_conf_ca_chain(s0_122, *((word32) s0_122 + 968), null);
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_108;
	a0Out = s0_122;
	a3Out = a3_102;
	a4Out = a4_103;
	a5Out = a5_104;
	s2Out = s2_109;
	s3Out = s3_110;
	s4Out = s4_111;
	s5Out = s5_112;
	s6Out = s6_113;
	s7Out = s7_187;
	s8Out = s8_114;
	s10Out = s10_180;
	s11Out = s11_181;
	mstatusOut = mstatus;
	return ra_178;
}

// 23086D00: void altcp_mbedtls_dealloc(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack word32 dwArg28, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
void altcp_mbedtls_dealloc(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg14, word32 dwArg28, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	if (s0 != 0x00)
	{
		Eq_2 s2_26;
		Eq_2 s4_27;
		Eq_2 a4_20;
		Eq_2 a3_19 = mbedtls_ssl_free(ra, (word32) s0 + 4, a5, mstatus, dwArg28, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out a4_20, out s2_26, out s4_27);
		Eq_2 a0_38 = *((word32) s0 + 0x00C4);
		*((word32) s0 + 0x00CC) = 0x00;
		if (a0_38 != 0x00)
		{
			struct Eq_490399 * s0_42;
			word32 s1_233;
			word32 a1_234;
			word32 a2_235;
			word32 a5_236;
			word32 a7_237;
			word32 s5_238;
			word32 s6_239;
			word32 s8_240;
			pbuf_free(ra, a0_38, a3_19, a4_20, s4_27, mstatus, dwArg0118, out s0_42, out s1_233, out a0_38, out a1_234, out a2_235, out a3_19, out a4_20, out a5_236, out a7_237, out s2_26, out s3, out s4_27, out s5_238, out s6_239, out s8_240, out mstatus);
			s0_42->dw00C4 = 0x00;
		}
		word32 a5_229;
		word32 a4_228;
		word32 a3_227;
		word32 a1_226;
		word32 s2_230;
		word32 s3_231;
		word32 s6_232;
		*((word32) altcp_mbedtls_free(*a0_38, a3_19, a4_20, s2_26, s3, s4_27, mstatus, s0, dwLoc08, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out a1_226, out a3_227, out a4_228, out a5_229, out s2_230, out s3_231, out s6_232) + 0x0C) = 0x00;
	}
}

// 23086D42: void altcp_mbedtls_sndbuf(Register Eq_2 ra, Register (ptr32 Eq_490431) s1, Register (ptr32 Eq_488065) a0, Register (ptr32 Eq_490433) a3, Register (ptr32 Eq_490434) a4, Register (ptr32 Eq_487853) a5)
void altcp_mbedtls_sndbuf(Eq_2 ra, struct Eq_490431 * s1, struct Eq_488065 * a0, struct Eq_490433 * a3, struct Eq_490434 * a4, struct Eq_487853 * a5)
{
	if (a0 != null)
	{
		struct Eq_490438 * a0_16 = s1->ptr000C;
		if (s1 == null)
			return;
		ui32 a5_17 = (word32) s1->b00CC;
		a5 = a5_17 & 0x01;
		if ((a5_17 & 0x01) == 0x00)
			return;
		word32 a0_20 = a0_16->dw0004;
		if (a0_20 != 0x00)
		{
			Eq_2 a5_23;
			Eq_488079 a0_21 = altcp_sndbuf(a0_20, a5_17 & 0x01, out a5_23);
			struct Eq_490466 * a3_32;
			Eq_488079 a0_29 = mbedtls_ssl_get_record_expansion(ra, a0_21, a3, a4, a5_23, out a3_32, out a5);
			Eq_488079 s2_48 = a0_29;
			if (a0_29 > 0x00)
			{
				a5 = (struct Eq_487853 *) 0x10000000;
				if (a0_29 > 0x0FFFFFFE)
					s2_48.u0 = 0x0FFFFFFF;
				if (s2_48 < a0_21)
				{
					word32 a5_277;
					Eq_2 a0_76 = mbedtls_ssl_get_max_frag_len(a3_32, (struct Eq_490493 *) 0x10000000, out a5_277);
					Eq_2 a5_80 = a0_21 - s2_48;
					if (a5_80 >= 0x10000000)
						a5_80.u0 = 0x0FFFFFFF;
					return;
				}
			}
		}
	}
	altcp_default_sndbuf(a0, a5);
}

// 23086DCC: void altcp_mbedtls_write(Register Eq_2 ra, Register (ptr32 Eq_490508) s0, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg54, Stack word32 dwArg78, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void altcp_mbedtls_write(Eq_2 ra, struct Eq_490508 * s0, word32 a0, Eq_2 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg54, word32 dwArg78, Eq_2 dwArgD8, Eq_2 dwArgF8, word32 dwArg0128)
{
	if (a0 == 0x00)
		return;
	if (s0 != null)
	{
		if (((word32) s0->b00CC & 0x01) == 0x00)
		{
l23086E1A:
			goto l23086E1C;
		}
		Eq_2 a5_19 = s0->t00B0;
		Eq_2 s2_21 = a2;
		Eq_2 s3_23 = (char *) s0 + 4;
		if (a5_19 != 0x00)
		{
			dwArg54 = a1;
			word32 s1_292;
			word32 a0_293;
			word32 a1_294;
			word32 a2_295;
			word32 a3_296;
			word32 a4_297;
			word32 a5_298;
			word32 s4_299;
			word32 s5_300;
			word32 s7_301;
			word32 s9_302;
			word32 s10_303;
			word32 s11_304;
			a5_19 = *((word32) mbedtls_ssl_flush_output(ra, (char *) s0 + 4, a5_19, dwArgF8, out s1_292, out a0_293, out a1_294, out a2_295, out a3_296, out a4_297, out a5_298, out s2_21, out s3_23, out s4_299, out s5_300, out s7_301, out s9_302, out s10_303, out s11_304) + 0x00B0);
			if (a5_19 != 0x00)
				goto l23086E3C;
		}
		struct Eq_486509 * a0_64;
		struct Eq_486510 * a5_69;
		struct Eq_486509 * s2_76;
		struct Eq_490601 * s0_72 = mbedtls_ssl_write(ra, s3_23, s2_21, a5_19, mstatus, dwArg08, dwArg54, dwArg78, dwArgD8, out a0_64, out a5_69, out s2_76);
		altcp_output(a0_64, a5_69);
		if (a0_64 < null)
		{
			if (a0_64 != (struct Eq_486509 *) 0xF9000780)
				goto l23086E1A;
l23086E3C:
			goto l23086E1C;
		}
		if (s2_76 != a0_64)
			goto l23086E3C;
		s0_72->b00CC = (byte) ((word32) s0_72->b00CC | 16);
	}
l23086E1C:
	0x00 = dwArg0128;
}

// 23086E54: void altcp_mbedtls_close(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_485595) a5, Register ptr32 mstatus)
void altcp_mbedtls_close(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_485595 * a5, ptr32 mstatus)
{
	if (a0 == 0x00)
		return;
	Eq_2 s1_17 = *((word32) s0 + 4);
	if (s0 != 0x00)
	{
		struct Eq_485717 * s3_20 = *((word32) s0 + 32);
		altcp_arg(s0, 0x00);
		altcp_recv(s0, null);
		altcp_sent(s0, null);
		altcp_err(s0, null);
		Eq_2 a5_35;
		Eq_2 a0_31 = altcp_poll(s0, null, (word32) *((word32) s0 + 40), a5, out a5_35);
		s1_17 = *((word32) a0_31 + 4);
		if (altcp_close(a0_31, a5_35, out a5) != 0x00)
		{
			altcp_mbedtls_setup_callbacks(s1_17, s0);
			word32 a5_122;
			altcp_poll(s0, s3_20, (word32) *((word32) s0 + 40), a5, out a5_122);
			return;
		}
		*((word32) s1_17 + 4) = 0x00;
	}
	word32 a1_119;
	word32 a4_120;
	word32 a5_121;
	altcp_free(ra, s1_17, a3, a4, a5, mstatus, out a1_119, out a4_120, out a5_121);
}

// 23086ED6: void altcp_mbedtls_listen(Register (ptr32 Eq_490708) a0, Register Eq_2 a5)
void altcp_mbedtls_listen(struct Eq_490708 * a0, Eq_2 a5)
{
	if (a0 == null)
		return;
	struct Eq_472928 * a0_12 = altcp_listen_with_backlog_and_err(a0->t0004, a5);
	if (a0_12 == null)
		return;
	a0_12->ptr0004 = a0;
	altcp_accept(a0_12, &g_t23086B3A);
}

// 23086F04: void altcp_mbedtls_connect(Register (ptr32 Eq_490726) a0, Register (ptr32 Eq_490727) a3, Register Eq_2 a5)
void altcp_mbedtls_connect(struct Eq_490726 * a0, struct Eq_490727 * a3, Eq_2 a5)
{
	if (a0 == null)
		return;
	a3->ptr0014 = a0;
	Eq_2 a0_7 = a0->t0004;
	word32 a5_20;
	altcp_connect(a0_7, a5, out a5_20);
}

// 23086F1A: void altcp_mbedtls_bio_send(Register word32 a0, Register up32 a2, Register (ptr32 Eq_490744) a5, Stack word32 dwArgA8)
void altcp_mbedtls_bio_send(word32 a0, up32 a2, struct Eq_490744 * a5, word32 dwArgA8)
{
	if (a0 != 0x00)
	{
		struct Eq_490749 * a0_23 = a5->ptr0004;
		if (a5 != null)
		{
			struct Eq_470798 * a5_26 = (struct Eq_470798 *) 0x10000000;
			up32 s1_30;
			for (s1_30 = a2; s1_30 != 0x00; s1_30 -= s3_35)
			{
				up32 s3_35 = s1_30;
				if (s1_30 > 0x0FFFFFFE)
					s3_35 = 0x0FFFFFFF;
				Eq_2 a0_53 = altcp_write(a0_23->dw0004, a5_26, out a5_26);
				if (a0_53 != 0x00)
					break;
			}
		}
	}
	0x00 = dwArgA8;
}

// 23086F94: void altcp_mbedtls_lower_sent(Register Eq_2 ra, Register (ptr32 Eq_490777) s0, Register word32 a0, Stack word32 dwArg00, Stack word32 dwArg44, Stack Eq_2 dwArg0108)
void altcp_mbedtls_lower_sent(Eq_2 ra, struct Eq_490777 * s0, word32 a0, word32 dwArg00, word32 dwArg44, Eq_2 dwArg0108)
{
	if (a0 == 0x00)
		return;
	if (s0 == null)
		return;
	ui32 a5_11 = (word32) s0->b00CC;
	if ((a5_11 & 0x01) == 0x00)
		return;
	word32 a0_15;
	struct Eq_490796 * a1_16;
	word32 s1_165;
	word32 a2_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s5_173;
	word32 s7_174;
	word32 s9_175;
	word32 s10_176;
	word32 s11_177;
	Eq_2 s0_23 = mbedtls_ssl_flush_output(ra, (char *) s0 + 4, a5_11 & 0x01, dwArg0108, out s1_165, out a0_15, out a1_16, out a2_166, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s5_173, out s7_174, out s9_175, out s10_176, out s11_177);
	if (((word32) *((word32) s0_23 + 0x00CC) & 0x10) == 0x00)
		return;
	<anonymous> * t1_43 = a1_16->ptr001C;
	if (t1_43 == null)
		return;
	word32 a5_59;
	word32 t1_61;
	word32 a3_65;
	word32 a4_66;
	word32 a6_67;
	word32 a7_68;
	word32 s1_69;
	word32 s10_70;
	word32 s11_71;
	word32 s2_72;
	word32 s4_73;
	word32 s5_74;
	word32 s6_75;
	word32 s7_76;
	word32 s9_77;
	word32 t0_78;
	word32 t4_79;
	word32 tp_80;
	word32 s3_81;
	t1_43();
}

