pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23086FDE: void altcp_mbedtls_mss(Register (ptr32 Eq_490864) a0, Register (ptr32 Eq_487836) a5)
void altcp_mbedtls_mss(struct Eq_490864 * a0, struct Eq_487836 * a5)
{
	if (a0 == null)
		return;
	word32 a0_5 = a0->dw0004;
	altcp_mss(a0_5, a5);
}

// 23086FE8: void altcp_mbedtls_set_poll(Register (ptr32 Eq_490875) a0, Register word32 a1, Register (ptr32 Eq_485595) a5)
void altcp_mbedtls_set_poll(struct Eq_490875 * a0, word32 a1, struct Eq_485595 * a5)
{
	if (a0 == null)
		return;
	Eq_2 a0_7 = a0->t0004;
	word32 a5_23;
	altcp_poll(a0_7, &g_t230871A0, a1, a5, out a5_23);
}

// 23086FFC: Register Eq_2 altcp_mbedtls_handle_rx_appldata(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg1C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_mbedtls_lower_poll
//      altcp_mbedtls_lower_recv
Eq_2 altcp_mbedtls_handle_rx_appldata(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg1C, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a0Out, ptr32 & mstatusOut)
{
	if (((word32) *((word32) a1 + 0x00CC) & 0x01) == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x05;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_490910 * sp_252 = fp + -48;
		Eq_2 s0_116 = a1;
		Eq_2 s1_257 = a0;
		do
		{
			ptr32 a0_412;
			word32 a0_52;
			Eq_2 a5_56;
			word32 s6_71;
			word32 a1_859;
			word32 a3_861;
			word32 a4_862;
			word32 a7_863;
			word32 s2_864;
			word32 s3_865;
			word32 s4_866;
			word32 s5_867;
			word32 s8_868;
			word32 a2_860;
			word32 s0_857;
			word32 s1_858;
			ra = pbuf_alloc(ra, s0_116, s1_257, 0x00, 760, 640, a3, a4, mstatus, sp_252->t0004, sp_252->t0044, sp_252->t00A8, sp_252->t00B8, sp_252->t00D8, sp_252->t00E8, sp_252->t00F8, sp_252->t0118, sp_252->t0128, sp_252->t0158, out s0_857, out s1_858, out a0_52, out a1_859, out a2_860, out a3_861, out a4_862, out a5_56, out a7_863, out s2_864, out s3_865, out s4_866, out s5_867, out s6_71, out s8_868, out mstatus);
			if (a0_52 == 0x00)
				break;
			Eq_2 a0_81;
			Eq_2 s4_85;
			Eq_2 a3_90;
			Eq_2 a4_91;
			Eq_2 s3_97;
			Eq_2 s7_100;
			ptr32 mstatus_106;
			Eq_2 s9_101;
			int32 s10_173;
			Eq_2 ra_107 = mbedtls_ssl_read(ra, s6_71, 760, a5_56, mstatus, sp_252->t0038, sp_252->t0084, sp_252->t0108, out s0_116, out a0_81, out a3_90, out a4_91, out s3_97, out s4_85, out s7_100, out s9_101, out s10_173, out mstatus_106);
			if (a0_81 < 0x00)
			{
				if (a0_81 != ~0x0600077F)
				{
					word32 s8_839;
					word32 a2_829;
					word32 a4_831;
					word32 a5_832;
					word32 a7_833;
					word32 s2_834;
					word32 s3_835;
					word32 s4_836;
					word32 s5_837;
					word32 s6_838;
					word32 a3_830;
					word32 s0_825;
					word32 s1_826;
					word32 a0_827;
					word32 a1_828;
					ra = pbuf_free(ra_107, s3_97, a3_90, a4_91, s4_85, mstatus_106, sp_252->t0128, out s0_825, out s1_826, out a0_827, out a1_828, out a2_829, out a3_830, out a4_831, out a5_832, out a7_833, out s2_834, out s3_835, out s4_836, out s5_837, out s6_838, out s8_839, out mstatus);
					break;
				}
				struct Eq_485595 * a5_391;
				Eq_2 s1_392;
				word32 s2_819;
				word32 s4_821;
				word32 s5_822;
				word32 s6_823;
				word32 s8_824;
				word32 s3_820;
				word32 s0_812;
				word32 a0_813;
				word32 a1_814;
				word32 a2_815;
				word32 a3_816;
				word32 a4_817;
				word32 a7_818;
				ra = pbuf_free(ra_107, s3_97, a3_90, a4_91, s4_85, mstatus_106, sp_252->t0128, out s0_812, out s1_392, out a0_813, out a1_814, out a2_815, out a3_816, out a4_817, out a5_391, out a7_818, out s2_819, out s3_820, out s4_821, out s5_822, out s6_823, out s8_824, out mstatus);
				altcp_abort(s1_392, a5_391);
				goto l23087076;
			}
			word32 s2_124;
			Eq_2 a4_121;
			Eq_2 a5_122;
			Eq_2 s4_128;
			word32 s6_130;
			Eq_2 s5_129;
			Eq_2 a0_114;
			ui32 s8_131;
			if (a0_81 != 0x00)
			{
				struct Eq_491085 * s1_146;
				Eq_2 s3_155;
				word32 a2_845;
				word32 a5_846;
				ra = pbuf_realloc(ra_107, s0_116, s3_97, (word32) (word16) a0_81, a3_90, a4_91, a0_81, s3_97, s4_85, mstatus_106, sp_252->t0014, sp_252->t0098, sp_252->t00C8, sp_252->t00E8, sp_252->t0108, sp_252->t0118, sp_252->t0128, sp_252->t0168, out s1_146, out a2_845, out a3, out a4_121, out a5_846, out s2_124, out s3_155, out s4_128, out s5_129, out s6_130, out s8_131, out mstatus);
				a5_122 = (word32) *((word32) s0_116 + 0x00D8) + s2_124;
				*((word32) s0_116 + 0x00D8) = a5_122;
				if (mbedtls_ssl_get_bytes_avail(a5_122) == 0x00)
				{
					a5_122 = *((word32) s0_116 + 0x00D8);
					s10_173 = s1_146->dw0004;
					for (s4_128 = *((word32) s0_116 + 212) - a5_122; s4_128 > 0x00; s4_128 -= s9_101)
					{
						s9_101 = s4_128;
						if (s7_100 < s4_128)
							s9_101 = s5_129;
						altcp_recved(s10_173, a5_122, out a5_122);
					}
					*((word32) s0_116 + 212) = 0x00;
					((word32) s0_116 + 0x00D8)->u0 = 0x00;
				}
				a0_114 = *((word32) s0_116 + 200);
				if (a0_114 == 0x00)
					*((word32) s0_116 + 200) = s3_155;
				else
					pbuf_cat(a0_114, s3_155, a4_121);
			}
			else
			{
				word32 a1_841;
				word32 a2_842;
				word32 a7_843;
				word32 s3_844;
				word32 s1_840;
				ra = pbuf_free(ra_107, s3_97, a3_90, a4_91, s4_85, mstatus_106, sp_252->t0128, out s0_116, out s1_840, out a0_114, out a1_841, out a2_842, out a3, out a4_121, out a5_122, out a7_843, out s2_124, out s3_844, out s4_128, out s5_129, out s6_130, out s8_131, out mstatus);
			}
			Eq_2 a5_211;
			Eq_2 a4_272;
			Eq_2 s3_210 = *((word32) s0_116 + 200);
			if (s3_210 != 0x00)
			{
				((word32) s0_116 + 200)->u0 = 0x00;
				word32 s1_288 = *((word32) a5_122 + 24);
				if (a5_122 == 0x00)
				{
					word32 a1_849;
					word32 a7_851;
					word32 s3_852;
					word32 s4_853;
					word32 s5_854;
					word32 s6_855;
					word32 s8_856;
					word32 a2_850;
					word32 s1_847;
					word32 a0_848;
					ra = pbuf_free(ra, s3_210, a3, a4_121, s4_128, mstatus, sp_252->t0128, out s0_116, out s1_847, out a0_848, out a1_849, out a2_850, out a3, out a4, out a5_211, out a7_851, out s2_124, out s3_852, out s4_853, out s5_854, out s6_855, out s8_856, out mstatus);
					goto l23087164;
				}
				word32 s4_324 = (word32) *((word32) s3_210 + 8);
				*((word32) s0_116 + 0x00D0) = (word32) *((word32) s0_116 + 0x00D0) + s4_324;
				ui32 a4_330 = (word32) *((word32) s0_116 + 0x00CC);
				*((word32) s0_116 + 0x00CC) = (byte) (a4_330 | 2);
				Eq_2 s3_347;
				int32 s4_348;
				word32 a0_351;
				word32 tp_353;
				word32 t3_354;
				word32 a6_355;
				word32 a7_359;
				word32 t0_360;
				word32 t1_361;
				word32 t4_362;
				word32 t5_363;
				word32 t6_364;
				word32 s11_365;
				word32 t2_366;
				word32 gp_367;
				a5_122();
				if (a0_351 == 0x00)
					goto l23087164;
				if (a0_351 != ~0x0C)
				{
					int32 a5_375 = *((word32) s0_116 + 0x00D0);
					*((word32) s0_116 + 200) = s3_347;
					int32 a5_377 = a5_375 - s4_348;
					if (a5_377 >= 0x00)
						*((word32) s0_116 + 0x00D0) = a5_377;
					else
						*((word32) s0_116 + 0x00D0) = 0x00;
					break;
				}
				goto l23087076;
			}
			a5_211 = (word32) *((word32) s0_116 + 0x00CC);
			a4 = a5_211 & 0x0C;
			if ((a5_211 & 0x0C) == s8_131)
			{
				*((word32) s0_116 + 0x00CC) = (byte) (a5_211 | 8);
				a5_211 |= 8;
				if ((a5_211 | 8) == 0x00)
					goto l23087164;
				word32 s1_221 = *((word32) a0_114 + 8);
				word32 a0_267;
				word32 tp_269;
				word32 t3_270;
				word32 a6_271;
				word32 a7_275;
				word32 t0_276;
				word32 t1_277;
				word32 t4_278;
				word32 t5_279;
				word32 t6_280;
				word32 s11_281;
				word32 t2_282;
				word32 gp_283;
				(a5_211 | 8)();
				a4 = a4_272;
				if (a0_267 == 0x00)
					goto l2308716A;
				if (a0_267 != ~0x0C)
					break;
l23087076:
				a0_412 = ~0x0C;
				goto l23087078;
			}
l23087164:
			s1_257 = *((word32) a5_211 + 0x0C);
			if (s0_116 != a5_211)
				break;
l2308716A:
		} while (s2_124 != 0x00);
		a0_412 = 0x00;
l23087078:
		0x00 = (int8) dwArg0128;
		0x00 = dwArg1C;
		s0Out = s4;
		a0Out = a0_412;
		mstatusOut = mstatus;
		return ra;
	}
}

