pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230871A0: void altcp_mbedtls_lower_poll(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_491404) a1, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg44, Stack Eq_2 dwArg0108)
void altcp_mbedtls_lower_poll(Eq_2 ra, word32 a0, struct Eq_491404 * a1, Eq_2 a5, ptr32 mstatus, word32 dwArg00, word32 dwArg44, Eq_2 dwArg0108)
{
	if (a0 == 0x00)
		return;
	struct Eq_491412 * a0_10 = a1->ptr000C;
	struct Eq_491412 * s0_11 = a0_10;
	if (a1 != null)
	{
		Eq_2 a1_16;
		Eq_2 a3_18;
		Eq_2 a4_19;
		word32 s1_252;
		word32 a0_253;
		word32 a2_254;
		word32 a5_255;
		word32 s2_256;
		word32 s3_257;
		word32 s4_258;
		word32 s5_259;
		word32 s7_260;
		word32 s9_261;
		word32 s10_262;
		word32 s11_263;
		ra = altcp_mbedtls_handle_rx_appldata(ra, mbedtls_ssl_flush_output(ra, (char *) a1 + 4, a5, dwArg0108, out s1_252, out a0_253, out a1_16, out a2_254, out a3_18, out a4_19, out a5_255, out s2_256, out s3_257, out s4_258, out s5_259, out s7_260, out s9_261, out s10_262, out s11_263), a1_16, a3_18, a4_19, mstatus, dwLoc04, dwArg0108, out s0_11, out a0_10, out mstatus);
		a5.u0 = ~0x0C;
		if (a0_10 == (struct Eq_491412 *) ~0x0C)
			return;
	}
	<anonymous> * t1_77 = s0_11->ptr0020;
	if (t1_77 == null)
		return;
	word32 s0_79 = a0_10->dw0008;
	word32 t1_93;
	word32 a2_96;
	word32 a3_98;
	word32 a4_99;
	word32 a6_100;
	word32 a7_101;
	word32 s1_102;
	word32 s10_103;
	word32 s11_104;
	word32 s2_105;
	word32 s4_106;
	word32 s5_107;
	word32 s6_108;
	word32 s7_109;
	word32 s9_110;
	word32 t0_111;
	word32 t4_112;
	word32 tp_113;
	word32 s3_114;
	word32 t5_116;
	word32 t6_117;
	word32 gp_118;
	word32 t2_119;
	t1_77();
}

// 230871EA: void altcp_mbedtls_lower_recv_process(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0128)
// Called from:
//      altcp_mbedtls_lower_connected
//      altcp_mbedtls_lower_recv
void altcp_mbedtls_lower_recv_process(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg74, Eq_2 dwArg0128)
{
	ui32 a5_23 = (word32) *((word32) a1 + 0x00CC);
	Eq_2 s0_103 = a0;
	Eq_2 s1_126 = a1;
	if ((a5_23 & 0x01) != 0x00)
	{
l2308720A:
		0x00 = (int8) dwArg0128;
		word32 s0_537;
		word32 a0_538;
		word32 mstatus_539;
		altcp_mbedtls_handle_rx_appldata(ra, s0_103, s1_126, a3, a4, mstatus, dwArg1C, dwArg0128, out s0_537, out a0_538, out mstatus_539);
		return;
	}
	struct Eq_486509 * a0_30;
	struct Eq_486510 * a5_41;
	word32 s5_544;
	word32 s2_543;
	word32 a4_542;
	word32 a1_540;
	word32 a2_541;
	word32 s3_113;
	int32 s4_114;
	int32 s6_116;
	word32 s7_117;
	ra = mbedtls_ssl_handshake(ra, (word32) a1 + 4, a5_23 & 0x01, mstatus, dwArg28, dwArg74, out s1_126, out a0_30, out a1_540, out a2_541, out a3, out a4_542, out a5_41, out s2_543, out s3_113, out s4_114, out s5_544, out s6_116, out s7_117, out mstatus);
	struct Eq_491577 * s0_62 = a0_30->ptr0004;
	Eq_2 a0_104 = altcp_output(a0_30, a5_41);
	int32 s2_112 = *((word32) s1_126 + 212);
	if (s2_112 != 0x00)
	{
		s6_116 = s0_62->dw0004;
		Eq_2 a5_68 = 0x10000000;
		s7_117 = 0x0FFFFFFE;
		s3_113 = 0x0FFFFFFF;
		for (; s2_112 > 0x00; s2_112 -= s4_114)
		{
			s4_114 = s2_112;
			if (s2_112 > 0x0FFFFFFE)
				s4_114 = 0x0FFFFFFF;
			a0_104 = altcp_recved(s6_116, a5_68, out a5_68);
		}
		*((word32) s1_126 + 212) = 0x00;
	}
	a4 = a0_30 & -0x0081;
	Eq_2 a5_173 = 0xF9000700;
	if ((a0_30 & -0x0081) != 0xF9000700)
	{
		if (a0_30 != null)
		{
			Eq_2 s0_159 = *(union Eq_2 *) 0xF9000724;
			if (true)
			{
				word32 a4_180;
				word32 a3_182;
				(*(<anonymous> *) 0xF9000700)();
			}
			struct Eq_485595 * a5_199;
			if (altcp_close(s0_159, a5_173, out a5_199) != 0x00)
				altcp_abort(s0_159, a5_199);
		}
		else
		{
			ui32 a5_100 = (word32) *((word32) s1_126 + 0x00CC);
			*((word32) s1_126 + 0x00CC) = (byte) (a5_100 | 1);
			s0_103 = (a5_100 | 1)->t0014;
			if ((a5_100 | 1) != 0x00)
			{
				word32 s0_106 = *((word32) a0_104 + 8);
				word32 a0_136;
				(a5_100 | 1)();
				if (a0_136 != 0x00)
				{
l23087264:
					0x00 = (int8) dwArg0128;
					return;
				}
			}
			if (*((word32) s1_126 + 0x00C4) != 0x00)
				goto l2308720A;
		}
	}
	goto l23087264;
}

// 230872D6: void altcp_mbedtls_lower_connected(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0128)
void altcp_mbedtls_lower_connected(Eq_2 ra, word32 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg74, Eq_2 dwArg0128)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_6 = *((word32) a1 + 0x0C);
	if (a1 == 0x00)
		return;
	if (a2 != 0x00)
	{
		<anonymous> * t1_9 = *((word32) a0_6 + 20);
		if (t1_9 != null)
		{
			word32 t1_59;
			word32 a5_64;
			word32 a6_65;
			word32 a7_66;
			word32 gp_67;
			word32 s0_68;
			word32 s1_69;
			word32 s10_70;
			word32 s11_71;
			word32 s2_72;
			word32 s3_73;
			word32 s4_74;
			word32 s5_75;
			word32 s6_76;
			word32 s7_77;
			word32 s8_78;
			word32 s9_79;
			word32 t0_80;
			word32 t2_81;
			word32 t3_82;
			word32 t4_83;
			word32 t5_84;
			word32 t6_85;
			word32 tp_86;
			t1_9();
			return;
		}
	}
	altcp_mbedtls_lower_recv_process(ra, a0_6, a1, a3, a4, mstatus, dwArg1C, dwArg28, dwArg74, dwArg0128);
}

// 230872F4: void altcp_mbedtls_lower_recv(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg1C, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void altcp_mbedtls_lower_recv(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, word32 dwArg00, word32 dwArg04, word32 dwArg1C, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg74, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a5_11 = a2;
	if (a0 != 0x00)
	{
		Eq_2 a0_13 = *((word32) s0 + 0x0C);
		Eq_2 s1_104 = a0_13;
		if (s0 != 0x00)
		{
			if (a2 != 0x00)
			{
				Eq_2 a0_15 = *((word32) s0 + 0x00C4);
				if (a0_15 == 0x00)
					*((word32) s0 + 0x00C4) = a2;
				else
					pbuf_cat(a0_15, a2, a4);
				altcp_mbedtls_lower_recv_process(ra, a0_13, s0, a3, a4, mstatus, dwArg1C, dwArg28, dwArg74, dwArg0128);
				return;
			}
			else
			{
				Eq_2 a5_106 = (word32) *((word32) s0 + 0x00CC);
				if ((a5_106 & 3) != 0x03)
				{
					Eq_2 a0_69 = *((word32) a5_106 + 36);
					if (a5_106 != 0x00)
					{
						word32 s4_84;
						word32 s2_86;
						word32 s3_87;
						word32 s5_88;
						word32 s6_89;
						word32 s7_90;
						word32 a6_91;
						word32 tp_92;
						word32 a7_94;
						word32 gp_95;
						word32 s10_96;
						word32 s11_97;
						word32 s9_98;
						word32 t0_99;
						word32 t2_100;
						word32 t4_101;
						word32 t5_102;
						word32 t6_103;
						a5_106();
					}
					word32 a5_490;
					altcp_close(s1_104, a5_106, out a5_490);
					return;
				}
				else
				{
					Eq_2 a4_110 = *((word32) s0 + 0x00C4);
					if (a4_110 == 0x00)
					{
						a4_110 = *((word32) s0 + 200);
						if (a4_110 == 0x00)
						{
							*((word32) s0 + 0x00CC) = (byte) (a5_106 | 8);
							<anonymous> * t1_114 = *((word32) a0_13 + 24);
							if (t1_114 == null)
								return;
							word32 s2_136;
							word32 s3_137;
							word32 s5_138;
							word32 s6_139;
							word32 s7_140;
							word32 a6_141;
							word32 tp_142;
							word32 a7_144;
							word32 gp_145;
							word32 s10_146;
							word32 s11_147;
							word32 s9_148;
							word32 t0_149;
							word32 t2_150;
							word32 t4_151;
							word32 t5_152;
							word32 t6_153;
							t1_114();
							return;
						}
					}
					*((word32) s0 + 0x00CC) = (byte) (a5_106 | 4);
					word32 a0_488;
					word32 mstatus_489;
					word32 s0_487;
					altcp_mbedtls_handle_rx_appldata(ra, a0_13, s0, a5_106 & 3, a4_110, mstatus, dwLoc04, dwArg0108, out s0_487, out a0_488, out mstatus_489);
					return;
				}
			}
		}
	}
	if (a2 != 0x00)
	{
		word32 s0_473;
		word32 s1_474;
		word32 a3_477;
		word32 a2_476;
		word32 a0_475;
		word32 s2_480;
		word32 a7_479;
		word32 s5_483;
		word32 s4_482;
		word32 a4_478;
		word32 s3_481;
		word32 mstatus_486;
		word32 s8_485;
		word32 s6_484;
		pbuf_free(ra, a2, a3, a4, s4, mstatus, dwArg0108, out s0_473, out s1_474, out a0_475, out a1, out a2_476, out a3_477, out a4_478, out a5_11, out a7_479, out s2_480, out s3_481, out s4_482, out s5_483, out s6_484, out s8_485, out mstatus_486);
	}
	word32 a5_472;
	altcp_close(a1, a5_11, out a5_472);
}

// 230873A8: Register Eq_2 altcp_tls_wrap(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_485595) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out)
// Called from:
//      altcp_tls_new
Eq_2 altcp_tls_wrap(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, struct Eq_485595 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out)
{
	Eq_2 s0_43;
	if (a1 != 0x00)
	{
		Eq_2 a3_18;
		word32 a2_184;
		ra = altcp_alloc(ra, a0, a3, a4, mstatus, out s1, out a1, out a2_184, out a3_18, out a4, out a5);
		if (a0 != 0x00)
		{
			word32 a0_34;
			Eq_2 a3_37;
			word32 s4_185;
			ra = altcp_mbedtls_setup(ra, s1, a0, a3_18, a4, s2, s3, s4, mstatus, dwLoc1C, dwLoc08, dwArg24, a1, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_43, out s1, out a0_34, out a1, out a3_37, out a4, out a5, out s2, out s3, out s4_185, out s6, out s7, out s9);
			if (a0_34 == 0x00)
			{
l230873B4:
				s1Out = s1;
				a0Out = s0_43;
				a1Out = a1;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2;
				s3Out = s3;
				s4Out = dwArg04;
				s6Out = s6;
				s7Out = s7;
				s8Out = dwLoc1C;
				s9Out = s9;
				return ra;
			}
			s1 = altcp_free(ra, s0_43, a3_37, a4, a5, mstatus, out a1, out a4, out a5);
		}
	}
	s0_43.u0 = 0x00;
	goto l230873B4;
}

// 230873E0: Register Eq_2 altcp_tls_context(Register Eq_2 a0)
// Called from:
//      tcp_connected_callback
//      bl_cipstart
Eq_2 altcp_tls_context(Eq_2 a0)
{
	if (a0 != 0x00)
	{
		a0 = *((word32) a0 + 0x0C);
		if (a0 != 0x00)
			a0 = (word32) a0 + 4;
	}
	return a0;
}

