pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230873EA: Register Eq_2 altcp_tls_create_config_client(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_471733) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_cipstart
Eq_2 altcp_tls_create_config_client(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_471733 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	ptr32 s1_18;
	struct Eq_471733 * s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	ptr32 s7_26;
	ptr32 a0_37;
	ptr32 mstatus_38;
	word32 s5_79;
	word32 s6_80;
	word32 s8_81;
	word32 s10_82;
	word32 s11_83;
	Eq_2 ra_17 = altcp_tls_create_config_client_common(ra, s0, a0, 0x00, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg64, dwArg68, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArgE8, dwArgF8, dwArgFC, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0188, out s1_18, out a0_37, out a3_12, out a4_13, out a5_14, out s2_21, out s3_22, out s4_23, out s5_79, out s6_80, out s7_26, out s8_81, out s10_82, out s11_83, out mstatus_38);
	s1Out = s1_18;
	a0Out = a0_37;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	s7Out = s7_26;
	mstatusOut = mstatus_38;
	return ra_17;
}

// 230873F0: Register Eq_2 altcp_tls_create_config_client_2wayauth(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgC4, Stack Eq_2 dwArgC8, Stack word32 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_cipstart
Eq_2 altcp_tls_create_config_client_2wayauth(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a2, Eq_2 a4, Eq_2 a6, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgC4, Eq_2 dwArgC8, word32 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_123;
	Eq_2 s0_122;
	s1_123 = s1;
	if (a6 != 0x00)
	{
		s1_123 = s1;
		if (a2 != 0x00)
		{
			Eq_2 s10_44;
			Eq_2 s11_45;
			Eq_2 s5_49;
			Eq_2 s6_50;
			Eq_2 s8_52;
			Eq_2 a0_62;
			word32 s4_397;
			ra = altcp_tls_create_config_client_common(ra, s0, a0, 0x01, a4, mstatus, s2, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg44, dwArg48, s3, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_123, out a0_62, out a3, out a4, out a5, out s2, out s3, out s4_397, out s5_49, out s6_50, out s7, out s8_52, out s10_44, out s11_45, out mstatus);
			if (a0_62 != 0x00)
			{
				Eq_2 a0_165;
				Eq_2 a3_69;
				Eq_2 a4_70;
				Eq_2 a5_71;
				word32 a0_78;
				Eq_2 s0_83;
				Eq_2 s4_85;
				Eq_2 s10_95;
				Eq_2 s11_96;
				Eq_2 s5_99;
				word32 a0_398;
				word32 a1_399;
				word32 a3_400;
				word32 a4_401;
				word32 s6_402;
				word32 s8_403;
				Eq_2 a2_115;
				ra = mbedtls_x509_crt_parse(mbedtls_x509_crt_init(ra, *((word32) a0_62 + 960), out a0_398, out a1_399, out a3_69, out a4_70, out a5_71), a0_62, *((word32) a0_62 + 960), s2, s6_50, a3_69, a4_70, a5_71, s2, s5_49, s6_50, s8_52, s10_44, s11_45, mstatus, s4, s2, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg38, dwArg54, dwArg58, dwArg74, dwArg78, dwArg98, dwArgD4, dwArgD8, dwArgEC, dwArg0118, out s0_83, out s1_123, out a0_78, out a2_115, out a3_400, out a4_401, out a5, out s2, out s3, out s4_85, out s5_99, out s6_402, out s7, out s8_403, out s10_95, out s11_96, out mstatus);
				if (a0_78 != 0x00)
					a0_165 = *((word32) s0_83 + 960);
				else
				{
					mbedtls_pk_init(*((word32) s0_83 + 964));
					Eq_2 a3_116;
					Eq_2 a4_117;
					word32 a0_141;
					ra = mbedtls_pk_parse_key(ra, s0_83, s1_123, s1_123, s3, s5_99, s2, s3, s4_85, s7, s10_95, s11_96, mstatus, s4, s2, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg24, dwArg28, dwArg44, dwArg48, dwArg54, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0178, out s0_122, out s1_123, out a0_141, out a2_115, out a3_116, out a4_117, out a5, out s2, out s3, out s7, out mstatus);
					if (a0_141 == 0x00)
					{
						word32 a0_146;
						ra = mbedtls_ssl_conf_own_cert(ra, *((byte) s0_122.u0 + 960), *((byte) s0_122.u0 + 964), a3_116, a4_117, a5, mstatus, s6, s4, dwArgD8, dwArg0118, out s0_122, out s1_123, out a0_146, out a2_115, out a3, out a4, out a5, out s2, out s3);
						if (a0_146 == 0x00)
						{
l2308746C:
							0x00 = (int8) dwArgA8;
							s0Out = s1;
							s1Out = s1_123;
							a0Out = s0_122;
							a3Out = a3;
							a4Out = a4;
							a5Out = a5;
							s2Out = s2;
							s3Out = s3;
							s4Out = dwArg04;
							s7Out = s7;
							mstatusOut = mstatus;
							return ra;
						}
					}
					a0_165 = s0_122;
				}
				word32 s4_404;
				word32 s5_405;
				word32 s6_406;
				word32 s8_407;
				altcp_mbedtls_free_config(s1_123, a0_165, a2_115, a5, s2, s3, mstatus, s4, s2, dwArg04, s3, dwArg84, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s1_123, out a3, out a4, out a5, out s2, out s3, out s4_404, out s5_405, out s6_406, out s8_407);
			}
		}
	}
	s0_122.u0 = 0x00;
	goto l2308746C;
}

// 23087482: Register word32 altcp_tls_free_config(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_467991) s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_467994) s2Out, Register out (ptr32 Eq_467995) s3Out, Register out (ptr32 Eq_467996) s4Out)
// Called from:
//      tcp_connected_callback
//      tcp_receive_callback
//      tcp_err_callback
//      bl_cipstart
//      bl_cipclose
word32 altcp_tls_free_config(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0198, struct Eq_467991 & s1Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_467994 & s2Out, struct Eq_467995 & s3Out, struct Eq_467996 & s4Out)
{
	Eq_2 s0_34 = a0;
	Eq_2 a0_10 = *((word32) a0 + 964);
	if (a0_10 != 0x00)
	{
		word32 a0_180;
		word32 a2_181;
		ra = mbedtls_pk_free(ra, a0_10, a5, out a0_180, out a2_181, out a5);
	}
	Eq_2 a0_18 = *((word32) a0 + 960);
	if (a0_18 != 0x00)
	{
		word32 s8_185;
		word32 a0_182;
		word32 a2_183;
		word32 s4_184;
		ra = mbedtls_x509_crt_free(ra, a0_18, a1, a5, mstatus, dwArg0128, dwArg0168, out s0_34, out s1, out a0_182, out a1, out a2_183, out a5, out s2, out s3, out s4_184, out s8_185);
	}
	Eq_2 a0_44 = *((word32) s0_34 + 968);
	if (a0_44 != 0x00)
	{
		word32 a2_188;
		word32 s4_189;
		word32 s8_190;
		word32 a0_186;
		word32 a1_187;
		mbedtls_x509_crt_free(ra, a0_44, a1, a5, mstatus, dwArg0128, dwArg0168, out s0_34, out s1, out a0_186, out a1_187, out a2_188, out a5, out s2, out s3, out s4_189, out s8_190);
	}
	ptr32 a4_91;
	ptr32 a5_92;
	struct Eq_467991 * s1_96;
	struct Eq_467994 * s2_97;
	struct Eq_467995 * s3_98;
	struct Eq_467996 * s4_99;
	word32 s8_194;
	word32 a3_191;
	word32 s5_192;
	word32 s6_193;
	word32 s0_95 = altcp_mbedtls_free_config(s1, s0_34, dwArg10, a5, s2, s3, mstatus, dwArg04, dwArg08, dwArg24, dwArg84, dwArgA4, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0198, out s1_96, out a3_191, out a4_91, out a5_92, out s2_97, out s3_98, out s4_99, out s5_192, out s6_193, out s8_194);
	s1Out = s1_96;
	a4Out = a4_91;
	a5Out = a5_92;
	s2Out = s2_97;
	s3Out = s3_98;
	s4Out = s4_99;
	return s0_95;
}

// 230874B0: void altcp_mbedtls_mem_init()
// Called from:
//      altcp_tls_create_config
void altcp_mbedtls_mem_init()
{
}

