pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230874B2: Register Eq_2 altcp_mbedtls_alloc(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg64, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      altcp_mbedtls_setup
Eq_2 altcp_mbedtls_alloc(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg64, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s6Out)
{
	ptr32 a0_16;
	ptr32 a5_18;
	ptr32 * s0_19;
	ptr32 a1_22;
	ptr32 a3_23;
	ptr32 a4_24;
	ptr32 s1_27;
	ptr32 s3_29;
	ptr32 s6_32;
	word32 s5_90;
	word32 s4_89;
	word32 s2_88;
	Eq_2 ra_39 = mem_calloc(ra, 0x01, 220, a3, a4, s2, mstatus, dwArg04, dwArg64, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0158, out s0_19, out s1_27, out a0_16, out a1_22, out a3_23, out a4_24, out a5_18, out s2_88, out s3_29, out s4_89, out s5_90, out s6_32);
	if (a0_16 != 0x00)
		*s0_19 = a0_16;
	s1Out = s1_27;
	a0Out = a0_16;
	a1Out = a1_22;
	a3Out = a3_23;
	a4Out = a4_24;
	a5Out = a5_18;
	s3Out = s3_29;
	s6Out = s6_32;
	return ra_39;
}

// 230874D0: Register word32 altcp_mbedtls_free(Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      altcp_mbedtls_setup
//      altcp_mbedtls_dealloc
word32 altcp_mbedtls_free(Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	ptr32 a1_13;
	ptr32 a3_15;
	ptr32 a4_16;
	ptr32 a5_17;
	word32 s1_21;
	ptr32 s2_22;
	ptr32 s3_23;
	ptr32 s6_26;
	word32 a7_54;
	word32 s4_55;
	word32 s5_56;
	word32 s8_57;
	mem_free(a1, a3, a4, s2, s3, s4, mstatus, dwArg04, dwArg08, dwArg24, dwArg84, dwArgA4, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0198, out s1_21, out a1_13, out a3_15, out a4_16, out a5_17, out a7_54, out s2_22, out s3_23, out s4_55, out s5_56, out s6_26, out s8_57);
	a1Out = a1_13;
	a3Out = a3_15;
	a4Out = a4_16;
	a5Out = a5_17;
	s2Out = s2_22;
	s3Out = s3_23;
	s6Out = s6_26;
	return s1_21;
}

// 230874D6: Register Eq_2 altcp_mbedtls_alloc_config(Register Eq_2 ra, Register Eq_401688 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg74, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_401688 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      altcp_tls_create_config
Eq_2 altcp_mbedtls_alloc_config(Eq_2 ra, Eq_401688 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg74, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_401688 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_401688 a5_5 = (word32) (word16) a0;
	if (a0 != a5_5)
	{
		s1Out = s1;
		a0Out = 0x00;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return ra;
	}
	else
	{
		ptr32 a0_15;
		Eq_401688 a5_17;
		Eq_2 a3_22;
		Eq_2 a4_23;
		ptr32 s1_26;
		Eq_2 s2_27;
		ptr32 s3_28;
		ptr32 s4_29;
		ptr32 s5_30;
		ptr32 s6_31;
		word32 s0_99;
		word32 a1_100;
		Eq_2 ra_38 = mem_calloc(ra, 0x01, a5_5, a3, a4, s2, mstatus, dwArg14, dwArg74, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out s0_99, out s1_26, out a0_15, out a1_100, out a3_22, out a4_23, out a5_17, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31);
		s1Out = s1_26;
		a0Out = a0_15;
		a3Out = a3_22;
		a4Out = a4_23;
		a5Out = a5_17;
		s2Out = s2_27;
		s3Out = s3_28;
		s4Out = s4_29;
		s5Out = s5_30;
		s6Out = s6_31;
		return ra_38;
	}
}

// 230874EC: Register Eq_2 altcp_mbedtls_free_config(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      altcp_tls_create_config
//      altcp_tls_create_config_client_common
//      altcp_tls_create_config_client_2wayauth
//      altcp_tls_free_config
Eq_2 altcp_mbedtls_free_config(Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 a4_18;
	Eq_2 s4_22;
	Eq_2 a3_17 = mbedtls_ssl_config_free(s1, a0, a2, a5, mstatus, dwArg0138, dwArg0178, out a4_18, out s4_22);
	ptr32 a3_34;
	ptr32 a4_35;
	ptr32 a5_36;
	ptr32 s1_40;
	ptr32 s2_41;
	ptr32 s3_42;
	ptr32 s4_43;
	ptr32 s5_44;
	ptr32 s6_45;
	ptr32 s8_46;
	word32 a1_79;
	word32 a7_80;
	Eq_2 s0_39 = mem_free(a0, a3_17, a4_18, s2, s3, s4_22, mstatus, dwArg04, dwArg08, dwArg24, dwArg84, dwArgA4, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0198, out s1_40, out a1_79, out a3_34, out a4_35, out a5_36, out a7_80, out s2_41, out s3_42, out s4_43, out s5_44, out s6_45, out s8_46);
	s1Out = s1_40;
	a3Out = a3_34;
	a4Out = a4_35;
	a5Out = a5_36;
	s2Out = s2_41;
	s3Out = s3_42;
	s4Out = s4_43;
	s5Out = s5_44;
	s6Out = s6_45;
	s8Out = s8_46;
	return s0_39;
}

// 23087504: void block_cipher_df(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_random
void block_cipher_df(Eq_2 ra, Eq_2 a1, Eq_2 a2)
{
	if (a2 > 384)
		return;
	word32 a3_435;
	word32 a4_436;
	word32 a4_439;
	word32 a5_437;
	word32 a1_438;
	word32 a5_440;
	word32 a1_433;
	word32 t1_431;
	word32 a0_432;
	word32 a2_434;
	Eq_2 ra_111 = mbedtls_aes_init(memset(ra, fp + -448, 0x00, 416, out t1_431, out a0_432, out a1_433, out a2_434, out a3_435, out a4_436, out a5_437), fp + -728, out a1_438, out a4_439, out a5_440);
	word32 a5_445;
	word32 a6_446;
	word32 a7_447;
	word32 a1_441;
	word32 a4_444;
	word32 a2_442;
	word32 a3_443;
	memcpy(fp + -424, a1, a2, out a1_441, out a2_442, out a3_443, out a4_444, out a5_445, out a6_446, out a7_447);
	(word32) a2 + (fp + -32) + 0x0E78 = (ptr32) 0x80;
	Eq_492534 a5_80 = 0x00;
	do
	{
		*((word32) a5_80.u0 + (fp + -808)) = (byte) a5_80;
		a5_80 = (word32) a5_80.u0 + 1;
	} while (a5_80 != 32);
	word32 s4_452;
	word32 a1_449;
	word32 a4_451;
	word32 a3_450;
	word32 a0_448;
	Eq_2 s0_121 = mbedtls_aes_setkey_enc(fp + -728, fp + -808, 0x0100, (struct Eq_492556 *) 32, a5_80, dwLoc02FC, dwLoc0218, out a0_448, out a1_449, out a3_450, out a4_451, out s4_452);
	Eq_2 s5_105 = 0x10;
	do
	{
		word32 t1_465;
		word32 a0_466;
		word32 a1_467;
		word32 a2_468;
		word32 a3_469;
		word32 a4_470;
		word32 a5_471;
		ra_111 = memset(ra_111, fp + -0x0338, 0x00, 0x10, out t1_465, out a0_466, out a1_467, out a2_468, out a3_469, out a4_470, out a5_471);
		Eq_2 s2_122 = s0_121;
		ptr32 s4_123 = fp + -448;
		do
		{
			struct Eq_492581 * a4_125 = fp + -0x0338;
			Eq_2 a5_126 = 0x00;
			do
			{
				++a4_125;
				a4_125[0x0FFF] = (struct Eq_492581) (byte) ((word32) *((word32) a5_126 + s4_123) ^ (word32) a4_125->b0000);
				a5_126 = (word32) a5_126 + 1;
			} while (a5_126 != s5_105);
			word32 s10_457;
			word32 s8_455;
			word32 s7_454;
			word32 s9_456;
			int32 s3_167;
			int32 s6_170;
			word32 s1_453;
			word32 s11_458;
			s0_121 = mbedtls_aes_crypt_ecb(0x01, fp + -0x0338, fp + -0x0338, dwLoc0314, dwLoc0208, out s1_453, out s2_122, out s3_167, out s4_123, out s5_105, out s6_170, out s7_454, out s8_455, out s9_456, out s10_457, out s11_458);
		} while (s2_122 != 0x00);
		struct Eq_492556 * a4_186;
		word32 a1_459;
		word32 a2_460;
		word32 a3_461;
		word32 a5_462;
		word32 a6_463;
		word32 a7_464;
		memcpy(fp + -776 + s3_167, fp + -0x0338, 0x10, out a1_459, out a2_460, out a3_461, out a4_186, out a5_462, out a6_463, out a7_464);
		word32 a5_199 = (word32) bLoc01BD;
		bLoc01BD = (byte) (a5_199 + 0x01);
	} while (s3_167 + 0x10 != s6_170);
	word32 a0_472;
	word32 a1_473;
	word32 a3_474;
	word32 a4_475;
	word32 s4_476;
	mbedtls_aes_setkey_enc(fp + -728, fp + -776, 0x0100, a4_186, a5_199 + 0x01, dwLoc02FC, dwLoc0218, out a0_472, out a1_473, out a3_474, out a4_475, out s4_476);
	do
	{
		Eq_2 s1_234;
		word32 s2_477;
		word32 s3_478;
		word32 s4_479;
		word32 s5_480;
		word32 s6_481;
		word32 s7_482;
		word32 s8_483;
		word32 s9_484;
		word32 s10_485;
		word32 s11_486;
		Eq_2 s0_233 = mbedtls_aes_crypt_ecb(0x01, fp + -744, fp + -744, dwLoc0314, dwLoc0208, out s1_234, out s2_477, out s3_478, out s4_479, out s5_480, out s6_481, out s7_482, out s8_483, out s9_484, out s10_485, out s11_486);
		word32 a1_487;
		word32 a2_488;
		word32 a3_489;
		word32 a4_490;
		word32 a5_491;
		word32 a6_492;
		word32 a7_493;
		memcpy(s1_234, fp + -744, 0x10, out a1_487, out a2_488, out a3_489, out a4_490, out a5_491, out a6_492, out a7_493);
	} while (s0_233 != (word32) s1_234 + 16);
	mbedtls_aes_free(fp + -728);
}

// 23087670: Register Eq_2 ctr_drbg_update_internal(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out ptr32 a5Out, Register out Eq_492788 s2Out, Register out Eq_492788 s6Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_random
Eq_2 ctr_drbg_update_internal(Eq_2 ra, Eq_2 a0, Eq_2 dwArgD8, Eq_2 dwArgE8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a2Out, ptr32 & a5Out, union Eq_492788 & s2Out, union Eq_492788 & s6Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 t1_238;
	word32 a5_244;
	word32 a1_240;
	word32 a2_241;
	word32 a4_243;
	word32 a3_242;
	word32 a0_239;
	memset(ra, fp + -80, 0x00, 48, out t1_238, out a0_239, out a1_240, out a2_241, out a3_242, out a4_243, out a5_244);
	Eq_2 s0_156 = a0;
	Eq_492788 s2_27 = 0x00;
	Eq_2 s5_37 = (word32) a0 + 0x0F;
	do
	{
		Eq_2 a3_43 = (word32) s2_27.u0 + (fp + -80);
		Eq_2 a4_45 = s5_37;
		while (true)
		{
			ui32 a5_50 = (word32) *a4_45 + 0x01 & 0x00FF;
			*a4_45 = (byte) a5_50;
			if (a5_50 != 0x00)
				break;
			Eq_2 a5_52 = (word32) a4_45 - 1;
			if (s0_156 == a4_45)
				break;
			a4_45 = a5_52;
		}
		ptr32 s10_80;
		ptr32 s11_81;
		struct Eq_492553 * s3_83;
		ptr32 s4_84;
		Eq_492788 s6_86;
		word32 s7_245;
		word32 s9_247;
		word32 s8_246;
		struct Eq_492843 * s1_103;
		s0_156 = mbedtls_aes_crypt_ecb(0x01, s0_156, a3_43, dwLoc24, dwArgE8, out s1_103, out s2_27, out s3_83, out s4_84, out s5_37, out s6_86, out s7_245, out s8_246, out s9_247, out s10_80, out s11_81);
	} while (s2_27 != s6_86);
	Eq_492534 a5_101 = 0x00;
	do
	{
		++s1_103;
		struct Eq_492556 * a4_109 = (word32) *((word32) a5_101.u0 + s4_84) ^ (word32) s1_103->b0000;
		s1_103[0x0FFF] = (struct Eq_492843) (byte) a4_109;
		a5_101 = (word32) a5_101.u0 + 1;
	} while (a5_101 != 48);
	word32 s4_252;
	word32 a0_248;
	word32 a1_249;
	word32 a4_251;
	word32 a3_250;
	Eq_2 s0_124 = mbedtls_aes_setkey_enc(s3_83, fp + -80, 0x0100, a4_109, a5_101, dwLoc0C, dwArgD8, out a0_248, out a1_249, out a3_250, out a4_251, out s4_252);
	ptr32 a5_133;
	ptr32 a2_136;
	word32 a6_256;
	word32 a7_257;
	word32 a1_253;
	word32 a4_255;
	word32 a3_254;
	memcpy(s0_124, fp + -48, 0x10, out a1_253, out a2_136, out a3_254, out a4_255, out a5_133, out a6_256, out a7_257);
	s0Out = s0_124;
	s1Out = dwLoc4C;
	a2Out = a2_136;
	a5Out = a5_133;
	s2Out = s2_27;
	s6Out = s6_86;
	s10Out = s10_80;
	s11Out = s11_81;
	return dwLoc08;
}

