pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23087720: Register Eq_2 mbedtls_ctr_drbg_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      altcp_tls_create_config
Eq_2 mbedtls_ctr_drbg_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 320, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 2308772A: Register int32 mbedtls_ctr_drbg_reseed(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 s3, Register out Eq_2 a2Out, Register out Eq_2 a5Out, Register out ptr32 s6Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ctr_drbg_seed
//      mbedtls_ctr_drbg_random
int32 mbedtls_ctr_drbg_reseed(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 s3, union Eq_2 & a2Out, union Eq_2 & a5Out, ptr32 & s6Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_492954 * a0_17 = *((word32) a4 + 24);
	Eq_2 a5_138 = 384;
	int32 s2_122 = -56;
	if (a4 <= 384)
	{
		a5_138 = 384 - a4;
		s2_122 = -56;
		if (a5_138 >= a2)
		{
			struct Eq_492971 * a2_32;
			word32 a4_34;
			word32 a3_232;
			word32 a5_233;
			word32 a0_230;
			word32 a1_231;
			word32 t1_229;
			Eq_2 ra_36 = memset(ra, fp + -416, 0x00, 384, out t1_229, out a0_230, out a1_231, out a2_32, out a3_232, out a4_34, out a5_233);
			word32 s0_40 = a2_32->dw0018;
			Eq_2 sp_43;
			Eq_2 ra_45;
			Eq_2 s0_46;
			Eq_2 s1_47;
			Eq_2 s4_49;
			word32 a0_50;
			word32 a3_55;
			word32 t0_56;
			word32 t1_57;
			word32 a7_157;
			word32 a6_158;
			word32 t3_159;
			word32 t4_160;
			word32 t5_161;
			word32 t6_162;
			word32 s7_165;
			word32 s8_166;
			word32 s9_167;
			word32 t2_168;
			word32 tp_169;
			word32 s5_170;
			a0_17->ptr0138();
			if (a0_50 == 0x00)
			{
				Eq_2 s3_60 = *((word32) s0_46 + 24);
				if (s4_49 != 0x00 && s1_47 != 0x00)
				{
					word32 a1_236;
					word32 a2_237;
					word32 a3_238;
					word32 a4_239;
					word32 a5_240;
					word32 a6_241;
					word32 a7_242;
					memcpy(sp_43 + s3_60, s4_49, s1_47, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out a6_241, out a7_242);
					s3_60 += s1_47;
				}
				block_cipher_df(ra_45, sp_43, s3_60);
				Eq_2 s0_118;
				word32 s1_234;
				word32 a5_235;
				ctr_drbg_update_internal(ra_45, s0_46, *((word32) sp_43 + 0x00D8), *((word32) sp_43 + 232), out s0_118, out s1_234, out a2, out a5_235, out s2_122, out s6, out s10, out s11);
				*(union Eq_2 *) 0x11 = s0_118;
				a5_138.u0 = 0x01;
			}
			else
				s2_122 = -52;
		}
	}
	a2Out = a2;
	a5Out = a5_138;
	s6Out = s6;
	s10Out = s10;
	s11Out = s11;
	return s2_122;
}

// 230877D2: Register Eq_2 mbedtls_ctr_drbg_seed_entropy_len(Register Eq_2 ra, Register (ptr32 Eq_489953) a0, Register ptr32 a1, Register ptr32 a2, Stack Eq_2 dwArgD8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ctr_drbg_seed
Eq_2 mbedtls_ctr_drbg_seed_entropy_len(Eq_2 ra, struct Eq_489953 * a0, ptr32 a1, ptr32 a2, Eq_2 dwArgD8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_492556 * a4_44;
	struct Eq_493094 * a5_45;
	word32 t1_131;
	word32 a0_132;
	word32 a1_133;
	word32 a2_134;
	word32 a3_135;
	word32 a4_136;
	word32 a5_137;
	word32 a1_138;
	Eq_2 ra_46 = mbedtls_aes_init(memset(ra, fp + -64, 0x00, 32, out t1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137), (char *) a0 + 32, out a1_138, out a4_44, out a5_45);
	a0->ptr0138 = a1;
	a0->ptr013C = a2;
	a5_45->ptr0018 = a0;
	*(struct Eq_489953 **) 0x0200072C = a0;
	Eq_2 a3_62;
	Eq_2 a4_63;
	ptr32 s4_68;
	word32 a0_139;
	word32 a1_140;
	mbedtls_aes_setkey_enc((char *) a0 + 32, fp + -64, 0x0100, a4_44, 0x02000710, dwLoc0C, dwArgD8, out a0_139, out a1_140, out a3_62, out a4_63, out s4_68);
	ptr32 a5_77;
	ptr32 a2_79;
	ptr32 s10_84;
	ptr32 s11_85;
	ptr32 s6_87;
	ptr32 a0_76 = mbedtls_ctr_drbg_reseed(ra_46, a3_62, a4_63, a4_63, a1, out a2_79, out a5_77, out s6_87, out s10_84, out s11_85);
	s0Out = dwArg74;
	s1Out = a4;
	a0Out = a0_76;
	a2Out = a2_79;
	a5Out = a5_77;
	s2Out = a2;
	s3Out = a1;
	s4Out = s4_68;
	s6Out = s6_87;
	s7Out = s7_88;
	s10Out = s10_84;
	s11Out = s11_85;
	return dwLoc08;
}

// 2308783C: Register Eq_2 mbedtls_ctr_drbg_seed(Register Eq_2 ra, Register (ptr32 Eq_489953) a0, Register ptr32 a1, Register ptr32 a2, Stack Eq_2 dwArgD8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      altcp_tls_create_config
Eq_2 mbedtls_ctr_drbg_seed(Eq_2 ra, struct Eq_489953 * a0, ptr32 a1, ptr32 a2, Eq_2 dwArgD8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_9;
	ptr32 a2_11;
	ptr32 a5_14;
	ptr32 s0_18;
	ptr32 s1_19;
	ptr32 s10_20;
	ptr32 s11_21;
	ptr32 s2_22;
	ptr32 s3_23;
	ptr32 s4_24;
	ptr32 s6_26;
	ptr32 s7_27;
	Eq_2 ra_17 = mbedtls_ctr_drbg_seed_entropy_len(ra, a0, a1, a2, dwArgD8, out s0_18, out s1_19, out a0_9, out a2_11, out a5_14, out s2_22, out s3_23, out s4_24, out s6_26, out s7_27, out s10_20, out s11_21);
	s0Out = s0_18;
	s1Out = s1_19;
	a0Out = a0_9;
	a2Out = a2_11;
	a5Out = a5_14;
	s2Out = s2_22;
	s3Out = s3_23;
	s4Out = s4_24;
	s6Out = s6_26;
	s7Out = s7_27;
	s10Out = s10_20;
	s11Out = s11_21;
	return ra_17;
}

// 23087844: void mbedtls_ctr_drbg_random_with_add(Register Eq_2 ra, Register ptr32 a1, Register Eq_493202 a2, Register Eq_493203 a4, Register word32 s4, Stack (ptr32 Eq_493205) dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8)
// Called from:
//      mbedtls_ctr_drbg_random
void mbedtls_ctr_drbg_random_with_add(Eq_2 ra, ptr32 a1, Eq_493202 a2, Eq_493203 a4, word32 s4, struct Eq_493205 * dwArg34, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArgC8)
{
	if (a2 > 0x0400 || a4 > 0x0100)
		return;
	Eq_493202 s1_141 = a2;
	Eq_2 a3_40;
	Eq_2 a4_41;
	struct Eq_493205 * a5_42;
	word32 a2_419;
	word32 a1_418;
	word32 t1_416;
	word32 a0_417;
	Eq_2 ra_222 = memset(ra, fp + -80, 0x00, 48, out t1_416, out a0_417, out a1_418, out a2_419, out a3_40, out a4_41, out a5_42);
	Eq_2 s0_110 = dwArg54;
	if (a5_42 >= dwArg34)
	{
		s0_110 = a5_42->t0014;
		if (a5_42 == null)
		{
			if (a4_41 != 0x00)
			{
				block_cipher_df(ra_222, a3_40, a4_41);
				word32 s2_448;
				word32 s6_449;
				word32 s10_450;
				word32 s11_451;
				word32 a5_447;
				word32 a2_446;
				ra_222 = ctr_drbg_update_internal(ra_222, s0_110, dwArg68, dwArg78, out s0_110, out s1_141, out a2_446, out a5_447, out s2_448, out s6_449, out s10_450, out s11_451);
			}
l230878C4:
			Eq_2 s4_138 = (word32) s0_110 + 0x0F;
			while (s1_141 != 0x00)
			{
				Eq_2 a4_143 = s4_138;
				while (true)
				{
					ui32 a5_148 = (word32) *a4_143 + 0x01 & 0x00FF;
					*a4_143 = (byte) a5_148;
					if (a5_148 != 0x00)
						break;
					Eq_2 a5_150 = (word32) a4_143 - 1;
					if (s0_110 == a4_143)
						break;
					a4_143 = a5_150;
				}
				Eq_2 s1_174;
				Eq_2 s3_178;
				Eq_2 s6_181;
				word32 s7_434;
				word32 s8_435;
				word32 s9_436;
				word32 s10_437;
				word32 s11_438;
				word32 s5_433;
				word32 s2_432;
				s0_110 = mbedtls_aes_crypt_ecb(0x01, s0_110, fp + -96, s4, dwArgC8, out s1_174, out s2_432, out s3_178, out s4_138, out s5_433, out s6_181, out s7_434, out s8_435, out s9_436, out s10_437, out s11_438);
				Eq_2 s2_193 = s1_174;
				if (s6_181 < s1_174)
					s2_193.u0 = 0x10;
				word32 a3_441;
				word32 a4_442;
				word32 a5_443;
				word32 a6_444;
				word32 a7_445;
				word32 a2_440;
				word32 a1_439;
				memcpy(s3_178, fp + -96, s2_193, out a1_439, out a2_440, out a3_441, out a4_442, out a5_443, out a6_444, out a7_445);
				s1_141 = s1_174 - s2_193;
			}
			struct Eq_493263 * a5_235;
			word32 a2_427;
			word32 s2_428;
			word32 s6_429;
			word32 s10_430;
			word32 s11_431;
			word32 s1_426;
			word32 s0_425;
			ctr_drbg_update_internal(ra_222, s0_110, dwArg68, dwArg78, out s0_425, out s1_426, out a2_427, out a5_235, out s2_428, out s6_429, out s10_430, out s11_431);
			a5_235->dw0011 = a5_235->dw0010;
			return;
		}
	}
	word32 a2_420;
	word32 a5_421;
	word32 s6_422;
	word32 s10_423;
	word32 s11_424;
	if (mbedtls_ctr_drbg_reseed(ra_222, a3_40, a4_41, a4_41, a1, out a2_420, out a5_421, out s6_422, out s10_423, out s11_424) != 0x00)
		return;
	goto l230878C4;
}

// 2308792C: void mbedtls_ctr_drbg_random(Register Eq_2 ra, Register ptr32 a1, Register Eq_493202 a2, Register word32 s4, Stack (ptr32 Eq_493205) dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8)
void mbedtls_ctr_drbg_random(Eq_2 ra, ptr32 a1, Eq_493202 a2, word32 s4, struct Eq_493205 * dwArg34, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArgC8)
{
	mbedtls_ctr_drbg_random_with_add(ra, a1, a2, 0x00, s4, dwArg34, dwArg54, dwArg68, dwArg78, dwArgC8);
}

// 23087934: Register Eq_2 mbedtls_entropy_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      altcp_tls_create_config
Eq_2 mbedtls_entropy_init(Eq_2 ra, Eq_2 a0)
{
	struct Eq_493388 * a4_16;
	word32 a2_60;
	word32 a3_61;
	word32 a1_59;
	word32 a0_58;
	word32 t1_57;
	word32 a5_62;
	Eq_2 ra_18 = memset(ra, a0, 0x00, 520, out t1_57, out a0_58, out a1_59, out a2_60, out a3_61, out a4_16, out a5_62);
	mbedtls_sha256_starts(a0, null);
	int32 s0_24 = a4_16->dw0074;
	if (a4_16 <= (struct Eq_493388 *) 0x13)
	{
		struct Eq_493419 * a5_31 = (char *) a4_16 + 20 + s0_24;
		g_ptr230879FE = a5_31;
		a5_31->dw0084 = 32;
		a5_31->dw007C = 0x00;
		a5_31->dw0088 = 0x01;
		a4_16->dw0075 = s0_24;
	}
	return ra_18;
}

// 23087986: void mbedtls_platform_entropy_poll(Register int32 a1, Register (ptr32 Eq_64398) a2, Register (ptr32 Eq_64398) a3)
void mbedtls_platform_entropy_poll(int32 a1, struct Eq_64398 * a2, struct Eq_64398 * a3)
{
	a3->dw0000 = null;
	Eq_2 a0_10 = 0x00;
	struct Eq_64398 * s0_11;
	for (s0_11 = null; s0_11 != a2; ++s0_11)
	{
		if ((s0_11 & 3) == 0x00)
		{
			word32 a2_84;
			word32 a4_85;
			word32 a5_86;
			word32 s4_87;
			word32 s8_88;
			bl_rand(a0_10, a2, out a0_10, out a1, out a2_84, out a3, out a4_85, out a5_86, out s4_87, out s8_88);
			a2 = dwArg84;
			s0_11 = a3;
		}
		s0_11[a1] = (struct Eq_64398) (byte) a0_10;
		a0_10 >>= 8;
	}
	s0_11->dw0000 = a3;
}

// 230879C8: void mbedtls_pk_init(Register Eq_2 a0)
// Called from:
//      altcp_tls_create_config_client_2wayauth
void mbedtls_pk_init(Eq_2 a0)
{
	if (a0 != 0x00)
	{
		*a0 = 0x00;
		*((word32) a0 + 4) = 0x00;
	}
}

