pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230879D4: Register Eq_2 mbedtls_pk_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      altcp_tls_free_config
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_pk_parse_key
//      mbedtls_x509_crt_free
Eq_2 mbedtls_pk_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a5Out = a5;
		return ra;
	}
	else
	{
		Eq_2 a0_10 = *a5;
		if (a5 != 0x00)
		{
			<anonymous> * a5_12 = *((word32) a5 + 40);
			byte * s0_16;
			word32 a2_19;
			a5_12();
			a5 = s0_16 + 8;
			s0_21 = s0_16;
			while (true)
			{
				byte * s0_21;
				if (s0_21 == s0_16 + 8)
					break;
				*s0_21 = 0x00;
				++s0_21;
			}
		}
		a0Out = a0_10;
		a2Out = dwArg10;
		a5Out = a5;
		return ra;
	}
}

struct Eq_493419 * g_ptr230879FE = &g_t8082B7FD;
// 23087A02: Register word32 mbedtls_pk_info_from_type(Register word32 a0, Register out Eq_493520 a5Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_pk_parse_key
word32 mbedtls_pk_info_from_type(word32 a0, union Eq_493520 & a5Out)
{
	uint32 a0_5 = a0 + ~0x00 & 0x00FF;
	if (a0_5 > 0x02)
	{
		a5Out.u0 = 0x02;
		return 0x00;
	}
	else
	{
		word32 a0_13 = g_a230C6AE8[a0_5 * 0x04];
		a5Out.u0 = 588016360;
		return a0_13;
	}
}

// 23087A22: Register Eq_2 mbedtls_pk_setup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a5, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_pk_parse_key
Eq_2 mbedtls_pk_setup(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, ptr32 a1, Eq_2 a5, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00 && a1 != 0x00)
	{
		word32 a0_7 = *a5;
		if (a5 == 0x00)
		{
			ptr32 a0_31;
			Eq_2 a1_10 = *((word32) a5 + 36);
			struct Eq_493564 * a0_21;
			ptr32 a1_22;
			Eq_2 a5_23;
			word32 s0_24;
			Eq_2 s1_25;
			Eq_2 ra_26;
			word32 a2_27;
			word32 tp_28;
			a5();
			a0_21->dw0004 = s0_24;
			if (a0_21 != null)
			{
				*s1_25 = s0_24;
				a0_31 = 0x00;
			}
			else
				a0_31 = 0xFC000080;
			s1Out = s1_25;
			a0Out = a0_31;
			a1Out = a1_22;
			a2Out = dwArg10;
			a5Out = a5_23;
			return ra_26;
		}
	}
	s1Out = s1;
	a0Out = 0xFC000180;
	a1Out = a1;
	a2Out = a2;
	a5Out = a5;
	return ra;
}

// 23087A5C: Register Eq_2 mbedtls_pk_can_do(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_pk_verify_ext
//      mbedtls_ssl_sig_from_pk
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_pk_can_do(Eq_2 a0, ptr32 a1, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		a5Out = a5;
		return 0x00;
	}
	else
	{
		Eq_2 a0_12;
		Eq_2 a5_13;
		word32 t1_14;
		(*((word32) a5 + 0x0C))();
		a5Out = a5_13;
		return a0_12;
	}
}

// 23087A6E: Register Eq_2 mbedtls_pk_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_135083 a4, Register Eq_2 a5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC4, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_135083 a4Out, Register out Eq_2 a5Out, Register out Eq_135083 s8Out)
// Called from:
//      mbedtls_pk_verify_ext
Eq_2 mbedtls_pk_verify(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_135083 a4, Eq_2 a5, Eq_2 dwArg00, Eq_2 dwArg44, Eq_2 dwArgA4, Eq_2 dwArgC4, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_135083 & a4Out, union Eq_2 & a5Out, union Eq_135083 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a0Out = 0xFC000180;
		a4Out = a4;
		a5Out = a5;
		s8Out = s8;
		return ra;
	}
	ptr32 a0_22;
	Eq_2 s0_107 = a0;
	Eq_2 a0_10 = *a0;
	if (a0_10 != 0x00)
	{
		if (a3 != 0x00)
		{
l23087AB2:
			s0_107 = *a0_10;
			<anonymous> * t1_30 = *((word32) a0_10 + 16);
			if (t1_30 != null)
			{
				ptr32 a0_52;
				Eq_2 s0_53;
				Eq_2 ra_54;
				Eq_2 a5_57;
				Eq_135083 a4_58;
				word32 tp_60;
				word32 t1_61;
				Eq_135083 s8_62;
				t1_30();
				s0Out = s0_53;
				a0Out = a0_52;
				a4Out = a4_58;
				a5Out = a5_57;
				s8Out = s8_62;
				return ra_54;
			}
			a0_22 = 0xFC000100;
l23087A7E:
			s0Out = s0_107;
			a0Out = a0_22;
			a4Out = a4;
			a5Out = a5;
			s8Out = dwLoc1C;
			return ra;
		}
		word32 a5_129;
		mbedtls_md_info_from_type(a0, out a5_129);
		a0_10 = a1;
		dwLoc1C = a4;
		if (a1 != 0x00)
		{
			mbedtls_md_get_size(a0);
			0x00 = (int8) dwArg44;
			a2 = dwArgC4;
			a3 = a1;
			goto l23087AB2;
		}
	}
	a0_22 = 0xFC000180;
	goto l23087A7E;
}

// 23087ACE: void mbedtls_pk_sign(Register word32 ra, Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a3, Register word32 a4, Register word32 a5, Register word32 a6, Register word32 a7, Stack word32 dwArg34, Stack word32 dwArg94, Stack word32 dwArgB4, Stack word32 dwArgE4, Stack word32 dwArg0100)
void mbedtls_pk_sign(word32 ra, union Eq_2 * a0, Eq_2 a1, Eq_2 a3, word32 a4, word32 a5, word32 a6, word32 a7, word32 dwArg34, word32 dwArg94, word32 dwArgB4, word32 dwArgE4, word32 dwArg0100)
{
	if (a0 == null)
		return;
	Eq_2 a0_10 = *a0;
	if (a0_10 == 0x00)
		return;
	if (a3 == 0x00)
	{
		Eq_2 a0_25 = mbedtls_md_info_from_type(a1, out a5);
		if (a0_25 == 0x00)
			return;
		a0_10 = mbedtls_md_get_size(a0_25);
		a6 = dwArg94;
		a3 = a0_10;
	}
	<anonymous> * t1_40 = *((word32) a0_10 + 20);
	if (t1_40 == null)
		return;
	word32 t3_73;
	word32 s8_74;
	word32 s4_75;
	word32 t1_76;
	t1_40();
}

// 23087B36: void mbedtls_pk_decrypt(Register (ptr32 (ptr32 Eq_493707)) a0)
void mbedtls_pk_decrypt(struct Eq_493707 ** a0)
{
	if (a0 == null)
		return;
	struct Eq_493707 * t1_5 = *a0;
	if (t1_5 == null)
		return;
	<anonymous> * t1_8 = t1_5->ptr0018;
	if (t1_8 == null)
		return;
	word32 t1_14;
	t1_8();
}

