pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23087FC2: Register Eq_2 pk_get_pk_alg(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
Eq_2 pk_get_pk_alg(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_116;
	ptr32 a5_127;
	Eq_2 a5_30;
	word32 a4_171;
	word32 a1_168;
	word32 a3_170;
	word32 a2_169;
	word32 a0_167;
	word32 t1_166;
	Eq_2 ra_31 = memset(ra, a3, 0x00, 0x0C, out t1_166, out a0_167, out a1_168, out a2_169, out a3_170, out a4_171, out a5_30);
	Eq_2 a2_39;
	Eq_2 a5_42;
	ptr32 s3_47;
	ptr32 s4_48;
	word32 a0_52;
	ptr32 a4_124;
	ptr32 a3_121;
	ptr32 a1_118;
	ptr32 s2_138;
	Eq_2 s1_135 = mbedtls_asn1_get_alg(a1, fp + -44, a3, a5_30, dwArg84, dwArgF8, out a0_52, out a1_118, out a2_39, out a3_121, out a4_124, out a5_42, out s2_138, out s3_47, out s4_48);
	if (a0_52 != 0x00)
	{
		a5_127 = 0xFC000580;
		a0_116 = a0_52 + 0xFC000580;
	}
	else
	{
		s1_135 = mbedtls_oid_get_pk_alg(fp + -44, s1_135, a2_39, a5_42, dwArg08, out a0_116, out a1_118, out a3_121, out a4_124, out a5_127, out s2_138);
		if (a0_116 == 0x00)
		{
			a4_124 = (word32) *s1_135;
			a5_127 = 0x01;
			if (a4_124 == 0x01)
			{
				a4_124 = 0x05;
				if (true && true || true)
					a0_116 = 0xFC000580;
			}
		}
		else
			a0_116 = 0xFC000380;
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_135;
	a0Out = a0_116;
	a1Out = a1_118;
	a3Out = a3_121;
	a4Out = a4_124;
	a5Out = a5_127;
	s2Out = s2_138;
	s3Out = s3_47;
	s4Out = s4_48;
	return ra_31;
}

// 23088036: Register Eq_2 pk_parse_key_pkcs8_unencrypted_der(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_pk_parse_key
Eq_2 pk_parse_key_pkcs8_unencrypted_der(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_119;
	Eq_2 s1_112 = a0;
	word32 a2_426;
	word32 a1_425;
	ptr32 a4_109;
	ptr32 a3_108;
	Eq_2 a5_101;
	word32 a0_204 = mbedtls_asn1_get_tag(a1 + a2, fp + -36, 48, a5, out a1_425, out a2_426, out a3_108, out a4_109, out a5_101);
	byte bLoc29_234 = SLICE((uint32) nLoc2C, byte, 24);
	if (a0_204 != 0x00)
	{
l23088056:
		s0_119 = (word32) a0_204 - 0x03FFFD00;
		goto l2308805E;
	}
	word32 a1_427;
	mbedtls_asn1_get_int(s0 + a5_101, fp + -40, a5_101, out s1_112, out a0_204, out a1_427, out a3_108, out a4_109, out a5_101);
	if (a0_204 != 0x00)
		goto l23088056;
	if (a5_101 != 0x00)
	{
		s0_119.u0 = 0xFC000280;
		goto l2308805E;
	}
	Eq_2 s0_61;
	word32 s4_429;
	word32 a1_428;
	ra = pk_get_pk_alg(ra, dwArgB4, fp + -28, a1, dwArg54, dwArgC8, dwArgF8, out s0_61, out s1_112, out a0_204, out a1_428, out a3_108, out a4_109, out a5_101, out s2, out s3, out s4_429);
	if (a0_204 != 0x00)
		goto l23088056;
	word32 a2_431;
	word32 a1_430;
	a0_204 = mbedtls_asn1_get_tag(s0_61, fp + -36, 0x04, a5_101, out a1_430, out a2_431, out a3_108, out a4_109, out a5_101);
	if (a0_204 != 0x00)
		goto l23088056;
	if (a5_101 == 0x00)
	{
		s0_119.u0 = 0xFC0002A0;
		goto l2308805E;
	}
	ptr32 a0_86 = mbedtls_pk_info_from_type((word32) bLoc29_234, out a5_101);
	if (a0_86 == 0x00)
	{
l230880AE:
		s0_119.u0 = 0xFC000380;
		goto l2308805E;
	}
	Eq_2 a0_90;
	Eq_2 a1_91;
	Eq_2 a2_92;
	ra = mbedtls_pk_setup(ra, s0_61, s1_112, s1_112, a0_86, a5_101, out s1_112, out a0_90, out a1_91, out a2_92, out a5_101);
	s0_119 = a0_90;
	if (a0_90 != 0x00)
		goto l2308805E;
	Eq_2 a0_127;
	Eq_2 a5_98 = (word32) bLoc29_234;
	a4_109 = 0x01;
	if (a5_98 == 0x01)
	{
		word32 a2_433;
		word32 s0_432;
		ra = pk_parse_key_pkcs1_der(ra, a0_90, a1_91, dwArg54, a5_98, s2, s6, s7, s10, s11, mstatus, a1, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg44, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_432, out s1_112, out a0_127, out a2_433, out a3_108, out a4_109, out a5_101, out s2, out s3, out s6, out s7, out s10, out s11);
	}
	else
	{
		a5_101 = (word32) a5_98 - 2 & 0x00FF;
		if (a5_101 > 0x01)
			goto l230880AE;
		Eq_2 a0_105;
		Eq_2 a1_106;
		word32 s4_437;
		word32 a2_436;
		s1_112 = pk_use_ecparams(a0_90, a1_91, a2_92, 0x01, mstatus, dwLoc18, dwLoc0C, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out a0_105, out a1_106, out a2_436, out a3_108, out a4_109, out a5_101, out s2, out s4_437);
		s0_119 = a0_105;
		if (a0_105 != 0x00)
		{
l230880D8:
			word32 a2_435;
			word32 a0_434;
			ra = mbedtls_pk_free(ra, s1_112, a5_101, out a0_434, out a2_435, out a5_101);
			goto l2308805E;
		}
		word32 a2_438;
		ra = pk_parse_key_sec1_der(ra, *((word32) a0_105 + 4), a1_106, dwArg54, a5_101, s2, s6, s7, s10, s11, mstatus, a1, dwLoc18, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, ra, dwArg68, dwArg74, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_112, out a0_127, out a2_438, out a3_108, out a4_109, out a5_101, out s2, out s3, out s6, out s7, out s10, out s11, out mstatus);
	}
	s0_119 = a0_127;
	if (a0_127 == 0x00)
	{
l2308805E:
		s0Out = dwArgE4;
		s1Out = s1_112;
		a0Out = s0_119;
		a2Out = dwArg0100;
		a3Out = a3_108;
		a4Out = a4_109;
		a5Out = a5_101;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		s7Out = s7;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	goto l230880D8;
}

// 23088112: Register Eq_2 mbedtls_pk_parse_subpubkey(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 int32) a0, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out, Register out Eq_495405 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_pk_parse_subpubkey(Eq_2 ra, Eq_2 s1, int32 * a0, Eq_2 a1, Eq_2 a5, Eq_2 s2, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s5Out, union Eq_495405 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_108;
	Eq_2 s1_132;
	Eq_2 dwLoc38_351 = (uint32) nLoc38;
	word32 a5_35;
	word32 a4_587;
	word32 a2_585;
	word32 a3_586;
	ptr32 a1_104;
	Eq_2 a0_29 = mbedtls_asn1_get_tag(a1, fp + -52, 48, a5, out a1_104, out a2_585, out a3_586, out a4_587, out a5_35);
	byte bLoc35_354 = SLICE(dwLoc38_351, byte, 24);
	if (a0_29 != 0x00)
	{
		a5_108.u0 = 0xFC000300;
		goto l2308813E;
	}
	Eq_2 a0_43;
	Eq_2 s0_51;
	word32 a4_590;
	word32 a3_589;
	word32 s1_588;
	union Eq_2 * s3_220;
	Eq_2 s4_116;
	ra = pk_get_pk_alg(ra, *a0 + a5_35, fp + -44, dwLoc38_351, dwArg44, dwArgB8, dwArgE8, out s0_51, out s1_588, out a0_43, out a1_104, out a3_589, out a4_590, out a5_108, out s2, out s3_220, out s4_116);
	s1_132 = a0_43;
	if (a0_43 != 0x00)
		goto l23088142;
	word32 a4_69;
	word32 a3_592;
	word32 a2_591;
	word32 a5_593;
	Eq_2 s1_72 = mbedtls_asn1_get_bitstring_null(s2, fp + -52, a5_108, out a0_29, out a1_104, out a2_591, out a3_592, out a4_69, out a5_593);
	if (a0_29 != 0x00)
	{
		a5_108.u0 = 0xFC000500;
l2308813E:
		s1_132 = a0_29 + a5_108;
		goto l23088142;
	}
	a5_108 = (char *) *s3_220 + a4_69;
	if (s2 != a5_108)
	{
		s1_132.u0 = 0xFC00049A;
		goto l23088142;
	}
	ptr32 a0_80 = mbedtls_pk_info_from_type((word32) bLoc35_354, out a5_108);
	a1_104 = a0_80;
	if (a0_80 == 0x00)
	{
		s1_132.u0 = 0xFC000380;
		goto l23088142;
	}
	Eq_2 a0_86;
	Eq_2 a2_88;
	word32 s1_594;
	ra = mbedtls_pk_setup(ra, s0_51, s1_72, s4_116, a0_80, a5_108, out s1_594, out a0_86, out a1_104, out a2_88, out a5_108);
	s1_132 = a0_86;
	if (a0_86 == 0x00)
	{
		Eq_2 s0_117;
		Eq_2 a5_94 = (word32) bLoc35_354;
		if (a5_94 == 0x01)
		{
			Eq_2 s0_190 = *((word32) s4_116 + 4);
			word32 a4_196;
			word32 a3_596;
			word32 a2_595;
			Eq_2 a0_191 = mbedtls_asn1_get_tag(s2, fp + -48, 48, a5_94, out a1_104, out a2_595, out a3_596, out a4_196, out a5_108);
			if (a0_191 != 0x00)
			{
l230881C8:
				s0_117 = (word32) a0_191 - 0x03FFFB00;
				if (s0_117 != 0x00)
					goto l230881D2;
				goto l23088224;
			}
			a5_108 = (char *) *s3_220 + a4_196;
			if (s2 != a5_108)
				goto l230881E8;
			s5 = (word32) s0_190 + 8;
			word32 s0_599;
			word32 a2_600;
			word32 a4_601;
			ra = mbedtls_asn1_get_mpi(ra, s2, a5_108, mstatus, dwArg24, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, out s0_599, out s1_132, out a0_191, out a1_104, out a2_600, out a4_601, out a5_108, out s2, out s3_220, out s4_116);
			if (a0_191 != 0x00)
				goto l230881C8;
			Eq_2 a2_232;
			Eq_2 a4_234;
			Eq_2 s0_237;
			ra = mbedtls_asn1_get_mpi(ra, s2, a5_108, mstatus, dwArg24, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, out s0_237, out s1_132, out a0_191, out a1_104, out a2_232, out a4_234, out a5_108, out s2, out s3_220, out s4_116);
			if (a0_191 != 0x00)
				goto l230881C8;
			a5_108 = *s3_220;
			if (s2 != a5_108)
			{
l230881E8:
				s0_117.u0 = 0xFC00049A;
				goto l230881D2;
			}
			word32 a0_254;
			Eq_2 a4_256;
			Eq_2 a2_258;
			word32 a3_611;
			s1_132 = mbedtls_rsa_check_pubkey(a2_232, a4_234, a5_108, out a0_254, out a1_104, out a2_258, out a3_611, out a4_256, out a5_108);
			if (a0_254 == 0x00)
			{
				word32 a3_612;
				word32 a4_613;
				word32 a5_614;
				*((word32) mbedtls_mpi_size(a2_258, a4_256, a5_108, out a1_104, out a3_612, out a4_613, out a5_614) + 4) = s0_237;
l23088224:
				a5_108 = *s3_220;
				if (a5_108 == s2)
					goto l23088142;
				goto l230881E8;
			}
			s0_117.u0 = 0xFC000500;
			goto l230881D2;
		}
		a5_108 = (word32) a5_94 - 2 & 0x00FF;
		if (a5_108 > 0x01)
		{
			s0_117.u0 = 0xFC000380;
			goto l230881D2;
		}
		Eq_2 a0_103;
		Eq_2 a4_107;
		word32 a2_602;
		word32 a3_603;
		pk_use_ecparams(s0_51, *((word32) s4_116 + 4), a2_88, 0x01, mstatus, s2, dwLoc1C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a0_103, out a1_104, out a2_602, out a3_603, out a4_107, out a5_108, out s2, out s4_116);
		s0_117 = a0_103;
		if (a0_103 != 0x00)
		{
l230881D2:
			word32 a0_597;
			word32 a2_598;
			ra = mbedtls_pk_free(ra, s4_116, a5_108, out a0_597, out a2_598, out a5_108);
			s1_132 = s0_117;
			goto l23088142;
		}
		s5 = *((word32) s4_116 + 4);
		Eq_2 a2_119 = *s3_220;
		s6 = (word32) s5 + 0x0088;
		Eq_2 a0_124;
		Eq_2 a2_126;
		word32 s0_604;
		word32 a3_605;
		word32 a4_606;
		union Eq_2 * s3_134;
		ra = mbedtls_ecp_point_read_binary(ra, a0_103, (word32) s5 + 0x0088, a2_119, s2 - a2_119, a4_107, s2, mstatus, dwLoc40, dwLoc3C, s2, dwLoc18, dwLoc08, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_604, out s1_132, out a0_124, out a1_104, out a2_126, out a3_605, out a4_606, out a5_108, out s2, out s3_134, out s4_116);
		s0_117 = a0_124;
		if (a0_124 == 0x00)
		{
			Eq_2 a0_152;
			word32 s0_607;
			word32 a2_608;
			word32 a3_609;
			word32 a4_610;
			ra = mbedtls_ecp_check_pubkey(ra, s1_132, s5, (word32) s5 + 0x0088, a2_126, s4_116, (word32) s5 + 0x0088, s7, s10, s11, mstatus, dwLoc3C, dwLoc38_351, s2, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_607, out s1_132, out a0_152, out a1_104, out a2_608, out a3_609, out a4_610, out a5_108, out s2, out s3_134, out s4_116, out s5, out s6, out s7, out s10, out s11, out mstatus);
			s0_117 = a0_152;
		}
		*s3_134 = (union Eq_2 *) s2;
		if (s0_117 != 0x00)
			goto l230881D2;
	}
l23088142:
	0x00 = (int8) dwArg0198;
	s1Out = s1_132;
	a0Out = s1_132;
	a1Out = a1_104;
	a5Out = a5_108;
	s2Out = s2;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

