pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23088296: Register Eq_2 mbedtls_pk_parse_key(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tls_create_config_client_2wayauth
Eq_2 mbedtls_pk_parse_key(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a3_103;
	ptr32 a4_113;
	Eq_2 s1_107;
	Eq_2 s3_11 = a2;
	Eq_2 s2_116 = a1;
	Eq_2 s6_119 = a4;
	Eq_2 a5_114;
	Eq_2 ra_105 = mbedtls_pem_init(ra, fp + -60, out a5_114);
	if (a2 == 0x00)
	{
l230882C0:
		word32 a0_353;
		Eq_2 s0_360;
		Eq_2 s10_373;
		Eq_2 s11_374;
		Eq_2 s6_376;
		word32 a2_858;
		ra_105 = pk_parse_key_pkcs8_unencrypted_der(ra_105, s0, s2_116, s3_11, a5_114, s6_119, s7, s10, s11, mstatus, dwLoc3C, dwLoc38, s4, s2, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg34, dwArg38, dwArg44, dwArg48, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_360, out s1_107, out a0_353, out a2_858, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s6_376, out s7, out s10_373, out s11_374, out mstatus);
		if (a0_353 != 0x00)
		{
			word32 a0_859;
			word32 a2_860;
			word32 a5_861;
			ra_105 = mbedtls_pk_free(ra_105, s1_107, a5_114, out a0_859, out a2_860, out a5_861);
			ptr32 a0_388 = mbedtls_pk_info_from_type(0x01, out a5_114);
			if (a0_388 == 0x00)
				goto l23088364;
			Eq_2 a0_392;
			word32 a1_862;
			word32 a2_863;
			ra_105 = mbedtls_pk_setup(ra_105, s0_360, s1_107, s1_107, a0_388, a5_114, out s1_107, out a0_392, out a1_862, out a2_863, out a5_114);
			if (a0_392 != 0x00)
				goto l2308846C;
			word32 a0_402;
			Eq_2 s0_409;
			Eq_2 s10_424;
			Eq_2 s11_425;
			Eq_2 s6_427;
			word32 a2_864;
			ra_105 = pk_parse_key_pkcs1_der(ra_105, a0_392, s2_116, s3_11, a5_114, s2_116, s6_376, s7, s10_373, s11_374, mstatus, dwLoc38, s2, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg34, dwArg48, s1, dwArg68, dwArg74, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_409, out s1_107, out a0_402, out a2_864, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s6_427, out s7, out s10_424, out s11_425);
			if (a0_402 != 0x00)
			{
				word32 a0_865;
				word32 a2_866;
				word32 a5_867;
				ra_105 = mbedtls_pk_free(ra_105, s1_107, a5_114, out a0_865, out a2_866, out a5_867);
				ptr32 a0_436 = mbedtls_pk_info_from_type(0x02, out a5_114);
				if (a0_436 != 0x00)
				{
					struct Eq_495855 * a0_442;
					word32 a1_868;
					word32 a2_869;
					ra_105 = mbedtls_pk_setup(ra_105, s0_409, s1_107, s1_107, a0_436, a5_114, out s1_107, out a0_442, out a1_868, out a2_869, out a5_114);
					if (a0_442 == null)
					{
						word32 a0_452;
						word32 a2_870;
						word32 s6_871;
						word32 s10_872;
						word32 s11_873;
						ra_105 = pk_parse_key_sec1_der(ra_105, a0_442->t0004, s2_116, s3_11, a5_114, s2_116, s6_427, s7, s10_424, s11_425, mstatus, dwLoc38, s2, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, s3, s1, dwArg64, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_107, out a0_452, out a2_870, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s6_871, out s7, out s10_872, out s11_873, out mstatus);
						if (a0_452 != 0x00)
						{
							word32 a0_874;
							word32 a2_875;
							ra_105 = mbedtls_pk_free(ra_105, s1_107, a5_114, out a0_874, out a2_875, out a5_114);
							s0.u0 = 0xFC000300;
							goto l2308836A;
						}
					}
					goto l2308846C;
				}
				goto l23088364;
			}
		}
l2308846C:
		s0.u0 = 0x00;
		goto l2308836A;
	}
	a5_114 = (word32) *((word32) a1 + ((word32) a2 - 1));
	if (a5_114 != 0x00)
		goto l230882C0;
	Eq_2 a2_178;
	Eq_2 a5_181;
	Eq_2 s1_184;
	Eq_2 a0_176;
	Eq_2 a0_57;
	byte * s4_64;
	word32 s0_876;
	word32 a1_877;
	word32 a2_878;
	word32 a5_879;
	word32 s5_880;
	word32 s8_881;
	word32 s9_882;
	ra_105 = mbedtls_pem_read_buffer(ra_105, s0, fp + -60, 0x230C6B20, 0x230C6B00, a1, fp + -64, a1, mstatus, dwArg34, dwArg88, dwArgC8, dwArg0108, out s0_876, out s1_107, out a0_57, out a1_877, out a2_878, out a3_103, out a4_113, out a5_879, out s2_116, out s3_11, out s4_64, out s5_880, out s6_119, out s7, out s8_881, out s9_882, out s10, out s11);
	s0 = a0_57;
	if (a0_57 == 0x00)
	{
		ptr32 a0_255 = mbedtls_pk_info_from_type(0x01, out a5_114);
		if (a0_255 == 0x00)
			goto l23088364;
		Eq_2 a0_259;
		Eq_2 a1_260;
		Eq_2 a2_261;
		ra_105 = mbedtls_pk_setup(ra_105, a0_57, s1_107, s1_107, a0_255, a5_114, out s1_184, out a0_259, out a1_260, out a2_261, out a5_181);
		s0 = a0_259;
		if (a0_259 == 0x00)
		{
			word32 s0_884;
			word32 a3_885;
			word32 a4_886;
			word32 s6_887;
			word32 s10_888;
			word32 s11_889;
			ra_105 = pk_parse_key_pkcs1_der(ra_105, a0_259, a1_260, a2_261, a5_181, s2_116, s6_119, s7, s10, s11, mstatus, dwLoc38, s2, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg34, dwArg48, s1, dwArg68, dwArg74, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_884, out s1_184, out a0_176, out a2_178, out a3_885, out a4_886, out a5_181, out s2_116, out s3_11, out s6_887, out s7, out s10_888, out s11_889);
			goto l23088398;
		}
		goto l2308839C;
	}
	a5_114.u0 = 0xFF000000;
	s7.u0 = ~0x0100037F;
	if (a0_57 == ~0x0100037F)
	{
l230883B4:
		s0.u0 = 0xFC000480;
		goto l2308836A;
	}
	if (a0_57 == ~0x010002FF)
	{
l230883C4:
		s0.u0 = 0xFC000400;
		goto l2308836A;
	}
	a5_114.u0 = ~0x0100007F;
	if (a0_57 != ~0x0100007F)
		goto l2308836A;
	a5_114 = (word32) *s4_64;
	if (a5_114 != 0x00)
		goto l230882C0;
	Eq_2 a0_101;
	byte * s4_108;
	Eq_2 s8_109;
	word32 s0_891;
	word32 a1_892;
	word32 a2_893;
	word32 s5_894;
	word32 s9_895;
	ra_105 = mbedtls_pem_read_buffer(ra_105, a0_57, fp + -60, 0x230C6B60, 588016448, s2_116, fp + -64, s2_116, mstatus, dwArg34, dwArg88, dwArgC8, dwArg0108, out s0_891, out s1_107, out a0_101, out a1_892, out a2_893, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s4_108, out s5_894, out s6_119, out s7, out s8_109, out s9_895, out s10, out s11);
	s0 = a0_101;
	if (a0_101 != 0x00)
	{
		if (a0_101 == s7)
			goto l230883B4;
		if (a0_101 == s8_109)
			goto l230883C4;
		if (a0_101 == ~0x0100007F)
		{
			a5_114 = (word32) *s4_108;
			if (a5_114 != 0x00)
				goto l230882C0;
			Eq_2 a0_143;
			Eq_2 a2_144;
			Eq_2 a1_154;
			Eq_2 s5_160;
			word32 s0_901;
			word32 s4_902;
			word32 s8_903;
			word32 s9_904;
			ra_105 = mbedtls_pem_read_buffer(ra_105, a0_101, fp + -60, 588016540, 588016512, s2_116, fp + -64, s2_116, mstatus, dwArg34, dwArg88, dwArgC8, dwArg0108, out s0_901, out s1_107, out a0_143, out a1_154, out a2_144, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s4_902, out s5_160, out s6_119, out s7, out s8_903, out s9_904, out s10, out s11);
			s0 = a0_143;
			if (a0_143 == 0x00)
			{
				word32 s0_905;
				word32 a3_906;
				word32 a4_907;
				word32 s6_908;
				word32 s10_909;
				word32 s11_910;
				ra_105 = pk_parse_key_pkcs8_unencrypted_der(ra_105, dwArg44, a1_154, a2_144, a5_114, s6_119, s7, s10, s11, mstatus, dwLoc3C, dwLoc38, s4, s2, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg34, dwArg38, dwArg44, dwArg48, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_905, out s1_184, out a0_176, out a2_178, out a3_906, out a4_907, out a5_181, out s2_116, out s3_11, out s6_908, out s7, out s10_909, out s11_910, out mstatus);
				goto l23088398;
			}
			if (a0_143 == s5_160)
				goto l230882C0;
		}
l2308836A:
		0x00 = (int8) dwArg0198;
		s0Out = dwArg0158;
		s1Out = s1_107;
		a0Out = s0;
		a2Out = dwArg0138;
		a3Out = a3_103;
		a4Out = a4_113;
		a5Out = a5_114;
		s2Out = s2_116;
		s3Out = s3_11;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra_105;
	}
	else
	{
		ptr32 a0_206 = mbedtls_pk_info_from_type(0x02, out a5_114);
		if (a0_206 == 0x00)
		{
l23088364:
			s0.u0 = 0xFC000380;
			goto l2308836A;
		}
		Eq_2 a0_210;
		Eq_2 a1_211;
		Eq_2 a2_212;
		ra_105 = mbedtls_pk_setup(ra_105, a0_101, s1_107, s1_107, a0_206, a5_114, out s1_184, out a0_210, out a1_211, out a2_212, out a5_181);
		s0 = a0_210;
		if (a0_210 != 0x00)
		{
l2308839C:
			word32 a0_883;
			ra_105 = mbedtls_pk_free(ra_105, s1_184, a5_181, out a0_883, out a2_178, out a5_181);
			goto l230883A2;
		}
		word32 a3_896;
		word32 a4_897;
		word32 s6_898;
		word32 s10_899;
		word32 s11_900;
		ra_105 = pk_parse_key_sec1_der(ra_105, *((word32) a0_210 + 4), a1_211, a2_212, a5_181, s2_116, s6_119, s7, s10, s11, mstatus, dwLoc38, s2, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, s3, s1, dwArg64, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_184, out a0_176, out a2_178, out a3_896, out a4_897, out a5_181, out s2_116, out s3_11, out s6_898, out s7, out s10_899, out s11_900, out mstatus);
l23088398:
		s0 = a0_176;
		if (a0_176 == 0x00)
		{
l230883A2:
			word32 s4_890;
			s1_107 = mbedtls_pem_free(fp + -60, a2_178, a5_181, mstatus, dwArg0108, dwArg0148, out a3_103, out a4_113, out a5_114, out s4_890);
			goto l2308836A;
		}
		goto l2308839C;
	}
}

