pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23088470: void rsa_can_do(Register word32 a0)
void rsa_can_do(word32 a0)
{
	if (a0 == 0x01)
		;
}

// 23088482: void rsa_get_bitlen()
void rsa_get_bitlen()
{
}

// 23088488: void rsa_debug(Register (ptr32 Eq_496209) a0, Register Eq_496210 a1)
void rsa_debug(struct Eq_496209 * a0, Eq_496210 a1)
{
	g_a230C6C54[0] = a1;
	a0->t0010 = a1;
	*a1 = (Eq_496210) 0x01;
	*((word256) a1 + 0x0C) = (Eq_496210) 0x01;
	g_a230C6C54[0].ptr0014.b0000 = (byte) a1;
	a0->t0028 = a1;
}

// 230884B2: void eckey_can_do()
void eckey_can_do()
{
}

// 230884BA: void eckey_get_bitlen()
void eckey_get_bitlen()
{
}

// 230884BE: void eckey_debug(Register (ptr32 Eq_496229) a0, Register (ptr32 byte) a1)
void eckey_debug(struct Eq_496229 * a0, byte * a1)
{
	*a1 = 0x02;
	g_ptr230C6BBC = a1;
	a0->ptr0090 = a1;
}

// 230884D6: void eckeydh_can_do()
void eckeydh_can_do()
{
}

// 230884DE: void rsa_free_wrap(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198)
void rsa_free_wrap(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg10, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0198)
{
	Eq_2 a5_19;
	word32 a3_51;
	word32 a4_52;
	mbedtls_rsa_free(a0, a2, a4, a5, mstatus, dwArg00, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a3_51, out a4_52, out a5_19);
	word32 s0_53;
	word32 s1_54;
	word32 a0_55;
	word32 a1_56;
	word32 a2_57;
	word32 a3_58;
	word32 a4_59;
	word32 a5_60;
	word32 a6_61;
	word32 s4_62;
	word32 t3_63;
	vPortFree(a0, dwArg10, a5_19, mstatus, dwArg0158, dwArg0198, out s0_53, out s1_54, out a0_55, out a1_56, out a2_57, out a3_58, out a4_59, out a5_60, out a6_61, out s4_62, out t3_63);
}

// 230884F6: void rsa_alloc_wrap(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack word32 dwArg28, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void rsa_alloc_wrap(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, word32 dwArg28, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 a3_82;
	word32 a2_81;
	word32 a1_80;
	word32 s1_79;
	word32 s0_78;
	word32 a4_83;
	word32 a5_84;
	word32 s2_85;
	word32 s3_86;
	word32 s4_87;
	word32 s8_88;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 0x00AC, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_78, out s1_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out s2_85, out s3_86, out s4_87, out s8_88);
	if (true)
		mbedtls_rsa_init(ra_21, 0x01, 0x00, 0x00, dwArg28);
}

// 2308851A: void rsa_check_pair_wrap(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
void rsa_check_pair_wrap(Eq_2 ra, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	mbedtls_rsa_check_pub_priv(ra, a2, a4, a5, s2, s4, s6, s7, s10, s11, mstatus, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg54, dwArg58, dwArg64, dwArg68, dwArg78, dwArg94, dwArgB8, dwArgC8);
}

// 2308851C: void rsa_encrypt_wrap(Register Eq_2 ra, Register (ptr32 Eq_496411) s0, Register (ptr32 Eq_496412) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_2) a4, Register Eq_2 a5, Register (ptr32 code) a6, Register Eq_2 a7, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void rsa_encrypt_wrap(Eq_2 ra, struct Eq_496411 * s0, struct Eq_496412 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_2 * a4, Eq_2 a5, <anonymous> * a6, Eq_2 a7, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 a6_9 = a0->t0004;
	*a4 = (union Eq_2 *) a6_9;
	if (a5 < a6_9)
		return;
	mbedtls_rsa_pkcs1_encrypt(ra, s0, a0, a6, a7, 0x00, a2, a1, a3, s3, s5, s7, s10, s11, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148);
}

// 23088542: void rsa_decrypt_wrap(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_496501) a0, Register Eq_2 a1, Register Eq_496503 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus)
void rsa_decrypt_wrap(Eq_2 ra, Eq_2 s1, struct Eq_496501 * a0, Eq_2 a1, Eq_496503 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus)
{
	if (a0->t0004 != a2)
		return;
	mbedtls_rsa_pkcs1_decrypt(ra, s1, a0, a6, a7, 0x01, a4, a1, a3, a5, s7, s10, s11, mstatus);
}

// 23088566: void rsa_sign_wrap(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 int32) a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s2, Register word32 s8, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
void rsa_sign_wrap(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, int32 * a5, Eq_2 a6, Eq_2 a7, Eq_2 s2, word32 s8, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0198)
{
	*a5 = (int32) *((word32) a0 + 4);
	mbedtls_rsa_pkcs1_sign(ra, s1, a0, a6, a7, 0x01, a1, a3, a2, a4, s2, s8, s9, s10, s11, mstatus, dwArg04, dwArg18, dwArg24, dwArg28, dwArg38, dwArg68, dwArg74, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0158, dwArg0198);
}

// 23088584: void rsa_verify_wrap(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_496627 a5, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus)
void rsa_verify_wrap(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_496627 a5, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus)
{
	if (a5 < *((word32) a0 + 4))
		return;
	Eq_496627 a5_40;
	mbedtls_rsa_pkcs1_verify(ra, a0, 0x00, 0x00, a1, a3, a2, a4, s3, s6, s7, s10, s11, mstatus, out a5_40) != 0x00;
}

