pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230885CA: void eckey_free_wrap(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198)
void eckey_free_wrap(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0198)
{
	Eq_2 a5_18;
	word32 a3_55;
	word32 a4_56;
	word32 s2_57;
	mbedtls_ecp_keypair_free(a0, a2, a4, mstatus, dwArg00, dwArg18, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out a3_55, out a4_56, out a5_18, out s2_57);
	word32 s0_58;
	word32 s1_59;
	word32 a0_60;
	word32 a1_61;
	word32 a2_62;
	word32 a3_63;
	word32 a4_64;
	word32 a5_65;
	word32 a6_66;
	word32 s4_67;
	word32 t3_68;
	vPortFree(a0, dwArg10, a5_18, mstatus, dwArg0158, dwArg0198, out s0_58, out s1_59, out a0_60, out a1_61, out a2_62, out a3_63, out a4_64, out a5_65, out a6_66, out s4_67, out t3_68);
}

// 230885E2: void eckey_alloc_wrap(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void eckey_alloc_wrap(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 0x00AC, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
		mbedtls_ecp_keypair_init(ra_21, 0x01);
}

// 23088604: void eckey_check_pair(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a0, Register (ptr32 byte) a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
void eckey_check_pair(Eq_2 ra, Eq_2 s1, byte * a0, byte * a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	mbedtls_ecp_check_pub_priv(ra, s1, a0, a1, a2, s2, s3, s7, s10, s11, mstatus, dwArg08, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8);
}

// 23088608: Register Eq_2 mgf_mask(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
Eq_2 mgf_mask(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_45;
	word32 a1_210;
	word32 a3_217;
	word32 a0_209;
	word32 t1_208;
	word32 a4_213;
	word32 a3_212;
	word32 a2_211;
	word32 t1_215;
	word32 a1_216;
	word32 a5_214;
	Eq_2 a5_100;
	ptr32 a4_119;
	ptr32 a2_109;
	Eq_2 ra_51 = memset(memset(ra, fp + -64, 0x00, 32, out t1_208, out a0_209, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214), fp + -0x0044, 0x00, 0x04, out t1_215, out a0_45, out a1_216, out a2_109, out a3_217, out a4_119, out a5_100);
	word32 * s1_54 = *a0_45;
	Eq_2 a0_55 = mbedtls_md_get_size(a0_45);
	Eq_2 s2_11 = a0;
	Eq_2 s0_118;
	for (s0_118 = a1; s0_118 != 0x00; s0_118 -= a5_100)
	{
		s6 = s0_118;
		if (a0_55 < s0_118)
			s6 = a0_55;
		struct Eq_496878 * a5_74;
		struct Eq_496878 * a5_85;
		struct Eq_496880 * a5_92;
		word32 a5_218;
		ra_51 = mbedtls_md_finish(mbedtls_md_update(mbedtls_md_update(mbedtls_md_starts(ra_51, s1_54, a5_100, dwLoc40, out a5_74), s1_54, a5_74, dwLoc40, out a5_85), s1_54, a5_85, dwLoc40, out a5_92), s1_54, a5_92, dwLoc40, out a2_109, out a5_218);
		a5_100.u0 = 0x00;
		while (true)
		{
			word32 a4_103 = s2_11 + a5_100;
			if (a5_100 == s6)
				break;
			a2_109 = (word32) *a4_103;
			*a4_103 = (byte) ((word32) *((byte) a5_100.u0 + (fp + -64)) ^ a2_109);
			a5_100 = (byte) a5_100.u0 + 1;
		}
		word32 a4_115 = (word32) bLoc41;
		s2_11 = a4_103;
		a4_119 = a4_115 + 0x01;
		bLoc41 = (byte) (a4_115 + 0x01);
	}
	s0Out = s0_118;
	s1Out = dwLoc4C;
	a2Out = a2_109;
	a3Out = s2;
	a4Out = a4_119;
	a5Out = a5_100;
	s2Out = s2_11;
	s3Out = a0_55;
	s4Out = dwArg0168;
	s5Out = a3;
	s6Out = s6;
	return dwLoc08;
}

// 230886B2: void mbedtls_rsa_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack word32 dwArg38)
// Called from:
//      rsa_alloc_wrap
void mbedtls_rsa_init(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, word32 dwArg38)
{
	word32 t1_42;
	word32 a0_43;
	word32 a1_44;
	word32 a2_45;
	word32 a3_46;
	word32 a4_47;
	word32 a5_48;
	memset(ra, a0, 0x00, 0x00AC, out t1_42, out a0_43, out a1_44, out a2_45, out a3_46, out a4_47, out a5_48);
	*((word32) a0 + 0x00A4) = a1;
	*((word32) a0 + 0x00A8) = a2;
	0x00 = dwArg38;
}

