pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230889A8: Register Eq_2 mbedtls_rsa_public(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg64, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_498252 a4Out, Register out Eq_498253 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_public(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg64, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_498252 & a4Out, union Eq_498253 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	mbedtls_mpi_init(fp + -44);
	Eq_2 a0_28;
	struct Eq_498264 * s1_38;
	word32 s0_207;
	word32 a1_208;
	word32 s4_210;
	word32 a3_209;
	word32 s8_211;
	Eq_2 a5_109;
	Eq_2 a4_110;
	Eq_2 a2_112;
	Eq_2 s2_103;
	ptr32 a7_178;
	Eq_2 s3_185;
	Eq_2 ra_102 = mbedtls_mpi_read_binary(ra, a1, dwArg24, a3, a4, mstatus, dwLoc38, s2, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0118, dwArg0128, out s0_207, out s1_38, out a0_28, out a1_208, out a2_112, out a3_209, out a4_110, out a5_109, out a7_178, out s2_103, out s3_185, out s4_210, out s8_211);
	Eq_2 s0_106 = a0_28;
	if (a0_28 == 0x00)
	{
		s0_106.u0 = ~0x03;
		a2_112 = dwArg64;
		Eq_2 a3_58;
		word32 a1_218;
		word32 a2_219;
		word32 a6_220;
		if (mbedtls_mpi_cmp_mpi(a2_112, a4_110, a5_109, out a1_218, out a2_219, out a3_58, out a4_110, out a5_109, out a6_220) < 0x00)
		{
			s3_185 = s1_38->t0004;
			word32 a3_221;
			Eq_2 a0_70 = mbedtls_mpi_exp_mod(ra_102, (char *) &s1_38->t0004 + 16, a3_58, (char *) &s1_38->t0004 + 100, s11, mstatus, out a2_112, out a3_221, out a4_110, out a5_109, out a7_178);
			s0_106 = a0_70;
			if (a0_70 == 0x00)
			{
				Eq_2 a0_89;
				ra_102 = mbedtls_mpi_write_binary(ra_102, s2_103, s3_185, a4_110, a5_109, out a0_89, out a2_112, out a4_110, out a5_109, out s2_103, out s3_185);
				s0_106 = a0_89;
			}
		}
	}
	Eq_498252 a4_119;
	word32 a0_212;
	word32 a1_213;
	word32 a2_214;
	word32 a3_215;
	word32 a6_216;
	word32 s4_217;
	Eq_498253 a5_116;
	Eq_2 s1_121 = mbedtls_mpi_free(fp + -44, a2_112, a4_110, a5_109, mstatus, dwArg0108, dwArg0148, out a0_212, out a1_213, out a2_214, out a3_215, out a4_119, out a5_116, out a6_216, out s4_217);
	if (s0_106 != 0x00)
	{
		a5_116.u0 = ~0x0400027F;
		s0_106 = (byte) s0_106.u0 - 0x04000280;
	}
	s0Out = s0_106;
	s1Out = s1_121;
	a0Out = s0_106;
	a2Out = dwArg0138;
	a4Out = a4_119;
	a5Out = a5_116;
	a7Out = a7_178;
	s2Out = s2_103;
	s3Out = s3_185;
	s4Out = dwArgF4;
	return ra_102;
}

// 23088A28: Register Eq_2 mbedtls_rsa_private(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_private(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, byte & s4Out, byte & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	byte * s4_736;
	Eq_2 s0_101;
	if (a5 == 0x00 || (a5 == 0x00 || a5 == 0x00))
	{
		s0_101.u0 = ~0x0400007F;
		s4_736 = s4;
		goto l23088BA4;
	}
	mbedtls_mpi_init(fp + -84);
	mbedtls_mpi_init(fp + -72);
	mbedtls_mpi_init(fp + -60);
	Eq_2 a0_49;
	word32 a3_1022;
	word32 a7_1023;
	word32 a1_1021;
	word32 s0_1020;
	Eq_2 s8_143;
	Eq_2 s4_142;
	struct Eq_498473 * s1_392;
	Eq_2 a5_106;
	Eq_2 a4_104;
	Eq_2 a2_108;
	Eq_2 ra_102 = mbedtls_mpi_read_binary(ra, a3, a2, a3, a4, mstatus, dwLoc58, dwLoc48, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, out s0_1020, out s1_392, out a0_49, out a1_1021, out a2_108, out a3_1022, out a4_104, out a5_106, out a7_1023, out s2, out s3, out s4_142, out s8_143);
	s0_101 = a0_49;
	if (a0_49 == 0x00)
	{
		s2 = (char *) s1_392 + 8;
		s0_101.u0 = ~0x03;
		Eq_2 a3_78;
		word32 a6_1038;
		struct Eq_498560 * a1_156;
		if (mbedtls_mpi_cmp_mpi(a2_108, a4_104, a5_106, out a1_156, out a2_108, out a3_78, out a4_104, out a5_106, out a6_1038) >= 0x00)
			goto l23088B88;
		if (s4_142 == 0x00)
		{
l23088A92:
			s6 = (char *) s1_392 + 44;
			word32 a3_1039;
			word32 a7_1040;
			Eq_2 a0_424 = mbedtls_mpi_exp_mod(ra_102, (char *) s1_392 + 0x0044, s6, (char *) s1_392 + 116, s11, mstatus, out a2_108, out a3_1039, out a4_104, out a5_106, out a7_1040);
			s0_101 = a0_424;
			if (a0_424 != 0x00)
				goto l23088B88;
			s3 = (char *) s1_392 + 56;
			Eq_2 a3_449;
			word32 a7_1041;
			Eq_2 a0_446 = mbedtls_mpi_exp_mod(ra_102, (char *) s1_392 + 80, s3, (char *) s1_392 + 0x0080, s11, mstatus, out a2_108, out a3_449, out a4_104, out a5_106, out a7_1041);
			s0_101 = a0_446;
			if (a0_446 == 0x00)
			{
				Eq_2 a0_467;
				Eq_2 a3_470;
				word32 s1_477;
				Eq_2 s4_480;
				word32 a7_1043;
				word32 s8_1044;
				word32 s0_1042;
				Eq_2 ra_475 = mbedtls_mpi_sub_mpi(ra_102, a0_446, fp + -84, a3_449, a4_104, a5_106, s2, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_1042, out s1_477, out a0_467, out a2_108, out a3_470, out a4_104, out a5_106, out a7_1043, out s2, out s3, out s4_480, out s8_1044);
				s0_101 = a0_467;
				if (a0_467 != 0x00)
					goto l23088B88;
				Eq_2 s5_506;
				Eq_2 a0_515;
				word32 s4_1048;
				word32 s8_1049;
				word32 s0_1045;
				word32 s1_1046;
				word32 a3_1047;
				Eq_2 ra_500 = mbedtls_mpi_mul_mpi(ra_475, fp + -72, fp + -84, s1_477 + 92, a3_470, a4_104, s2, s4_480, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1045, out s1_1046, out a0_515, out a2_108, out a3_1047, out a4_104, out a5_106, out s2, out s3, out s4_1048, out s5_506, out s6, out s8_1049);
				s0_101 = a0_515;
				if (a0_515 == 0x00)
				{
					Eq_2 a0_523;
					Eq_2 a3_526;
					Eq_2 s4_539;
					word32 s9_1054;
					word32 s8_1053;
					word32 s5_1052;
					word32 a7_1051;
					word32 s1_1050;
					Eq_2 ra_535 = mbedtls_mpi_mod_mpi(ra_500, fp + -84, fp + -72, s6, s5_506, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1050, out a0_523, out a2_108, out a3_526, out a4_104, out a5_106, out a7_1051, out s2, out s3, out s4_539, out s5_1052, out s6, out s7, out s8_1053, out s9_1054, out s10, out s11);
					s0_101 = a0_523;
					if (a0_523 != 0x00)
						goto l23088B88;
					Eq_2 a3_556;
					Eq_2 a0_576;
					word32 s8_1058;
					word32 s4_1057;
					word32 s1_1056;
					word32 s0_1055;
					Eq_2 s5_567;
					Eq_2 ra_561 = mbedtls_mpi_mul_mpi(ra_535, fp + -72, fp + -84, s3, a3_526, a4_104, s2, s4_539, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1055, out s1_1056, out a0_576, out a2_108, out a3_556, out a4_104, out a5_106, out s2, out s3, out s4_1057, out s5_567, out s6, out s8_1058);
					s0_101 = a0_576;
					if (a0_576 == 0x00)
					{
						Eq_2 a0_582;
						Eq_2 a3_585;
						word32 s1_592;
						Eq_2 s4_595;
						word32 s8_1062;
						word32 a7_1061;
						word32 a1_1060;
						word32 s0_1059;
						Eq_2 ra_590 = mbedtls_mpi_add_mpi(ra_561, a0_576, fp + -84, a3_556, a4_104, a5_106, s2, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_1059, out s1_592, out a0_582, out a1_1060, out a2_108, out a3_585, out a4_104, out a5_106, out a7_1061, out s2, out s3, out s4_595, out s8_1062);
						s0_101 = a0_582;
						if (a0_582 != 0x00)
							goto l23088B88;
						if (s4_595 == 0x00)
						{
l23088B14:
							Eq_2 a0_674;
							mbedtls_mpi_write_binary(ra_590, s5_567, a2_108, a4_104, a5_106, out a0_674, out a2_108, out a4_104, out a5_106, out s2, out s3);
							s0_101 = a0_674;
							goto l23088B88;
						}
						Eq_2 s5_621;
						Eq_2 a0_630;
						word32 s4_1066;
						word32 s8_1067;
						word32 a3_1065;
						word32 s0_1063;
						word32 s1_1064;
						Eq_2 ra_615 = mbedtls_mpi_mul_mpi(ra_590, fp + -84, fp + -84, s1_592 + 0x0098, a3_585, a4_104, s2, s4_595, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1063, out s1_1064, out a0_630, out a2_108, out a3_1065, out a4_104, out a5_106, out s2, out s3, out s4_1066, out s5_621, out s6, out s8_1067);
						s0_101 = a0_630;
						if (a0_630 != 0x00)
							goto l23088B88;
						Eq_2 a0_636;
						word32 s1_1097;
						word32 a3_1098;
						word32 a7_1099;
						word32 s4_1100;
						word32 s8_1101;
						word32 s9_1102;
						ra_590 = mbedtls_mpi_mod_mpi(ra_615, fp + -84, fp + -84, s2, s5_621, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1097, out a0_636, out a2_108, out a3_1098, out a4_104, out a5_106, out a7_1099, out s2, out s3, out s4_1100, out s5_567, out s6, out s7, out s8_1101, out s9_1102, out s10, out s11);
						s0_101 = a0_636;
						if (a0_636 == 0x00)
							goto l23088B14;
					}
				}
			}
			goto l23088B88;
		}
		Eq_2 a3_208;
		Eq_2 ra_186;
		Eq_2 s4_187;
		word32 s1_179;
		Eq_2 a0_205;
		a5_106 = s1_392->t00A0;
		if (a5_106 != 0x00)
		{
			Eq_2 s5_237;
			Eq_2 a0_246;
			word32 s8_1072;
			word32 a3_1070;
			word32 s4_1071;
			word32 s0_1068;
			word32 s1_1069;
			Eq_2 ra_231 = mbedtls_mpi_mul_mpi(ra_102, (char *) s1_392 + 0x008C, (char *) s1_392 + 0x008C, (char *) s1_392 + 0x008C, a3_78, a4_104, (char *) s1_392 + 8, s4_142, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1068, out s1_1069, out a0_246, out a2_108, out a3_1070, out a4_104, out a5_106, out s2, out s3, out s4_1071, out s5_237, out s6, out s8_1072);
			s0_101 = a0_246;
			if (a0_246 != 0x00)
				goto l23088B88;
			Eq_2 a0_252;
			Eq_2 a3_255;
			word32 s1_259;
			Eq_2 s4_268;
			word32 s9_1076;
			word32 s8_1075;
			word32 s5_1074;
			word32 a7_1073;
			Eq_2 ra_264 = mbedtls_mpi_mod_mpi(ra_231, s3, s3, s2, s5_237, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_259, out a0_252, out a2_108, out a3_255, out a4_104, out a5_106, out a7_1073, out s2, out s3, out s4_268, out s5_1074, out s6, out s7, out s8_1075, out s9_1076, out s10, out s11);
			s0_101 = a0_252;
			if (a0_252 != 0x00)
				goto l23088B88;
			Eq_2 s5_297;
			Eq_2 a0_306;
			word32 s4_1080;
			word32 s8_1081;
			word32 a3_1079;
			word32 s0_1077;
			word32 s1_1078;
			Eq_2 ra_291 = mbedtls_mpi_mul_mpi(ra_264, s1_259 + 0x0098, s1_259 + 0x0098, s1_259 + 0x0098, a3_255, a4_104, s2, s4_268, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1077, out s1_1078, out a0_306, out a2_108, out a3_1079, out a4_104, out a5_106, out s2, out s3, out s4_1080, out s5_297, out s6, out s8_1081);
			s0_101 = a0_306;
			if (a0_306 != 0x00)
				goto l23088B88;
			word32 s9_1085;
			word32 s8_1084;
			word32 s5_1083;
			word32 a7_1082;
			ra_186 = mbedtls_mpi_mod_mpi(ra_291, s3, s3, s2, s5_297, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_179, out a0_205, out a2_108, out a3_208, out a4_104, out a5_106, out a7_1082, out s2, out s3, out s4_187, out s5_1083, out s6, out s7, out s8_1084, out s9_1085, out s10, out s11);
		}
		else
		{
			s7.u0 = 0x0C;
			s6 = (char *) s1_392 + 0x0098;
			s3 = (char *) s1_392 + 0x008C;
			do
			{
				s7 = (byte) s7.u0 - 1;
				if (s7 == 0x00)
				{
					s0_101.u0 = ~0x0400047F;
					goto l23088B88;
				}
				Eq_2 a3_109;
				word32 s4_1103;
				word32 s8_1104;
				Eq_2 a0_105 = mbedtls_mpi_fill_random(ra_102, s0_101, a1_156->t0004, (char *) s1_392 + 0x0098, (char *) a1_156 - 1, s4_142, s8_143, a4_104, mstatus, out a2_108, out a3_109, out a4_104, out a5_106, out s2, out s3, out s4_1103, out s8_1104, out mstatus);
				s0_101 = a0_105;
				if (a0_105 != 0x00)
					goto l23088B88;
				Eq_2 a0_151;
				word32 s1_1105;
				word32 a3_1106;
				ra_102 = mbedtls_mpi_gcd(ra_102, (char *) s1_392 + 0x0098, s2, a3_109, a4_104, mstatus, dwArg08, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s1_1105, out a0_151, out a2_108, out a3_1106, out a4_104, out a5_106, out s2, out s3, out s4_142, out s8_143);
				s0_101 = a0_151;
				if (a0_151 != 0x00)
					goto l23088B88;
				word32 a3_1107;
				word32 a6_1108;
			} while (mbedtls_mpi_cmp_int(0x01, a2_108, out a1_156, out a2_108, out a3_1107, out a4_104, out a5_106, out a6_1108) != 0x00);
			Eq_2 a0_171;
			word32 a3_1109;
			word32 s5_1110;
			word32 s8_1111;
			word32 s9_1112;
			ra_186 = mbedtls_mpi_inv_mod(ra_102, a0_151, (char *) s1_392 + 0x0098, s2, a4, (char *) s1_392 + 0x0098, s7, s10, s11, mstatus, s2, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, s3, s1, dwArg58, dwArg78, dwArg88, dwArg98, dwArg0104, out s1_179, out a0_171, out a2_108, out a3_1109, out a4_104, out a5_106, out s2, out s3, out s4_187, out s5_1110, out s6, out s7, out s8_1111, out s9_1112, out s10, out s11);
			s0_101 = a0_171;
			if (a0_171 != 0x00)
				goto l23088B88;
			word32 a7_1113;
			a0_205 = mbedtls_mpi_exp_mod(ra_186, s1_179 + 20, s2, s1_179 + 0x0068, s11, mstatus, out a2_108, out a3_208, out a4_104, out a5_106, out a7_1113);
		}
		s0_101 = a0_205;
		if (a0_205 != 0x00)
			goto l23088B88;
		Eq_2 s5_367;
		Eq_2 a0_376;
		word32 s8_1090;
		word32 s4_1089;
		word32 a3_1088;
		word32 s1_1087;
		word32 s0_1086;
		Eq_2 ra_361 = mbedtls_mpi_mul_mpi(ra_186, fp + -84, fp + -84, s1_179 + 0x008C, a3_208, a4_104, s2, s4_187, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1086, out s1_1087, out a0_376, out a2_108, out a3_1088, out a4_104, out a5_106, out s2, out s3, out s4_1089, out s5_367, out s6, out s8_1090);
		s0_101 = a0_376;
		if (a0_376 != 0x00)
			goto l23088B88;
		Eq_2 a0_385;
		word32 a3_1091;
		word32 a7_1092;
		word32 s4_1093;
		word32 s5_1094;
		word32 s8_1095;
		word32 s9_1096;
		ra_102 = mbedtls_mpi_mod_mpi(ra_361, fp + -84, fp + -84, s2, s5_367, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_392, out a0_385, out a2_108, out a3_1091, out a4_104, out a5_106, out a7_1092, out s2, out s3, out s4_1093, out s5_1094, out s6, out s7, out s8_1095, out s9_1096, out s10, out s11);
		s0_101 = a0_385;
		if (a0_385 == 0x00)
			goto l23088A92;
	}
l23088B88:
	Eq_2 a2_705;
	Eq_2 a5_706;
	Eq_2 a4_709;
	word32 s4_1028;
	word32 a1_1025;
	word32 a3_1026;
	word32 a6_1027;
	word32 a0_1024;
	mbedtls_mpi_free(fp + -84, a2_108, a4_104, a5_106, mstatus, dwArgE8, dwArg0128, out a0_1024, out a1_1025, out a2_705, out a3_1026, out a4_709, out a5_706, out a6_1027, out s4_1028);
	Eq_2 a2_717;
	Eq_2 a5_718;
	Eq_2 a4_721;
	word32 a0_1029;
	word32 a1_1030;
	word32 a6_1032;
	word32 s4_1033;
	word32 a3_1031;
	mbedtls_mpi_free(fp + -72, a2_705, a4_709, a5_706, mstatus, dwArgE8, dwArg0128, out a0_1029, out a1_1030, out a2_717, out a3_1031, out a4_721, out a5_718, out a6_1032, out s4_1033);
	word32 a3_1036;
	word32 a6_1037;
	word32 a1_1035;
	word32 a0_1034;
	mbedtls_mpi_free(fp + -60, a2_717, a4_721, a5_718, mstatus, dwArgE8, dwArg0128, out a0_1034, out a1_1035, out a2, out a3_1036, out a4, out a5, out a6_1037, out s4_736);
	if (s0_101 != 0x00)
	{
		a5.u0 = ~0x040002FF;
		s0_101 = (byte) s0_101.u0 - 0x04000300;
	}
l23088BA4:
	s0Out = s0_101;
	s1Out = dwArg28;
	a0Out = s0_101;
	a2Out = a2;
	a3Out = dwArg08;
	a4Out = a4;
	a5Out = a5;
	a7Out = dwLoc18;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4_736;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	s9Out = dwLoc5C;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return dwArg68;
}

