pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23088C4C: void mbedtls_rsa_rsaes_oaep_encrypt(Register (ptr32 Eq_496412) a0, Register (ptr32 code) a1, Register Eq_2 a2, Register int32 a3, Register word32 a4, Register word32 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg0118)
// Called from:
//      mbedtls_rsa_pkcs1_encrypt
void mbedtls_rsa_rsaes_oaep_encrypt(struct Eq_496412 * a0, <anonymous> * a1, Eq_2 a2, int32 a3, word32 a4, word32 a5, Eq_2 a6, Eq_2 a7, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg0118)
{
	if (a3 == 0x01 && a0->dw00A4 != a3 || a1 == null)
		return;
	word32 a5_474;
	Eq_2 a0_60 = mbedtls_md_info_from_type((word32) a0->b00A8, out a5_474);
	if (a0_60 == 0x00)
		return;
	Eq_2 s0_63 = a0->t0004;
	Eq_2 a0_64 = mbedtls_md_get_size(a0_60);
	Eq_2 a5_67 = (word32) a6 + 2 + (a0_64 << 0x01);
	if (a5_67 < a6 || s0_63 < a5_67)
		return;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	word32 a2_478;
	word32 a0_476;
	word32 a1_477;
	word32 t1_475;
	Eq_2 ra_80 = memset(dwArg0118, s3, 0x00, s0_63, out t1_475, out a0_476, out a1_477, out a2_478, out a3_77, out a4_78, out a5_79);
	*s3 = 0x00;
	struct Eq_499268 * sp_88;
	Eq_2 ra_90;
	word32 s0_91;
	Eq_2 s1_92;
	Eq_2 s2_93;
	Eq_2 s4_94;
	Eq_2 s7_97;
	Eq_2 s8_98;
	word32 s9_99;
	Eq_2 s10_100;
	Eq_2 s11_101;
	word32 a0_104;
	word32 tp_114;
	word32 t5_351;
	word32 t6_352;
	a1();
	if (a0_104 == 0x00)
	{
		word32 a5_115 = s7_97 + s1_92;
		sp_88->ptr0084 = a5_115;
		word32 a5_122;
		Eq_2 a1_123;
		Eq_2 ra_126 = mbedtls_md(ra_90, s8_98, s10_100, s11_101, a5_115, out a1_123, out a5_122);
		Eq_2 s0_131 = sp_88->t0064;
		byte * a0_133 = (word32) s1_92 + ((s0_91 - s4_94) + ~0x01) - s9_99 + a5_122;
		*a0_133 = 0x01;
		word32 a4_482;
		word32 a6_484;
		word32 a7_485;
		word32 a5_483;
		word32 a2_480;
		word32 a3_481;
		word32 a1_479;
		memcpy(a0_133 + 1, a1_123, s4_94, out a1_479, out a2_480, out a3_481, out a4_482, out a5_483, out a6_484, out a7_485);
		Eq_2 a3_155;
		Eq_2 a4_156;
		Eq_2 a5_157;
		word32 a0_166;
		Eq_2 a2_168;
		Eq_2 a4_170;
		Eq_2 a5_171;
		ptr32 mstatus_173;
		word32 s1_175;
		word32 s3_177;
		word32 a3_486;
		word32 s4_488;
		word32 s8_489;
		word32 s2_487;
		Eq_2 ra_174 = mbedtls_md_setup(mbedtls_md_init(ra_126, &sp_88->t0014, out a3_155, out a4_156, out a5_157), s0_131, s1_92, &sp_88->t0014, s8_98, 0x00, a3_155, a4_156, a5_157, s2_93, mstatus, sp_88->t0010, sp_88->t0014, sp_88->t0038, sp_88->t0108, sp_88->t0148, out s1_175, out a0_166, out a2_168, out a3_486, out a4_170, out a5_171, out s2_487, out s3_177, out s4_488, out s8_489, out mstatus_173);
		if (a0_166 != 0x00)
		{
			word32 a5_503;
			mbedtls_md_free(ra_174, &sp_88->t0014, a2_168, a4_170, a5_171, mstatus_173, out a5_503);
		}
		else
		{
			Eq_2 s1_203;
			Eq_2 a2_220;
			Eq_2 a3_221;
			Eq_2 a4_222;
			Eq_2 a5_223;
			Eq_2 s1_227;
			Eq_2 s2_228;
			Eq_2 s3_229;
			Eq_2 s6_232;
			word32 s5_502;
			word32 s5_498;
			word32 s0_500;
			word32 s4_501;
			word32 s6_499;
			word32 a5_494;
			word32 s3_496;
			word32 s4_497;
			word32 s2_495;
			word32 s0_490;
			word32 a3_492;
			word32 a4_493;
			word32 a2_491;
			Eq_2 ra_225 = mgf_mask(mgf_mask(ra_174, s1_175 + 1 + s3_177, (word32) s0_131 - 1 - s1_175, out s0_490, out s1_203, out a2_491, out a3_492, out a4_493, out a5_494, out s2_495, out s3_496, out s4_497, out s5_498, out s6_499), s7_97, s1_203, out s0_500, out s1_227, out a2_220, out a3_221, out a4_222, out a5_223, out s2_228, out s3_229, out s4_501, out s5_502, out s6_232);
			Eq_2 a5_240;
			mbedtls_md_free(ra_225, &sp_88->t0014, a2_220, a4_222, a5_223, mstatus_173, out a5_240);
			if (a5_240 == 0x00)
			{
				word32 s1_523;
				word32 s0_522;
				word32 a0_524;
				word32 a2_525;
				word32 a4_526;
				word32 a5_527;
				word32 a7_528;
				word32 s2_529;
				word32 s3_530;
				word32 s4_531;
				mbedtls_rsa_public(ra_225, s3_229, a3_221, a4_222, s2_228, s11_101, mstatus_173, sp_88->t0024, sp_88->t0064, sp_88->t0098, sp_88->t00A8, sp_88->t00D8, sp_88->t00E8, sp_88->t0108, sp_88->t0118, sp_88->t0128, sp_88->t0148, out s0_522, out s1_523, out a0_524, out a2_525, out a4_526, out a5_527, out a7_528, out s2_529, out s3_530, out s4_531);
			}
			else
			{
				word32 s3_513;
				word32 s2_512;
				word32 a5_510;
				word32 s5_515;
				word32 s7_517;
				word32 s6_516;
				word32 s4_514;
				word32 s9_518;
				word32 s10_519;
				word32 mstatus_521;
				word32 s11_520;
				word32 a7_511;
				word32 a0_506;
				word32 a3_508;
				word32 a4_509;
				word32 a2_507;
				word32 s0_504;
				word32 s1_505;
				mbedtls_rsa_private(ra_225, s1_227, s6_232, s3_229, s3_229, a5_240, s2_228, s3_229, s6_232, s7_97, s10_100, s11_101, mstatus_173, sp_88->t0008, sp_88->t0018, sp_88->t0024, sp_88->t0028, sp_88->t0038, sp_88->t0058, sp_88->t0068, sp_88->t0078, sp_88->t0088, sp_88->t0098, sp_88->t00A8, sp_88->t00B4, sp_88->t00B8, sp_88->t00C8, sp_88->t00D4, sp_88->t00D8, sp_88->t00E8, sp_88->t00F8, sp_88->t0104, sp_88->t0108, sp_88->t0128, sp_88->t0138, out s0_504, out s1_505, out a0_506, out a2_507, out a3_508, out a4_509, out a5_510, out a7_511, out s2_512, out s3_513, out s4_514, out s5_515, out s6_516, out s7_517, out s9_518, out s10_519, out s11_520, out mstatus_521);
			}
		}
	}
}

// 23088D9A: void mbedtls_rsa_rsaes_pkcs1_v15_encrypt(Register Eq_2 ra, Register (ptr32 Eq_496411) s0, Register (ptr32 Eq_496412) a0, Register (ptr32 code) a1, Register Eq_2 a2, Register int32 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
// Called from:
//      mbedtls_rsa_pkcs1_encrypt
void mbedtls_rsa_rsaes_pkcs1_v15_encrypt(Eq_2 ra, struct Eq_496411 * s0, struct Eq_496412 * a0, <anonymous> * a1, Eq_2 a2, int32 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s5, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	if (a3 == 0x01 && a0->dw00A4 != 0x00 || (a1 == null || (a5 == 0x00 || a6 == 0x00)))
		return;
	Eq_2 a0_52 = s0->t0004;
	if (a4 <= ~0x0B && s0 >= (word32) a4 + 11)
	{
		Eq_2 ra_101;
		Eq_2 s0_102;
		*a6 = 0x00;
		struct Eq_499728 * s0_58 = s0 - a4;
		Eq_2 s1_103 = a6;
		Eq_2 s9_108 = a5;
		Eq_2 s8_107 = a4;
		int32 s5_105 = a3;
		Eq_2 s6_125 = a2;
		<anonymous> * s4_123 = a1;
		Eq_2 s3_104 = a0_52;
		word32 s2_121 = a6 + 2;
		if (a3 != 0x00)
		{
			*((word32) a6 + 1) = 0x01;
			struct Eq_499869 * a3_74;
			word32 a5_75 = s0_58 + ~0x02 + a6;
			for (a3_74 = (word32) a6 + 2; a5_75 != a3_74; ++a3_74)
				a3_74->b0000 = ~0x00;
			s0_102 = s0_58 + ~0x02 + (a6 + 2);
			ra_101 = ra;
			goto l23088E06;
		}
		*((word32) a6 + 1) = 0x02;
		word32 a5_134 = 0x02;
		s0_102 = s0_58 + ~0x00 + a6;
		ra_101 = ra;
l23088E02:
		if (s2_121 == s0_102)
		{
l23088E06:
			*s0_102 = 0x00;
			Eq_2 a4_169;
			Eq_2 a5_170;
			Eq_2 a3_174;
			word32 a1_666;
			word32 a7_669;
			word32 a2_667;
			word32 a6_668;
			memcpy((word32) s0_102 + 1, s9_108, s8_107, out a1_666, out a2_667, out a3_174, out a4_169, out a5_170, out a6_668, out a7_669);
			if (s5_105 != 0x00)
			{
				0x00 = (int8) dwArg0128;
				word32 s10_695;
				word32 s11_696;
				word32 mstatus_697;
				word32 s4_690;
				word32 s7_693;
				word32 s9_694;
				word32 s5_691;
				word32 s6_692;
				word32 a4_685;
				word32 s2_688;
				word32 s3_689;
				word32 a5_686;
				word32 a7_687;
				word32 s0_680;
				word32 a2_683;
				word32 a3_684;
				word32 s1_681;
				word32 a0_682;
				mbedtls_rsa_private(ra_101, s1_103, s6_125, s1_103, s1_103, a5_170, s2_121, s3_104, s6_125, s7, s10, s11, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0128, dwArg0138, out s0_680, out s1_681, out a0_682, out a2_683, out a3_684, out a4_685, out a5_686, out a7_687, out s2_688, out s3_689, out s4_690, out s5_691, out s6_692, out s7_693, out s9_694, out s10_695, out s11_696, out mstatus_697);
				return;
			}
			else
			{
				0x00 = (int8) dwArg0128;
				word32 a5_675;
				word32 s3_678;
				word32 s4_679;
				word32 a7_676;
				word32 s2_677;
				word32 s1_671;
				word32 a4_674;
				word32 a0_672;
				word32 a2_673;
				word32 s0_670;
				mbedtls_rsa_public(ra_101, s1_103, a3_174, a4_169, s2_121, s11, mstatus, dwArg24, ra, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s0_670, out s1_671, out a0_672, out a2_673, out a4_674, out a5_675, out a7_676, out s2_677, out s3_678, out s4_679);
				return;
			}
		}
		int32 s7_106 = 100;
		do
		{
			word32 a0_114;
			word32 tp_131;
			word32 t3_132;
			word32 t5_323;
			word32 t6_324;
			word32 t1_321;
			word32 t4_322;
			word32 t0_320;
			s4_123();
			a5_134 = (word32) *s2_121;
			if (a5_134 != 0x00)
			{
				if (a0_114 != 0x00)
					break;
				s2_121 = (word32) s2_121 + 1;
				goto l23088E02;
			}
			s7_106 = (word32) s7 - 1;
		} while (s7 != ~0x00 && a0_114 == 0x00);
	}
	0x00 = (int8) dwArg0128;
}

// 23088ED2: void mbedtls_rsa_pkcs1_encrypt(Register Eq_2 ra, Register (ptr32 Eq_496411) s0, Register (ptr32 Eq_496412) a0, Register (ptr32 code) a1, Register Eq_2 a2, Register int32 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
// Called from:
//      rsa_encrypt_wrap
void mbedtls_rsa_pkcs1_encrypt(Eq_2 ra, struct Eq_496411 * s0, struct Eq_496412 * a0, <anonymous> * a1, Eq_2 a2, int32 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	int32 t4_5 = a0->dw00A4;
	if (t4_5 == 0x00)
		mbedtls_rsa_rsaes_pkcs1_v15_encrypt(ra, s0, a0, a1, a2, a3, a4, a5, a6, s5, s7, s10, s11, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148);
	else
	{
		if (t4_5 != 0x01)
			return;
		mbedtls_rsa_rsaes_oaep_encrypt(a0, a1, a2, a3, 0x00, 0x00, a4, a5, s3, mstatus, dwArgF8);
	}
}

// 23088F06: void mbedtls_rsa_rsaes_oaep_decrypt(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_496501) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_499913 dwArg04)
// Called from:
//      mbedtls_rsa_pkcs1_decrypt
void mbedtls_rsa_rsaes_oaep_decrypt(Eq_2 ra, Eq_2 s1, struct Eq_496501 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a7, ptr32 mstatus, Eq_2 dwArg00, Eq_499913 dwArg04)
{
	if (a3 == 0x01 && a0->t00A4 != a3)
		return;
	struct Eq_499916 * a0_36 = *((word32) s1 + 4);
	if (s1 > -0x0400)
		return;
	Eq_2 a5_63;
	Eq_2 a0_62 = mbedtls_md_info_from_type((word32) a0_36->b00A8, out a5_63);
	Eq_2 s9_175 = a5;
	Eq_2 s7_104 = a0_62;
	if (a0_62 == 0x00)
		return;
	Eq_2 a0_65 = mbedtls_md_get_size(a0_62);
	Eq_2 s5_188 = a0_65;
	if (s1 < (word32) a0_65 + 1 << 0x01)
		return;
	Eq_2 s2_121;
	Eq_2 s1_120;
	Eq_2 ra_118;
	Eq_2 a0_132;
	if (a5_63 == 0x00)
	{
		word32 s0_606;
		word32 a5_609;
		word32 a2_607;
		word32 a4_608;
		word32 a7_610;
		word32 s4_612;
		word32 s3_611;
		ra_118 = mbedtls_rsa_public(ra, a7, a3, a4, a7, a2, mstatus, dwLoc045C, dwLoc041C, dwLoc03E8, dwLoc03D8, dwLoc03A8, dwLoc0398, dwLoc0378, dwLoc0368, dwLoc0358, dwLoc0338, out s0_606, out s1_120, out a0_132, out a2_607, out a4_608, out a5_609, out a7_610, out s2_121, out s3_611, out s4_612);
	}
	else
	{
		word32 s0_595;
		word32 a2_596;
		word32 a5_599;
		word32 a4_598;
		word32 a3_597;
		word32 a7_600;
		word32 s10_604;
		word32 s4_602;
		word32 s3_601;
		word32 s6_603;
		word32 s11_605;
		ra_118 = mbedtls_rsa_private(ra, s1, a2, a7, fp + -0x0440, a5_63, a7, fp + -0x0440, (word32) a0_65 + 1, a0_62, a1, a2, mstatus, dwLoc0478, dwLoc0468, dwLoc045C, dwLoc0458, dwLoc0448, dwLoc0428, dwLoc0418, dwLoc0408, dwLoc03F8, dwLoc03E8, dwLoc03D8, dwLoc03CC, dwLoc03C8, dwLoc03B8, dwLoc03AC, dwLoc03A8, dwLoc0398, dwLoc0388, dwLoc037C, dwLoc0378, dwLoc0358, dwLoc0348, out s0_595, out s1_120, out a0_132, out a2_596, out a3_597, out a4_598, out a5_599, out a7_600, out s2_121, out s3_601, out s4_602, out s5_188, out s6_603, out s7_104, out s9_175, out s10_604, out s11_605, out mstatus);
	}
	if (a0_132 == 0x00)
	{
		Eq_2 a3_141;
		Eq_2 a4_142;
		Eq_2 a5_143;
		word32 a0_155;
		Eq_2 a2_157;
		Eq_2 a4_159;
		Eq_2 a5_160;
		ptr32 mstatus_162;
		word32 s1_164;
		Eq_2 s8_168;
		word32 s2_614;
		word32 a3_613;
		word32 s3_615;
		word32 s4_616;
		Eq_2 ra_163 = mbedtls_md_setup(mbedtls_md_init(ra_118, fp + -1132, out a3_141, out a4_142, out a5_143), a0_132, s1_120, fp + -1132, s7_104, 0x00, a3_141, a4_142, a5_143, s2_121, mstatus, dwLoc0470, dwLoc046C, dwLoc0448, dwLoc0378, dwLoc0338, out s1_164, out a0_155, out a2_157, out a3_613, out a4_159, out a5_160, out s2_614, out s3_615, out s4_616, out s8_168, out mstatus_162);
		if (a0_155 != 0x00)
		{
			word32 a5_634;
			mbedtls_md_free(ra_163, fp + -1132, a2_157, a4_159, a5_160, mstatus_162, out a5_634);
		}
		else
		{
			Eq_2 s6_209;
			Eq_2 a2_221;
			Eq_2 a4_223;
			Eq_2 a5_224;
			up32 s1_228;
			up32 s3_230;
			word32 s4_231;
			Eq_500083 s5_232;
			word32 a5_633;
			word32 s6_632;
			word32 a1_617;
			word32 a5_618;
			word32 a4_623;
			word32 s1_620;
			word32 s0_619;
			word32 a2_621;
			word32 s2_625;
			word32 a3_622;
			word32 a5_624;
			word32 s3_626;
			word32 s4_627;
			word32 s5_628;
			word32 s0_629;
			word32 a3_630;
			word32 s2_631;
			mbedtls_md_free(mgf_mask(mgf_mask(mbedtls_md(ra_163, s7_104, s8_168, s9_175, fp + -1120, out a1_617, out a5_618), fp + -0x043F, s5_188, out s0_619, out s1_620, out a2_621, out a3_622, out a4_623, out a5_624, out s2_625, out s3_626, out s4_627, out s5_628, out s6_209), s6_209, s1_164 + -1 - s5_188, out s0_629, out s1_228, out a2_221, out a3_630, out a4_223, out a5_224, out s2_631, out s3_230, out s4_231, out s5_232, out s6_632), fp + -1132, a2_221, a4_223, a5_224, mstatus_162, out a5_633);
			ui32 a5_242 = (word32) bLoc0440;
			byte (* a0_244)[] = (word32) s5_232 + (fp + -0x043F);
			Eq_500083 a3_245 = 0x00;
			while (true)
			{
				int32 a4_247 = a5_242 << 0x18;
				if (a3_245 >= s5_232)
					break;
				a3_245 = (word32) a3_245 + 1;
				a5_242 = (CONVERT(Mem55[fp + -1120 + a3_245:byte], byte, word32) ^ CONVERT(Mem55[a0_244 + a3_245:byte], byte, word32) | a4_247 >> 24) & 0x00FF;
			}
			word32 a0_263 = a0_244 + s5_232;
			int32 s4_266 = s1_228 - s4_231;
			ui32 a1_267 = 0x00;
			int32 a3_268 = 0x00;
			int32 a2_269;
			for (a2_269 = 0x00; s4_266 != a2_269; ++a2_269)
			{
				a1_267 |= (word32) (a0_263 + a2_269);
				a3_268 += ((0x00 - a1_267 | a1_267) & 0x00FF) >> 7 ^ 1;
			}
			Eq_2 a1_287 = a3_268 + 1 + a0_263;
			if ((int32) (byte) ((word32) (a0_263 + a3_268) ^ 1 | a4_247 >> 24) == 0x00 && dwArg04 >= s1_228 - (a1_287 - s3_230))
			{
				*dwLoc039C = dwArg04;
				word32 a5_639;
				word32 a6_640;
				word32 a7_641;
				word32 a1_635;
				word32 a2_636;
				word32 a3_637;
				word32 a4_638;
				memcpy(dwArg00, a1_287, dwLoc039C, out a1_635, out a2_636, out a3_637, out a4_638, out a5_639, out a6_640, out a7_641);
			}
		}
	}
}

// 230890F2: void mbedtls_rsa_rsaes_pkcs1_v15_decrypt(Register Eq_2 ra, Register (ptr32 Eq_496501) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus)
// Called from:
//      mbedtls_rsa_pkcs1_decrypt
void mbedtls_rsa_rsaes_pkcs1_v15_decrypt(Eq_2 ra, struct Eq_496501 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus)
{
	if ((a3 != 0x01 || a0->t00A4 == 0x00) && a0->t0004 <= -0x0400)
	{
		Eq_2 s1_212;
		union Eq_2 * s2_100;
		Eq_2 s3_101;
		word32 s4_102;
		word32 a0_111;
		Eq_2 s6_121 = a3;
		byte * s5_125 = (word32) fp - 0x0420;
		if (a3 == 0x00)
		{
			word32 a4_488;
			word32 a7_490;
			word32 a5_489;
			word32 s0_486;
			word32 a2_487;
			mbedtls_rsa_public(ra, a5, a3, a4, a4, s11, mstatus, dwLoc03FC, dwLoc03BC, dwLoc0388, dwLoc0378, dwLoc0348, dwLoc0338, dwLoc0318, dwLoc0308, dwLoc02F8, dwLoc02D8, out s0_486, out s1_212, out a0_111, out a2_487, out a4_488, out a5_489, out a7_490, out s2_100, out s3_101, out s4_102);
		}
		else
		{
			word32 s10_506;
			word32 mstatus_508;
			word32 s11_507;
			word32 s7_504;
			word32 s9_505;
			word32 a4_501;
			word32 a7_503;
			word32 a5_502;
			word32 a2_499;
			word32 a3_500;
			word32 s0_498;
			mbedtls_rsa_private(ra, a6, a2, a5, (word32) fp - 0x0420, a5, a4, a7, a3, s7, s10, s11, mstatus, dwLoc0418, dwLoc0408, dwLoc03FC, dwLoc03F8, dwLoc03E8, dwLoc03C8, dwLoc03B8, dwLoc03A8, dwLoc0398, dwLoc0388, dwLoc0378, dwLoc036C, dwLoc0368, dwLoc0358, dwLoc034C, dwLoc0348, dwLoc0338, dwLoc0328, dwLoc031C, dwLoc0318, dwLoc02F8, dwLoc02E8, out s0_498, out s1_212, out a0_111, out a2_499, out a3_500, out a4_501, out a5_502, out a7_503, out s2_100, out s3_101, out s4_102, out s5_125, out s6_121, out s7_504, out s9_505, out s10_506, out s11_507, out mstatus_508);
		}
		if (a0_111 == 0x00)
		{
			ui32 a3_124;
			Eq_500311 a5_129;
			word32 a4_117 = (word32) bLoc041F;
			int32 a5_118 = (int32) bLoc0420;
			up32 a2_120 = s4_102 + -3;
			if (s6_121 == 0x01)
			{
				a3_124 = (a4_117 ^ 2 | a5_118) & 0x00FF;
				byte * a6_148 = s5_125 + 2;
				ui32 a1_149 = 0x00;
				up32 a0_150 = 0x00;
				a5_129.u0 = 0x00;
				do
				{
					ui32 a4_154 = (word32) *a6_148;
					a1_149 |= ((a4_154 | 0x00 - a4_154) & 0x00FF) >> 7 ^ 1;
					++a0_150;
					++a6_148;
					a5_129 = (word32) a5_129.u0 + (((0x00 - a1_149 | a1_149) & 0x00FF) >> 7 ^ 1);
				} while (a0_150 < a2_120);
			}
			else
			{
				a3_124 = (a4_117 ^ 1 | a5_118) & 0x00FF;
				word32 a0_126 = s5_125 + 2;
				ui32 a6_127 = 0x00;
				up32 a1_128 = 0x00;
				a5_129.u0 = 0x00;
				do
				{
					a6_127 = (word32) ((word32) *a0_126 != ~0xFE) | a6_127;
					++a1_128;
					++a0_126;
					a5_129 += (a6_127 ^ 1) & 0x00FF;
				} while (a1_128 < a2_120);
			}
			byte * a1_178 = (word32) a5_129 + ((word32) fp - 32);
			if (((word32) (a5_129 < 8) | (a3_124 | (word32) (((word32) a5_129 + ((word32) fp - 32)) + -1022))) == 0x00)
			{
				word32 a2_198 = s4_102 - ((a1_178 + -1021) - s5_125);
				if (s3_101 >= a2_198)
				{
					*s2_100 = (union Eq_2 *) a2_198;
					word32 a6_496;
					word32 a7_497;
					word32 a4_494;
					word32 a5_495;
					word32 a1_491;
					word32 a3_493;
					word32 a2_492;
					memcpy(s1_212, a1_178 + -1021, a2_198, out a1_491, out a2_492, out a3_493, out a4_494, out a5_495, out a6_496, out a7_497);
				}
			}
		}
	}
}

// 23089254: void mbedtls_rsa_pkcs1_decrypt(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_496501) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus)
// Called from:
//      rsa_decrypt_wrap
void mbedtls_rsa_pkcs1_decrypt(Eq_2 ra, Eq_2 s1, struct Eq_496501 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus)
{
	Eq_2 t6_5 = a0->t00A4;
	if (t6_5 == 0x00)
		mbedtls_rsa_rsaes_pkcs1_v15_decrypt(ra, a0, a2, a3, a4, a5, a6, a7, s7, s10, s11, mstatus);
	else
	{
		if (t6_5 != 0x01)
			return;
		mbedtls_rsa_rsaes_oaep_decrypt(ra, s1, a0, a1, a2, a3, 0x00, 0x00, a5, mstatus, a6, dwLoc1C);
	}
}

