pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308928E: void mbedtls_rsa_rsassa_pss_sign(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register word32 s8, Register ptr32 mstatus)
// Called from:
//      mbedtls_rsa_pkcs1_sign
void mbedtls_rsa_rsassa_pss_sign(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, word32 s8, ptr32 mstatus)
{
	Eq_2 s9_19 = a5;
	if (a3 == 0x01 && *((word32) a0 + 0x00A4) != a3 || a1 == 0x00)
		return;
	Eq_500524 s0_49 = *((word32) a0 + 4);
	if (a4 != 0x00)
	{
		word32 a5_553;
		Eq_2 a0_53 = mbedtls_md_info_from_type(a4, out a5_553);
		if (a0_53 == 0x00)
			return;
		s9_19 = mbedtls_md_get_size(a0_53);
	}
	word32 a5_554;
	Eq_2 a0_60 = mbedtls_md_info_from_type((word32) *((word32) a0 + 0x00A8), out a5_554);
	if (a0_60 == 0x00)
		return;
	Eq_2 a0_63 = mbedtls_md_get_size(a0_60);
	Eq_500524 s1_65 = (word32) a0_63 + 1 << 1;
	if (s0_49 < s1_65)
		return;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 tp_390;
	word32 t6_388;
	word32 t5_387;
	word32 t3_386;
	struct Eq_500566 * sp_104;
	word32 s3_105;
	Eq_2 s7_109;
	Eq_2 s11_111;
	Eq_2 a5_112;
	Eq_2 ra_113;
	Eq_2 s0_114;
	word32 s1_115;
	Eq_2 s2_116;
	Eq_2 s10_118;
	word32 a0_119;
	Eq_2 a2_121;
	Eq_2 a4_127;
	word32 t1_128;
	a1();
	if (a0_119 == 0x00)
	{
		Eq_2 s1_137 = s0_114 - s1_115;
		word32 a5_563;
		word32 a2_560;
		word32 a4_562;
		word32 a3_561;
		word32 a1_559;
		struct Eq_497022 * a0_131 = mbedtls_mpi_bitlen(a2_121, a4_127, a5_112, out a1_559, out a2_560, out a3_561, out a4_562, out a5_563);
		byte * a5_138 = (word32) s1_137 + s3_105;
		*a5_138 = 0x01;
		sp_104->ptr0004 = a0_131;
		sp_104->ptr0084 = a5_138 + 1;
		word32 a5_568;
		word32 a7_570;
		word32 a6_569;
		word32 a2_565;
		word32 a4_567;
		word32 a3_566;
		word32 a1_564;
		memcpy(a5_138 + 1, (char *) &sp_104->t0018 + 8, s2_116, out a1_564, out a2_565, out a3_566, out a4_567, out a5_568, out a6_569, out a7_570);
		Eq_2 a3_164;
		Eq_2 a4_165;
		Eq_2 a5_166;
		word32 a0_176;
		Eq_2 a4_180;
		Eq_2 a5_181;
		ptr32 mstatus_183;
		word32 s2_186;
		word32 s3_187;
		word32 a3_573;
		word32 s8_575;
		word32 s4_574;
		word32 a2_572;
		word32 s1_571;
		Eq_2 ra_184 = mbedtls_md_setup(mbedtls_md_init(ra_113, &sp_104->t0014, out a3_164, out a4_165, out a5_166), s0_114, s1_137, &sp_104->t0014, s10_118, 0x00, a3_164, a4_165, a5_166, s2_116, mstatus, sp_104->t0010, sp_104->t0014, sp_104->t0038, sp_104->t0108, sp_104->t0148, out s1_571, out a0_176, out a2_572, out a3_573, out a4_180, out a5_181, out s2_186, out s3_187, out s4_574, out s8_575, out mstatus_183);
		Eq_2 a2_195 = sp_104->t00C4;
		if (a0_176 != 0x00)
		{
			word32 a5_576;
			mbedtls_md_free(ra_184, &sp_104->t0014, a2_195, a4_180, a5_181, mstatus_183, out a5_576);
		}
		else
		{
			word32 a0_234 = (word32) ((a5_227 + -1 & 0x07) < 1);
			struct Eq_496878 * a5_200;
			struct Eq_496878 * a5_207;
			struct Eq_496878 * a5_214;
			struct Eq_496880 * a5_221;
			word32 a5_227;
			Eq_2 a2_242;
			Eq_2 a4_244;
			Eq_2 a5_245;
			ui32 s0_248;
			Eq_2 s1_249;
			word32 s2_250;
			Eq_2 s3_251;
			Eq_2 s6_254;
			word32 a3_578;
			word32 s5_580;
			word32 s4_579;
			word32 a2_577;
			Eq_2 ra_247 = mgf_mask(mbedtls_md_finish(mbedtls_md_update(mbedtls_md_update(mbedtls_md_update(mbedtls_md_starts(ra_184, &sp_104->t0014, a5_181, sp_104->t0010, out a5_200), &sp_104->t0014, a5_200, sp_104->t0010, out a5_207), &sp_104->t0014, a5_207, sp_104->t0010, out a5_214), &sp_104->t0014, a5_214, sp_104->t0010, out a5_221), &sp_104->t0014, a5_221, sp_104->t0010, out a2_577, out a5_227), a0_234 + s3_187, sp_104->dw00E4 + -1 - s2_186 - a0_234, out s0_248, out s1_249, out a2_242, out a3_578, out a4_244, out a5_245, out s2_250, out s3_251, out s4_579, out s5_580, out s6_254);
			Eq_2 a5_262;
			Eq_2 a3_268;
			Eq_2 a4_269;
			word32 a5_583;
			word32 a2_582;
			word32 a1_581;
			*s3_251 = (byte) (0x00FF >> ((s0_248 << 3) + 0x01) - mbedtls_mpi_bitlen(mbedtls_md_free(ra_247, &sp_104->t0014, a2_242, a4_244, a5_245, mstatus_183, out a5_262), a4_244, a5_262, out a1_581, out a2_582, out a3_268, out a4_269, out a5_583) & (word32) (*s3_251));
			Eq_2 s2_276 = (word32) s1_249 + s2_250;
			*s2_276 = 188;
			if (s6_254 == 0x00)
			{
				word32 a4_588;
				word32 a7_590;
				word32 s2_591;
				word32 s3_592;
				word32 s4_593;
				word32 a5_589;
				word32 s1_585;
				word32 a2_587;
				word32 a0_586;
				word32 s0_584;
				mbedtls_rsa_public(ra_247, s3_251, a3_268, a4_269, s2_276, s11_111, mstatus_183, sp_104->t0024, sp_104->t0064, sp_104->t0098, sp_104->t00A8, sp_104->t00D8, sp_104->t00E8, sp_104->t0108, sp_104->t0118, sp_104->t0128, sp_104->t0148, out s0_584, out s1_585, out a0_586, out a2_587, out a4_588, out a5_589, out a7_590, out s2_591, out s3_592, out s4_593);
			}
			else
			{
				word32 a0_596;
				word32 a2_597;
				word32 s0_594;
				word32 s1_595;
				word32 a4_599;
				word32 a7_601;
				word32 s2_602;
				word32 a5_600;
				word32 a3_598;
				word32 s4_604;
				word32 s6_606;
				word32 s7_607;
				word32 s3_603;
				word32 s5_605;
				word32 s10_609;
				word32 mstatus_611;
				word32 s9_608;
				word32 s11_610;
				mbedtls_rsa_private(ra_247, s1_249, s7_109, s3_251, s3_251, -0x0044, s2_276, s3_251, s6_254, s7_109, s10_118, s11_111, mstatus_183, sp_104->t0008, sp_104->t0018, sp_104->t0024, sp_104->t0028, sp_104->t0038, sp_104->t0058, sp_104->t0068, sp_104->t0078, sp_104->t0088, sp_104->t0098, sp_104->t00A8, sp_104->t00B4, sp_104->t00B8, sp_104->t00C8, sp_104->t00D4, sp_104->t00D8, sp_104->t00E8, sp_104->t00F8, sp_104->t0104, sp_104->t0108, sp_104->t0128, sp_104->t0138, out s0_594, out s1_595, out a0_596, out a2_597, out a3_598, out a4_599, out a5_600, out a7_601, out s2_602, out s3_603, out s4_604, out s5_605, out s6_606, out s7_607, out s9_608, out s10_609, out s11_610, out mstatus_611);
			}
		}
	}
}

// 2308942A: void mbedtls_rsa_rsassa_pkcs1_v15_sign(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s2, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      mbedtls_rsa_pkcs1_sign
void mbedtls_rsa_rsassa_pkcs1_v15_sign(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s2, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0198)
{
	Eq_2 s9_23 = a5;
	if (a3 != 0x01 || *((word32) a0 + 0x00A4) == 0x00)
	{
		Eq_2 s0_48 = *((word32) a0 + 4);
		int32 s1_49 = (word32) s0_48 - 3;
		if (a4 != 0x00)
		{
			word32 a5_738;
			Eq_2 a0_52 = mbedtls_md_info_from_type(a4, out a5_738);
			if (a0_52 == 0x00)
				goto l23089462;
			int32 a0_60 = mbedtls_oid_get_oid_by_md(a4, fp + -52, fp + -56, a4);
			if (a0_60 != 0x00)
				goto l23089462;
			s0_48 = dwArg04;
			s1_49 = (word32) s0_48 - 3 - a0_60 + ~0x09;
			s9_23 = mbedtls_md_get_size(a0_52);
		}
		Eq_2 s1_100 = s1_49 - s9_23;
		if (s1_100 > 0x07 && s0_48 >= s1_100)
		{
			Eq_2 a0_141;
			*a7 = 0x00;
			*((word32) a7 + 1) = 0x01;
			Eq_2 a1_87;
			word32 a2_741;
			word32 a0_740;
			word32 t1_739;
			word32 a3_742;
			word32 a5_744;
			word32 a4_743;
			word32 ra_92 = memset(ra, a7 + 2, 0x00FF, s1_100, out t1_739, out a0_740, out a1_87, out a2_741, out a3_742, out a4_743, out a5_744);
			word32 a0_95 = a7 + 2 + s1_100;
			a0_95->b0000 = 0x00;
			if (a4 == 0x00)
				a0_141 = &a0_95->b0001;
			else
			{
				s1_100 = s9_23 & 0x00FF;
				a0_95->b0002 = (byte) ((word32) s1_100 + ((dwArg24 & 0x00FF) + 8));
				a0_95->b0004 = (byte) ((dwArg24 & 0x00FF) + 4);
				a0_95->b0006 = (byte) (dwArg24 & 0x00FF);
				a0_95->b0001 = 0x30;
				a0_95->b0003 = 0x30;
				a0_95->b0005 = 0x06;
				word32 a5_812;
				word32 a6_813;
				word32 a7_814;
				word32 a2_809;
				word32 a3_810;
				word32 a4_811;
				word32 a1_808;
				memcpy(&a0_95->b0006 + 1, a1_87, dwArg24, out a1_808, out a2_809, out a3_810, out a4_811, out a5_812, out a6_813, out a7_814);
				word32 a0_132 = a0_95 + 7 + dwArg04;
				a0_132->b0000 = 0x05;
				a0_132->b0001 = 0x00;
				a0_132->b0002 = 0x04;
				a0_132->b0003 = (byte) s1_100;
				a0_141 = &a0_132->b0003 + 1;
			}
			Eq_2 a4_148;
			Eq_2 a5_149;
			Eq_2 a3_153;
			word32 a1_745;
			word32 a2_746;
			word32 a7_748;
			word32 a6_747;
			memcpy(a0_141, a6, s9_23, out a1_745, out a2_746, out a3_153, out a4_148, out a5_149, out a6_747, out a7_748);
			if (a3 == 0x00)
			{
				word32 s0_749;
				word32 s1_750;
				word32 a4_753;
				word32 a2_752;
				word32 a0_751;
				word32 a5_754;
				word32 s2_756;
				word32 a7_755;
				word32 s3_757;
				word32 s4_758;
				mbedtls_rsa_public(ra_92, a7, a3_153, a4_148, a0, s11, mstatus, dwLoc1C, dwArg24, s1, dwArg68, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_749, out s1_750, out a0_751, out a2_752, out a4_753, out a5_754, out a7_755, out s2_756, out s3_757, out s4_758);
			}
			else
			{
				Eq_2 a3_179;
				Eq_2 a4_180;
				Eq_2 a5_181;
				struct Eq_501154 * s2_186;
				word32 s1_760;
				word32 s0_759;
				word32 s8_765;
				word32 a2_762;
				word32 a1_761;
				word32 s3_763;
				word32 s4_764;
				Eq_2 ra_183 = mycalloc(ra_92, s1_100, 0x01, *((word32) a0 + 4), a3_153, a4_148, a5_149, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_759, out s1_760, out a1_761, out a2_762, out a3_179, out a4_180, out a5_181, out s2_186, out s3_763, out s4_764, out s8_765);
				if (true)
				{
					Eq_2 s1_205;
					Eq_2 s2_206;
					Eq_2 s3_207;
					word32 a4_769;
					word32 s0_766;
					word32 a1_767;
					word32 a3_768;
					word32 s4_770;
					word32 s8_771;
					Eq_2 a5_201;
					Eq_2 a2_198;
					Eq_2 ra_203 = mycalloc(ra_183, 0x01, 0x01, s2_186->t0004, a3_179, a4_180, a5_181, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_766, out s1_205, out a1_767, out a2_198, out a3_768, out a4_769, out a5_201, out s2_206, out s3_207, out s4_770, out s8_771);
					Eq_2 a0_215 = s1_205;
					if (true)
					{
						word32 a0_235;
						Eq_2 a3_236;
						Eq_2 a4_249;
						Eq_2 s2_252;
						Eq_2 s11_263;
						word32 s0_772;
						word32 a7_773;
						word32 s3_774;
						word32 s4_775;
						word32 s6_777;
						word32 s7_778;
						word32 s5_776;
						word32 s9_779;
						word32 s10_780;
						Eq_2 s1_240;
						Eq_2 a5_250;
						Eq_2 a2_248;
						Eq_2 ra_238 = mbedtls_rsa_private(ra_203, s1_205, a2, s3_207, s1_205, a5_201, s2_206, s3_207, a1, a2, s10, s11, mstatus, dwLoc38, s2, dwLoc1C, dwLoc18, dwLoc08, dwArg18, dwArg28, dwArg38, s9, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgE8, dwArgF8, out s0_772, out s1_240, out a0_235, out a2_248, out a3_236, out a4_249, out a5_250, out a7_773, out s2_252, out s3_774, out s4_775, out s5_776, out s6_777, out s7_778, out s9_779, out s10_780, out s11_263, out mstatus);
						if (a0_235 == 0x00)
						{
							struct Eq_501257 * s2_278;
							Eq_2 s3_279;
							ptr32 s4_280;
							word32 a0_289;
							word32 s0_781;
							word32 a4_782;
							word32 a7_783;
							mbedtls_rsa_public(ra_238, s1_240, a3_236, a4_249, s2_252, s11_263, mstatus, dwLoc1C, dwArg24, s1, dwArg68, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_781, out s1_240, out a0_289, out a2_248, out a4_782, out a5_250, out a7_783, out s2_278, out s3_279, out s4_280);
							if (a0_289 == 0x00)
							{
								a2_248 = s2_278->t0004;
								ui32 a4_292 = 0x00;
								Eq_2 a5_293 = 0x00;
								while (a2_248 != a5_293)
								{
									a5_293 = (word32) a5_293 + 1;
									a4_292 |= CONVERT(Mem166[s4_280 + a5_293:byte], byte, word32) ^ CONVERT(Mem166[s3_279 + a5_293:byte], byte, word32);
								}
								ui32 a5_309 = (word32) (byte) a4_292;
								a5_250 = a5_309 & 0x00FF;
								if ((a5_309 & 0x00FF) == 0x00)
								{
									word32 a1_784;
									word32 a3_785;
									word32 a4_786;
									word32 a6_787;
									word32 a7_788;
									memcpy(s3_279, s1_240, a2_248, out a1_784, out a2_248, out a3_785, out a4_786, out a5_250, out a6_787, out a7_788);
								}
							}
						}
						Eq_2 s4_347;
						word32 a4_794;
						word32 a6_795;
						word32 t3_796;
						word32 a0_791;
						word32 a1_792;
						word32 a3_793;
						word32 s1_790;
						word32 s0_789;
						vPortFree(s1_240, a2_248, a5_250, mstatus, dwArg0118, dwArg0158, out s0_789, out s1_790, out a0_791, out a1_792, out a2_198, out a3_793, out a4_794, out a5_201, out a6_795, out s4_347, out t3_796);
						a0_215 = s4_347;
					}
					word32 s4_806;
					word32 t3_807;
					word32 a4_803;
					word32 a5_804;
					word32 a6_805;
					word32 a1_800;
					word32 a2_801;
					word32 a3_802;
					word32 s0_797;
					word32 s1_798;
					word32 a0_799;
					vPortFree(a0_215, a2_198, a5_201, mstatus, dwArg0118, dwArg0158, out s0_797, out s1_798, out a0_799, out a1_800, out a2_801, out a3_802, out a4_803, out a5_804, out a6_805, out s4_806, out t3_807);
				}
			}
l23089468:
			0x00 = dwArg0198;
			return;
		}
		goto l23089462;
	}
	else
	{
l23089462:
		goto l23089468;
	}
}

