pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 230895F6: void mbedtls_rsa_pkcs1_sign(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s2, Register word32 s8, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      rsa_sign_wrap
void mbedtls_rsa_pkcs1_sign(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s2, word32 s8, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0198)
{
	Eq_2 t1_5 = *((word32) a0 + 0x00A4);
	if (t1_5 == 0x00)
		mbedtls_rsa_rsassa_pkcs1_v15_sign(ra, s1, a0, a1, a2, a3, a4, a5, a6, a7, s2, s9, s10, s11, mstatus, dwArg04, dwArg18, dwArg24, dwArg28, dwArg38, dwArg68, dwArg74, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0158, dwArg0198);
	else
	{
		if (t1_5 != 0x01)
			return;
		mbedtls_rsa_rsassa_pss_sign(ra, a0, a1, a2, a3, a4, a5, a6, a7, s8, mstatus);
	}
}

// 23089614: Register Eq_2 mbedtls_rsa_rsassa_pss_verify_ext(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a7, Register Eq_2 s3, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_pk_verify_ext
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_rsassa_pss_verify_ext(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a7, Eq_2 s3, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & a7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a4_100;
	Eq_2 s0_120;
	Eq_2 s5_129 = a4;
	Eq_2 s9_137 = a7;
	Eq_2 s7_287 = dwArg00;
	Eq_2 a5_101 = dwArg04;
	if (a3 == 0x01)
	{
		a4_100 = *((word32) a0 + 0x00A4);
		if (a4_100 != a3)
			goto l23089664;
	}
	Eq_2 s2_43 = *((word32) a0 + 4);
	a4_100.u0 = 1008;
	if (s2_43 > -0x0400)
		goto l23089664;
	Eq_2 s2_107;
	Eq_2 s4_109;
	Eq_2 ra_104;
	Eq_2 a0_118;
	if (a3 == 0x00)
	{
		word32 s3_791;
		word32 a2_790;
		word32 s1_789;
		word32 s0_788;
		ra_104 = mbedtls_rsa_public(ra, dwArg04, a3, 1008, s2_43, s11, mstatus, dwLoc044C, dwLoc040C, dwLoc03D8, dwLoc03C8, dwLoc0398, dwLoc0388, dwLoc0368, dwLoc0358, dwLoc0348, dwLoc0328, out s0_788, out s1_789, out a0_118, out a2_790, out a4_100, out a5_101, out a7, out s2_107, out s3_791, out s4_109);
	}
	else
	{
		word32 a2_784;
		word32 a3_785;
		word32 s3_786;
		word32 s6_787;
		word32 s1_783;
		word32 s0_782;
		ra_104 = mbedtls_rsa_private(ra, a0, a2, dwArg04, fp + -0x0430, dwArg04, s2_43, s3, a5, dwArg00, s10, s11, mstatus, dwLoc0468, dwLoc0458, dwLoc044C, dwLoc0448, dwLoc0438, dwLoc0418, dwLoc0408, dwLoc03F8, dwLoc03E8, dwLoc03D8, dwLoc03C8, dwLoc03BC, dwLoc03B8, dwLoc03A8, dwLoc039C, dwLoc0398, dwLoc0388, dwLoc0378, dwLoc036C, dwLoc0368, dwLoc0348, dwLoc0338, out s0_782, out s1_783, out a0_118, out a2_784, out a3_785, out a4_100, out a5_101, out a7, out s2_107, out s3_786, out s4_109, out s5_129, out s6_787, out s7_287, out s9_137, out s10, out s11, out mstatus);
	}
	s0_120 = a0_118;
	if (a0_118 != 0x00)
	{
l2308966A:
		a4Out = a4_100;
		a5Out = a5_101;
		a7Out = a7;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return s0_120;
	}
	Eq_2 s3_122 = (word32) s2_107 - 1;
	a4_100 = (word32) ((word32) s3_122 + (fp + -48) + -0x0400);
	a5_101.u0 = 188;
	if (a4_100 != 188)
	{
l23089816:
		s0_120.u0 = ~0x040000FF;
		goto l2308966A;
	}
	if (s5_129 != 0x00)
	{
		Eq_2 a0_132 = mbedtls_md_info_from_type(s5_129, out a5_101);
		if (a0_132 == 0x00)
		{
l23089664:
			s0_120.u0 = ~0x0400007F;
			goto l2308966A;
		}
		mbedtls_md_get_size(a0_132);
	}
	Eq_2 a0_140 = mbedtls_md_info_from_type(s9_137, out a5_101);
	if (a0_140 != 0x00)
	{
		Eq_2 a0_143 = mbedtls_md_get_size(a0_140);
		word32 a1_794;
		word32 a0_793;
		word32 t1_792;
		word32 a3_795;
		Eq_2 a2_153;
		Eq_2 a4_155;
		Eq_2 a5_156;
		Eq_2 ra_157 = memset(ra_104, fp + -0x0464, 0x00, 0x08, out t1_792, out a0_793, out a1_794, out a2_153, out a3_795, out a4_155, out a5_156);
		word32 a4_799;
		word32 a1_796;
		word32 a2_797;
		word32 a3_798;
		word32 a5_800;
		struct Eq_497022 * a0_163 = mbedtls_mpi_bitlen(a2_153, a4_155, a5_156, out a1_796, out a2_797, out a3_798, out a4_799, out a5_800);
		Eq_2 s1_173 = s4_109;
		if (((char *) a0_163 - 1 & 7) == 0x00)
		{
			s2_107 = s3_122;
			s1_173 = fp + -1071;
		}
		a5_101 = (word32) bLoc0430;
		a4_100 = a5_101 >> ((char *) a0_163 + 7) + ((word32) s2_107 - 8);
		if (a4_100 == 0x00)
		{
			Eq_2 a3_194;
			Eq_2 a4_195;
			Eq_2 a5_196;
			Eq_2 a0_208;
			Eq_2 a2_210;
			Eq_2 a5_213;
			Eq_2 s1_217;
			word32 s2_218;
			word32 a3_801;
			word32 s3_802;
			word32 s4_803;
			word32 s8_804;
			Eq_2 ra_216 = mbedtls_md_setup(mbedtls_md_init(ra_157, fp + -1116, out a3_194, out a4_195, out a5_196), a0_140, s1_173, fp + -1116, a0_140, 0x00, a3_194, a4_195, a5_196, s2_107, mstatus, dwLoc0460, dwLoc045C, dwLoc0438, dwLoc0368, dwLoc0328, out s1_217, out a0_208, out a2_210, out a3_801, out a4_100, out a5_213, out s2_218, out s3_802, out s4_803, out s8_804, out mstatus);
			s0_120 = a0_208;
			if (a0_208 != 0x00)
			{
				mbedtls_md_free(ra_216, fp + -1116, a2_210, a4_100, a5_213, mstatus, out a5_101);
				goto l2308966A;
			}
			a4_100 = (word32) bLoc0430;
			Eq_2 a2_236;
			ui32 s2_244;
			word32 s3_245;
			byte * s4_246;
			Eq_2 s5_247;
			word32 s0_805;
			word32 a3_806;
			word32 a5_808;
			word32 s6_809;
			word32 a4_807;
			Eq_2 s1_243;
			Eq_2 ra_241 = mgf_mask(ra_216, s1_217, ~a0_143 + s2_218, out s0_805, out s1_243, out a2_236, out a3_806, out a4_807, out a5_808, out s2_244, out s3_245, out s4_246, out s5_247, out s6_809);
			Eq_2 a5_259 = 0x00FF >> (s2_244 << 0x03) - ((char *) a0_163 - 1) & a4_100;
			Eq_2 s2_261 = s4_246 + s2_244;
			while (s1_243 < s2_261)
			{
				a5_259 = (word32) *s1_243;
				a4_100 = (word32) s1_243 + 1;
				if (a5_259 != 0x00)
					goto l23089798;
				s1_243 = a4_100;
			}
			if (s2_261 == s1_243)
			{
l23089810:
				mbedtls_md_free(ra_241, fp + -1116, a2_236, a4_100, a5_259, mstatus, out a5_101);
				goto l23089816;
			}
l23089798:
			a4_100 = (word32) *s1_243;
			a5_259.u0 = 0x01;
			word32 s0_272 = s1_243 + 1;
			if (a4_100 != 0x01)
				goto l23089810;
			a5_259.u0 = ~0x00;
			Eq_2 s3_282 = s3_245 - s5_247 - (s0_272 - s4_246);
			if (s7_287 != ~0x00 && s7_287 != s3_282)
				goto l23089810;
			struct Eq_496878 * a5_317;
			struct Eq_496878 * a5_324;
			struct Eq_496878 * a5_337;
			struct Eq_496880 * a5_346;
			Eq_2 a2_351;
			Eq_2 a5_352;
			word32 a5_810;
			mbedtls_md_free(mbedtls_md_finish(mbedtls_md_update(mbedtls_md_update(mbedtls_md_update(mbedtls_md_starts(ra_241, fp + -1116, ~0x00, dwLoc0460, out a5_317), fp + -1116, a5_317, dwLoc0460, out a5_324), fp + -1116, a5_324, dwLoc0460, out a5_337), fp + -1116, a5_337, dwLoc0460, out a5_346), fp + -1116, a5_346, dwLoc0460, out a2_351, out a5_352), fp + -1116, a2_351, a4_100, a5_352, mstatus, out a5_810);
			word32 a1_811;
			word32 a2_812;
			word32 a3_813;
			word32 a0_364 = memcmp(s0_272 + s3_282, fp + -1104, s5_247, out a1_811, out a2_812, out a3_813, out a4_100, out a5_101);
			s0_120 = a0_364;
			if (a0_364 != 0x00)
				s0_120.u0 = ~0x0400037F;
			goto l2308966A;
		}
	}
	goto l23089664;
}

// 2308981E: Register Eq_2 mbedtls_rsa_rsassa_pss_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Register out ptr32 a5Out)
// Called from:
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_rsassa_pss_verify(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s10, Eq_2 s11, ptr32 mstatus, ptr32 & a5Out)
{
	Eq_2 t1_7 = *((word32) a0 + 0x00A8);
	Eq_2 a7_10 = t1_7 & 0x00FF;
	if (t1_7 == 0x00)
		a7_10 = a4;
	word32 mstatus_68;
	word32 s11_67;
	word32 s10_66;
	word32 a7_65;
	word32 a4_64;
	ptr32 a5_38;
	Eq_2 a0_36 = mbedtls_rsa_rsassa_pss_verify_ext(ra, a0, a2, a3, a4, a5, a7_10, s3, s10, s11, mstatus, ~0x00, dwLoc1C, out a4_64, out a5_38, out a7_65, out s10_66, out s11_67, out mstatus_68);
	a5Out = a5_38;
	return a0_36;
}

