pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23089842: Register Eq_2 mbedtls_rsa_rsassa_pkcs1_v15_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_rsassa_pkcs1_v15_verify(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, union Eq_2 & a5Out)
{
	if (a3 == 0x01 && *((word32) a0 + 0x00A4) != 0x00)
	{
		a5Out = a5;
		return ~0x0400007F;
	}
	Eq_2 a0_111;
	if (*((word32) a0 + 4) <= -0x0400)
	{
		Eq_2 s3_101;
		Eq_2 s2_100;
		Eq_2 s1_141;
		Eq_501877 s0_122;
		ui32 s4_102;
		if (a3 == 0x00)
		{
			word32 a4_611;
			word32 a7_612;
			word32 a2_610;
			mbedtls_rsa_public(ra, a7, a3, a4, a4, s11, mstatus, dwLoc041C, dwLoc03DC, dwLoc03A8, dwLoc0398, dwLoc0368, dwLoc0358, dwLoc0338, dwLoc0328, dwLoc0318, dwLoc02F8, out s0_122, out s1_141, out a0_111, out a2_610, out a4_611, out a5, out a7_612, out s2_100, out s3_101, out s4_102);
		}
		else
		{
			word32 s11_648;
			word32 mstatus_649;
			word32 s10_647;
			word32 s9_646;
			word32 s5_643;
			word32 s7_645;
			word32 s6_644;
			word32 a7_642;
			word32 a4_641;
			word32 a2_639;
			word32 a3_640;
			mbedtls_rsa_private(ra, a5, a2, a7, fp + -0x0420, a5, a4, a6, s6, s7, s10, s11, mstatus, dwLoc0438, dwLoc0428, dwLoc041C, dwLoc0418, dwLoc0408, dwLoc03E8, dwLoc03D8, dwLoc03C8, dwLoc03B8, dwLoc03A8, dwLoc0398, dwLoc038C, dwLoc0388, dwLoc0378, dwLoc036C, dwLoc0368, dwLoc0358, dwLoc0348, dwLoc033C, dwLoc0338, dwLoc0318, dwLoc0308, out s0_122, out s1_141, out a0_111, out a2_639, out a3_640, out a4_641, out a5, out a7_642, out s2_100, out s3_101, out s4_102, out s5_643, out s6_644, out s7_645, out s9_646, out s10_647, out s11_648, out mstatus_649);
		}
		if (a0_111 != 0x00)
		{
l2308985E:
			a5Out = a5;
			return a0_111;
		}
		a5 = (word32) bLoc0420;
		if (a5 != 0x00)
		{
l230898C2:
			a0_111.u0 = ~0x040000FF;
			goto l2308985E;
		}
		a5.u0 = 0x01;
		if ((word32) bLoc041F != 0x01)
			goto l230898C2;
		a5 = (word32) s0_122 + (s4_102 + -1);
		while (true)
		{
			int32 a4_129 = (word32) *a0_111.u0;
			if (a4_129 == 0x00)
				break;
			if (a0_111 >= a5 || a4_129 != 0x00FF)
				goto l230898C2;
			a0_111 = (byte) a0_111.u0 + 1;
		}
		Eq_2 a0_134 = (byte) a0_111.u0 + 1;
		Eq_2 s0_139 = s4_102 - (a0_134 - s0_122);
		if (s0_139 == s1_141 && s2_100 == 0x00)
		{
			word32 a4_616;
			word32 a3_615;
			word32 a2_614;
			word32 a1_613;
			a0_111 = memcmp(a0_134, s3_101, s1_141, out a1_613, out a2_614, out a3_615, out a4_616, out a5);
			if (a0_111 == 0x00)
				goto l2308985E;
			goto l23089914;
		}
		Eq_2 a0_146 = mbedtls_md_info_from_type(s2_100, out a5);
		if (a0_146 != 0x00)
		{
			Eq_2 a0_150 = mbedtls_md_get_size(a0_146);
			word32 s1_158 = s1_141 + s0_139;
			word32 a4_620;
			word32 a3_619;
			word32 a2_618;
			word32 a1_617;
			if (mbedtls_asn1_get_tag(s1_158, fp + -0x0434, 48, a5, out a1_617, out a2_618, out a3_619, out a4_620, out a5) == 0x00)
			{
				a5 = (word32) a5 + 2;
				if ((word32) a5 + 2 == s0_139)
				{
					word32 a4_624;
					word32 a3_623;
					word32 a1_621;
					word32 a2_622;
					if (mbedtls_asn1_get_tag(s1_158, fp + -0x0434, 48, (word32) a5 + 2, out a1_621, out a2_622, out a3_623, out a4_624, out a5) == 0x00)
					{
						a5 = (word32) a0_150 + ((word32) a5 + 6);
						if (a5 == s0_139)
						{
							Eq_2 a2_192;
							word32 a4_194;
							word32 a3_626;
							word32 a1_625;
							if (mbedtls_asn1_get_tag(s1_158, fp + -0x0428, 0x06, a5, out a1_625, out a2_192, out a3_626, out a4_194, out a5) == 0x00)
							{
								Eq_2 a5_201 = (word32) a5 + a4_194;
								byte bLoc0435_363 = SLICE(a5_201, byte, 24);
								word32 a0_203;
								Eq_2 s2_210;
								Eq_2 s1_209 = mbedtls_oid_get_md_alg(fp + -0x042C, fp + -1077, a2_192, a5_201, dwLoc0408, out a0_203, out s2_210);
								if (a0_203 == 0x00)
								{
									a5 = (word32) bLoc0435_363;
									if (a5 == s2_210)
									{
										word32 a4_630;
										word32 a3_629;
										word32 a2_628;
										word32 a1_627;
										if (mbedtls_asn1_get_tag(s1_209, fp + -0x0434, 0x05, a5, out a1_627, out a2_628, out a3_629, out a4_630, out a5) == 0x00)
										{
											word32 a4_634;
											word32 a3_633;
											word32 a2_632;
											word32 a1_631;
											Eq_2 a0_228 = mbedtls_asn1_get_tag(s1_209, fp + -0x0434, 0x04, a5, out a1_631, out a2_632, out a3_633, out a4_634, out a5);
											if (a0_228 == 0x00 && a5 == a0_150)
											{
												word32 a4_638;
												word32 a3_637;
												word32 a2_636;
												word32 a1_635;
												a0_111 = memcmp(a0_228, s3_101, a0_150, out a1_635, out a2_636, out a3_637, out a4_638, out a5);
												if (a0_111 == 0x00 && s1_209 == a0_150 + a5)
													goto l2308985E;
											}
										}
									}
								}
							}
						}
					}
				}
			}
l23089914:
			a0_111.u0 = ~0x0400037F;
			goto l2308985E;
		}
	}
	a0_111.u0 = ~0x0400007F;
	goto l2308985E;
}

// 230899D2: Register Eq_2 mbedtls_rsa_pkcs1_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      rsa_verify_wrap
Eq_2 mbedtls_rsa_pkcs1_verify(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, union Eq_2 & a5Out)
{
	Eq_2 t1_5 = *((word32) a0 + 0x00A4);
	if (t1_5 == 0x00)
	{
		Eq_2 a5_25;
		Eq_2 a0_18 = mbedtls_rsa_rsassa_pkcs1_v15_verify(ra, a0, a2, a3, a4, a5, a6, a7, s6, s7, s10, s11, mstatus, out a5_25);
		a5Out = a5_25;
		return a0_18;
	}
	else if (t1_5 == 0x01)
	{
		Eq_2 a5_48;
		Eq_2 a0_43 = mbedtls_rsa_rsassa_pss_verify(ra, a0, a2, a3, a4, a5, s3, s10, s11, mstatus, out a5_48);
		a5Out = a5_48;
		return a0_43;
	}
	else
	{
		a5Out = a5;
		return ~0x040000FF;
	}
}

// 230899F0: Register Eq_2 mbedtls_rsa_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      rsa_free_wrap
Eq_2 mbedtls_rsa_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a2_16;
	Eq_2 a5_17;
	Eq_2 a4_20;
	word32 a0_183;
	word32 a1_184;
	word32 a3_185;
	word32 a6_186;
	word32 s4_187;
	mbedtls_mpi_free((word32) a0 + 0x008C, a2, a4, a5, mstatus, dwArg0138, dwArg0178, out a0_183, out a1_184, out a2_16, out a3_185, out a4_20, out a5_17, out a6_186, out s4_187);
	Eq_2 a2_28;
	Eq_2 a5_29;
	Eq_2 a4_32;
	word32 a0_188;
	word32 a1_189;
	word32 a3_190;
	word32 a6_191;
	word32 s4_192;
	mbedtls_mpi_free((word32) a0 + 0x0098, a2_16, a4_20, a5_17, mstatus, dwArg0138, dwArg0178, out a0_188, out a1_189, out a2_28, out a3_190, out a4_32, out a5_29, out a6_191, out s4_192);
	Eq_2 a2_40;
	Eq_2 a5_41;
	Eq_2 a4_44;
	word32 a0_193;
	word32 a1_194;
	word32 a3_195;
	word32 a6_196;
	word32 s4_197;
	mbedtls_mpi_free((word32) a0 + 0x0080, a2_28, a4_32, a5_29, mstatus, dwArg0138, dwArg0178, out a0_193, out a1_194, out a2_40, out a3_195, out a4_44, out a5_41, out a6_196, out s4_197);
	Eq_2 a2_52;
	Eq_2 a5_53;
	Eq_2 a4_56;
	word32 a0_198;
	word32 a1_199;
	word32 a3_200;
	word32 a6_201;
	word32 s4_202;
	mbedtls_mpi_free((word32) a0 + 116, a2_40, a4_44, a5_41, mstatus, dwArg0138, dwArg0178, out a0_198, out a1_199, out a2_52, out a3_200, out a4_56, out a5_53, out a6_201, out s4_202);
	Eq_2 a2_64;
	Eq_2 a5_65;
	Eq_2 a4_68;
	word32 a0_203;
	word32 a1_204;
	word32 a3_205;
	word32 a6_206;
	word32 s4_207;
	mbedtls_mpi_free((word32) a0 + 0x0068, a2_52, a4_56, a5_53, mstatus, dwArg0138, dwArg0178, out a0_203, out a1_204, out a2_64, out a3_205, out a4_68, out a5_65, out a6_206, out s4_207);
	Eq_2 a2_76;
	Eq_2 a5_77;
	Eq_2 a4_80;
	word32 a0_208;
	word32 a1_209;
	word32 a3_210;
	word32 a6_211;
	word32 s4_212;
	mbedtls_mpi_free((word32) a0 + 92, a2_64, a4_68, a5_65, mstatus, dwArg0138, dwArg0178, out a0_208, out a1_209, out a2_76, out a3_210, out a4_80, out a5_77, out a6_211, out s4_212);
	Eq_2 a2_88;
	Eq_2 a5_89;
	Eq_2 a4_92;
	word32 a0_213;
	word32 a1_214;
	word32 a3_215;
	word32 a6_216;
	word32 s4_217;
	mbedtls_mpi_free((word32) a0 + 80, a2_76, a4_80, a5_77, mstatus, dwArg0138, dwArg0178, out a0_213, out a1_214, out a2_88, out a3_215, out a4_92, out a5_89, out a6_216, out s4_217);
	Eq_2 a2_100;
	Eq_2 a5_101;
	Eq_2 a4_104;
	word32 a0_218;
	word32 a1_219;
	word32 a3_220;
	word32 a6_221;
	word32 s4_222;
	mbedtls_mpi_free((word32) a0 + 0x0044, a2_88, a4_92, a5_89, mstatus, dwArg0138, dwArg0178, out a0_218, out a1_219, out a2_100, out a3_220, out a4_104, out a5_101, out a6_221, out s4_222);
	Eq_2 a2_112;
	Eq_2 a5_113;
	Eq_2 a4_116;
	word32 a0_223;
	word32 a1_224;
	word32 a3_225;
	word32 a6_226;
	word32 s4_227;
	mbedtls_mpi_free((word32) a0 + 56, a2_100, a4_104, a5_101, mstatus, dwArg0138, dwArg0178, out a0_223, out a1_224, out a2_112, out a3_225, out a4_116, out a5_113, out a6_226, out s4_227);
	Eq_2 a2_124;
	Eq_2 a5_125;
	Eq_2 a4_128;
	word32 a0_228;
	word32 a1_229;
	word32 a3_230;
	word32 a6_231;
	word32 s4_232;
	mbedtls_mpi_free((word32) a0 + 44, a2_112, a4_116, a5_113, mstatus, dwArg0138, dwArg0178, out a0_228, out a1_229, out a2_124, out a3_230, out a4_128, out a5_125, out a6_231, out s4_232);
	Eq_2 a2_136;
	Eq_2 a5_137;
	Eq_2 a4_140;
	word32 a0_233;
	word32 a1_234;
	word32 a3_235;
	word32 a6_236;
	word32 s4_237;
	mbedtls_mpi_free((word32) a0 + 32, a2_124, a4_128, a5_125, mstatus, dwArg0138, dwArg0178, out a0_233, out a1_234, out a2_136, out a3_235, out a4_140, out a5_137, out a6_236, out s4_237);
	Eq_2 a5_149;
	Eq_2 a4_152;
	word32 a0_238;
	word32 a1_239;
	word32 a2_240;
	word32 a3_241;
	word32 a6_242;
	word32 s4_243;
	mbedtls_mpi_free((word32) a0 + 20, a2_136, a4_140, a5_137, mstatus, dwArg0138, dwArg0178, out a0_238, out a1_239, out a2_240, out a3_241, out a4_152, out a5_149, out a6_242, out s4_243);
	union Eq_2 * a5_164;
	ptr32 a3_166;
	ptr32 a4_167;
	word32 a0_244;
	word32 a1_245;
	word32 a2_246;
	word32 a6_247;
	word32 s4_248;
	Eq_2 s1_169 = mbedtls_mpi_free((word32) a0 + 8, dwArg10, a4_152, a5_149, mstatus, dwArg0148, dwArg0188, out a0_244, out a1_245, out a2_246, out a3_166, out a4_167, out a5_164, out a6_247, out s4_248);
	a3Out = a3_166;
	a4Out = a4_167;
	a5Out = a5_164;
	return s1_169;
}

// 23089A66: Register Eq_2 mbedtls_sha256_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 t1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      mbedtls_ssl_setup
//      sha224_ctx_alloc
//      sha256_wrap
Eq_2 mbedtls_sha256_init(Eq_2 ra, Eq_2 a0, ptr32 & t1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	ptr32 t1_15;
	word32 a0_20;
	word32 a1_21;
	word32 a2_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 116, out t1_15, out a0_20, out a1_21, out a2_22, out a3_10, out a4_11, out a5_12);
	t1Out = t1_15;
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 23089A70: Register Eq_2 mbedtls_sha256_free(Register Eq_2 a0, Register out ptr32 a5Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      mbedtls_ssl_handshake_free
//      sha224_ctx_free
//      sha256_wrap
Eq_2 mbedtls_sha256_free(Eq_2 a0, ptr32 & a5Out)
{
	Eq_2 a0_5;
	a0_5 = a0;
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (a0_5 != (word32) a0 + 116)
		{
			*a0_5 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
	a5Out = (word32) a0 + 116;
	return a0_5;
}

