pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 23089A84: Register uint32 mbedtls_sha256_clone(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a2Out, Register out ptr32 a5Out, Register out ptr32 a7Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      sha224_clone_wrap
uint32 mbedtls_sha256_clone(Eq_2 a0, Eq_2 a1, ptr32 & a2Out, ptr32 & a5Out, ptr32 & a7Out)
{
	ptr32 a5_10;
	ptr32 a7_11;
	word32 a1_29;
	word32 a2_30;
	word32 a3_31;
	word32 a4_32;
	word32 a6_33;
	uint32 t1_17 = memcpy(a0, a1, 116, out a1_29, out a2_30, out a3_31, out a4_32, out a5_10, out a6_33, out a7_11);
	a2Out = dwArg10;
	a5Out = a5_10;
	a7Out = a7_11;
	return t1_17;
}

// 23089A96: Register (ptr32 Eq_502498) mbedtls_sha256_starts(Register Eq_2 a0, Register (ptr32 Eq_493410) a1)
// Called from:
//      mbedtls_entropy_init
//      mbedtls_ssl_reset_checksum
//      mbedtls_ssl_setup
//      sha256_wrap
//      sha224_starts_wrap
//      sha256_starts_wrap
struct Eq_502498 * mbedtls_sha256_starts(Eq_2 a0, struct Eq_493410 * a1)
{
	struct Eq_502498 * a5_29;
	*a0 = 0x00;
	*((word32) a0 + 4) = 0x00;
	if (a1 == null)
	{
		*(union Eq_2 *) 1779033711 = a0;
		*(union Eq_2 *) 3144134289 = a0;
		*(union Eq_2 *) 0x3C6EF382 = a0;
		*(union Eq_2 *) 2773480782 = a0;
		*(union Eq_2 *) 1359893143 = a0;
		*(union Eq_2 *) 2600822952 = a0;
		*(union Eq_2 *) 528734667 = a0;
		a5_29 = (struct Eq_502498 *) 1541459225;
	}
	else
	{
		*(union Eq_2 *) 0xC1059EE0 = a0;
		*(union Eq_2 *) 914150675 = a0;
		*(union Eq_2 *) 0x3070DD27 = a0;
		*(union Eq_2 *) 4144912717 = a0;
		*(union Eq_2 *) 0xFFC00B49 = a0;
		*(union Eq_2 *) 1750603053 = a0;
		*(union Eq_2 *) 1694076871 = a0;
		a5_29 = (struct Eq_502498 *) ~0x4105B05B;
	}
	a5_29->t0024 = a0;
	a1->t0068 = a0;
	return a5_29;
}

// 23089B44: Register uint32 mbedtls_sha256_process(Register uint32 t1, Register word32 a0, Register (ptr32 Eq_502548) a1, Register (ptr32 Eq_493410) a3, Register Eq_502550 a7, Register out Eq_502551 a3Out, Register out Eq_502550 a7Out)
// Called from:
//      sha224_process_wrap
//      sha224_update_wrap
uint32 mbedtls_sha256_process(uint32 t1, word32 a0, struct Eq_502548 * a1, struct Eq_493410 * a3, Eq_502550 a7, union Eq_502551 & a3Out, union Eq_502550 & a7Out)
{
	struct Eq_502553 * s2_9 = a0 + 8;
	int32 * s3_10 = fp + -336;
	struct Eq_502560 * a4_26 = fp + -336;
	do
	{
		word32 a5_30 = a3->dw0000;
		++a4_26;
		a4_26[0x03FF] = (struct Eq_502560) a3;
	} while (a0 + 40 != a5_30 + 0x04);
	struct Eq_502576 * a4_116 = fp + -304;
	a1_350 = a1;
	do
	{
		struct Eq_502548 * a1_350;
		++a1_350;
		ui32 a3_54 = (word32) a1_350->bFFFFFFFE;
		++a4_116;
		uint32 a5_120 = (word32) a1_350->b0000 << 24 | (word32) a1_350->b0001 << 16 | (word32) a1_350->bFFFFFFFF | a3_54 << 8;
		a4_116[0x03FF] = (struct Eq_502576) a5_120;
		Eq_502551 a3_113 = a3_54 << 8;
	} while (a1 + 16 != a1_350);
	0x00 = dwLocCC;
	struct Eq_502621 * t3_401 = dwLoc0148;
	uint32 a6_274 = dwLoc0128;
	uint32 a2_101 = dwLoc6C;
	struct Eq_502627 * s1_448 = &g_a230C6C54->dw001C;
	struct Eq_502621 * t6_70 = dwLoc0148;
	struct Eq_502630 * t4_71 = &g_a230C6C54->dw001C;
	do
	{
		word32 a6_100 = a6_274 + (((((a7 >> 0x06 | a7 << 0x1A) ^ (a7 >> 11 | a7 << 0x15)) ^ (a7 << 0x07 | a7 >> 0x19)) + (t4_71->dw0000 + t6_70->dw0000)) + ((t1 ^ a1_350) & a7 ^ t1));
		++t6_70;
		++t4_71;
		uint32 a5_121 = a5_120 + a6_100;
		int32 t5_142 = ((a5_121 >> 0x06 | a5_121 << 0x1A) ^ (a5_121 >> 11 | a5_121 << 0x15) ^ (a5_121 << 0x07 | a5_121 >> 0x19)) + ((t1 + (t4_71->dwFFFFFFE4 + t6_70->dwFFFFFFE4)) + ((a7 ^ a1_350) & a5_121 ^ a1_350));
		uint32 a6_123 = a6_100 + ((((a2_101 >> 0x02 | a2_101 << 0x1E) ^ (a2_101 >> 0x0D | a2_101 << 0x13)) ^ (a2_101 << 0x0A | a2_101 >> 22)) + ((a2_101 | a3_113) & a4_116 | a2_101 & a3_113));
		Eq_502724 a4_160 = a4_116 + t5_142 / 4;
		ui32 t5_180 = a1_350 + (t4_71->dwFFFFFFE8 + t6_70->dwFFFFFFE8) / 4 + ((a5_121 ^ a7) & a4_160 ^ a7) / 4 + (((a4_160 >> 0x06 | a4_160 << 0x1A) ^ (a4_160 >> 11 | a4_160 << 0x15)) ^ (a4_160 << 0x07 | a4_160 >> 0x19)) / 4;
		uint32 t1_159 = ((a6_123 >> 0x02 | a6_123 << 0x1E) ^ (a6_123 >> 0x0D | a6_123 << 0x13) ^ (a6_123 << 0x0A | a6_123 >> 22)) + ((a6_123 | a2_101) & a3_113 | a6_123 & a2_101) + t5_142;
		uint32 a3_198 = (word32) a3_113.u0 + t5_180;
		uint32 t5_218 = ((a3_198 >> 0x06 | a3_198 << 0x1A) ^ (a3_198 >> 11 | a3_198 << 0x15) ^ (a3_198 << 0x07 | a3_198 >> 0x19)) + (((word32) a7.u0 + (t4_71->dwFFFFFFEC + t6_70->dwFFFFFFEC)) + ((a5_121 ^ a4_160) & a3_198 ^ a5_121));
		uint32 a1_197 = ((t1_159 >> 0x02 | t1_159 << 0x1E) ^ (t1_159 >> 0x0D | t1_159 << 0x13) ^ (t1_159 << 0x0A | t1_159 >> 22)) + ((a6_123 | t1_159) & a2_101 | a6_123 & t1_159) + t5_180;
		uint32 a2_236 = a2_101 + t5_218;
		uint32 t5_256 = ((a2_236 >> 0x06 | a2_236 << 0x1A) ^ (a2_236 >> 11 | a2_236 << 0x15) ^ (a2_236 << 0x07 | a2_236 >> 0x19)) + ((a5_121 + (t4_71->dwFFFFFFF0 + t6_70->dwFFFFFFF0)) + ((a4_160 ^ a3_198) & a2_236 ^ a4_160));
		uint32 a7_235 = ((a1_197 >> 0x02 | a1_197 << 0x1E) ^ (a1_197 >> 0x0D | a1_197 << 0x13) ^ (a1_197 << 0x0A | a1_197 >> 22)) + ((t1_159 | a1_197) & a6_123 | t1_159 & a1_197) + t5_218;
		a6_274 = a6_123 + t5_256;
		word32 t5_294 = ((a6_274 >>u 0x06 | a6_274 << 0x1A) ^ (a6_274 >>u 11 | a6_274 << 0x15) ^ (a6_274 << 0x07 | a6_274 >>u 0x19)) + ((a4_160 + (Mem57[t4_71 + -0x0C:int32] + Mem57[t6_70 + -0x0C:int32])) + ((a3_198 ^ a2_236) & a6_274 ^ a3_198));
		a5_120 = ((a7_235 >> 0x02 | a7_235 << 0x1E) ^ (a7_235 >> 0x0D | a7_235 << 0x13) ^ (a7_235 << 0x0A | a7_235 >> 22)) + ((a1_197 | a7_235) & t1_159 | a1_197 & a7_235) + t5_256;
		t1 = t1_159 + t5_294;
		uint32 t5_332 = ((t1 >> 0x06 | t1 << 0x1A) ^ (t1 >> 11 | t1 << 0x15) ^ (t1 << 0x07 | t1 >> 0x19)) + ((a3_198 + (t4_71->dwFFFFFFF8 + t6_70->dwFFFFFFF8)) + ((a2_236 ^ a6_274) & t1 ^ a2_236));
		a4_116 = ((a5_120 >> 0x02 | a5_120 << 0x1E) ^ (a5_120 >> 0x0D | a5_120 << 0x13) ^ (a5_120 << 0x0A | a5_120 >> 22)) + ((a7_235 | a5_120) & a1_197 | a7_235 & a5_120) + t5_294;
		a1_350 = a1_197 + t5_332;
		uint32 t5_370 = ((a1_350 >> 0x06 | a1_350 << 0x1A) ^ (a1_350 >> 11 | a1_350 << 0x15) ^ (a1_350 << 0x07 | a1_350 >> 0x19)) + ((a2_236 + (t4_71->dwFFFFFFFC + t6_70->dwFFFFFFFC)) + ((a6_274 ^ t1) & a1_350 ^ a6_274));
		a3_113 = ((a4_116 >> 0x02 | a4_116 << 0x1E) ^ (a4_116 >> 0x0D | a4_116 << 0x13) ^ (a4_116 << 0x0A | a4_116 >> 22)) + ((a5_120 | a4_116) & a7_235 | a5_120 & a4_116) + t5_332;
		a7 = a7_235 + t5_370;
		a2_101 = ((a3_113 >> 0x02 | a3_113 << 0x1E) ^ (a3_113 >> 0x0D | a3_113 << 0x13) ^ (a3_113 << 0x0A | a3_113 >> 22)) + ((a4_116 | a3_113) & a5_120 | a4_116 & a3_113) + t5_370;
	} while (t4_71 != &g_t230C6CB0);
	do
	{
		Eq_503086 s5_403 = t3_401->dw0038;
		Eq_503090 t5_404 = t3_401->dw0004;
		uint32 t4_429 = ((s5_403 << 0x0F | s5_403 >> 0x11) ^ (s5_403 << 0x0D | s5_403 >> 0x13) ^ s5_403 >> 0x0A) + (t3_401->dw0024 + t3_401->dw0000) + (((t5_404 >> 0x07 | t5_404 << 0x19) ^ (t5_404 << 0x0E | t5_404 >> 0x12)) ^ t5_404 >> 0x03);
		uint32 a6_456 = a6_274 + ((((((a7 >> 0x06 | a7 << 0x1A) ^ (a7 >> 11 | a7 << 0x15)) ^ (a7 << 0x07 | a7 >> 0x19)) + ((t1 ^ a1_350) & a7 ^ t1)) + s1_448->dw0040) + t4_429);
		Eq_503160 s6_405 = t3_401->dw003C;
		Eq_503164 t6_486 = t3_401->dw0008;
		uint32 a5_484 = a5_120 + a6_456;
		word32 s0_498 = ((s6_405 << 0x0F | s6_405 >>u 0x11) ^ (s6_405 << 0x0D | s6_405 >>u 0x13) ^ s6_405 >>u 0x0A) + (t5_404 + Mem402[t3_401 + 40:int32]) + (((t6_486 >>u 0x07 | t6_486 << 0x19) ^ (t6_486 << 0x0E | t6_486 >>u 0x12)) ^ t6_486 >>u 0x03);
		Eq_503205 t5_517 = ((a7 ^ a1_350) & a5_484 ^ a1_350) + ((t1 + s1_448->dw0044) + s0_498) + (((a5_484 >> 0x06 | a5_484 << 0x1A) ^ (a5_484 >> 11 | a5_484 << 0x15)) ^ (a5_484 << 0x07 | a5_484 >> 0x19));
		Eq_503233 s7_452 = t3_401->dw000C;
		uint32 a6_485 = a6_456 + ((((a2_101 >> 0x02 | a2_101 << 0x1E) ^ (a2_101 >> 0x0D | a2_101 << 0x13)) ^ (a2_101 << 0x0A | a2_101 >> 22)) + ((a2_101 | a3_113) & a4_116 | a2_101 & a3_113));
		word32 a4_535 = a4_116 + t5_517;
		word32 t2_558 = ((t4_429 << 0x0F | t4_429 >>u 0x11) ^ (t4_429 << 0x0D | t4_429 >>u 0x13) ^ t4_429 >>u 0x0A) + (t6_486 + Mem402[t3_401 + 44:int32]) + (((s7_452 >>u 0x07 | s7_452 << 0x19) ^ (s7_452 << 0x0E | s7_452 >>u 0x12)) ^ s7_452 >>u 0x03);
		word32 t5_577 = ((a7 ^ a5_484) & a4_535 ^ a7) + ((a1_350 + Mem402[s1_448 + 72:int32]) + t2_558) + (((a4_535 >>u 0x06 | a4_535 << 0x1A) ^ (a4_535 >>u 11 | a4_535 << 0x15)) ^ (a4_535 << 0x07 | a4_535 >>u 0x19));
		t3_401->dw0044 = s0_498;
		Eq_503329 t5_606 = t3_401->dw0010;
		uint32 t1_534 = (word32) t5_517 + ((((a6_485 >> 0x02 | a6_485 << 0x1E) ^ (a6_485 >> 0x0D | a6_485 << 0x13)) ^ (a6_485 << 0x0A | a6_485 >> 22)) + ((a2_101 | a6_485) & a3_113 | a2_101 & a6_485));
		uint32 a3_605 = (word32) a3_113.u0 + t5_577;
		word32 t0_619 = ((s0_498 << 0x0F | s0_498 >>u 0x11) ^ (s0_498 << 0x0D | s0_498 >>u 0x13) ^ s0_498 >>u 0x0A) + (s7_452 + Mem600[t3_401 + 48:int32]) + (((t5_606 >>u 0x07 | t5_606 << 0x19) ^ (t5_606 << 0x0E | t5_606 >>u 0x12)) ^ t5_606 >>u 0x03);
		struct Eq_503394 * s1_618 = (t5_606 >> 0x03)->ptr004C;
		t3_401->dw0048 = (word32) t2_558;
		Eq_503402 s7_667 = t3_401->dw0014;
		uint32 t6_637 = ((a5_484 ^ a4_535) & a3_605 ^ a5_484) + (((word32) a7.u0 + (t5_606 >> 0x03)) + t0_619) + (((a3_605 >> 0x06 | a3_605 << 0x1A) ^ (a3_605 >> 11 | a3_605 << 0x15)) ^ (a3_605 << 0x07 | a3_605 >> 0x19));
		uint32 a1_604 = ((t1_534 >> 0x02 | t1_534 << 0x1E) ^ (t1_534 >> 0x0D | t1_534 << 0x13) ^ (t1_534 << 0x0A | t1_534 >> 22)) + ((a6_485 | t1_534) & a2_101 | a6_485 & t1_534) + t5_577;
		word32 t6_681 = ((t2_558 << 0x0F | t2_558 >>u 0x11) ^ (t2_558 << 0x0D | t2_558 >>u 0x13) ^ t2_558 >>u 0x0A) + (t5_606 + Mem663[t3_401 + 52:int32]) + (((s7_667 >>u 0x07 | s7_667 << 0x19) ^ (s7_667 << 0x0E | s7_667 >>u 0x12)) ^ s7_667 >>u 0x03);
		uint32 a2_655 = a2_101 + t6_637;
		uint32 t5_699 = ((a2_655 >> 0x06 | a2_655 << 0x1A) ^ (a2_655 >> 11 | a2_655 << 0x15) ^ (a2_655 << 0x07 | a2_655 >> 0x19)) + (((a4_535 ^ a3_605) & a2_655 ^ a4_535) + (a5_484 + (s1_618->dw0050 + t6_681)));
		Eq_503521 s0_720 = t3_401->dw0018;
		t3_401->dw004C = t0_619;
		uint32 a7_654 = ((a1_604 >> 0x02 | a1_604 << 0x1E) ^ (a1_604 >> 0x0D | a1_604 << 0x13) ^ (a1_604 << 0x0A | a1_604 >> 22)) + ((t1_534 | a1_604) & a6_485 | t1_534 & a1_604) + t6_637;
		word32 t5_740 = ((t0_619 << 0x0F | t0_619 >>u 0x11) ^ (t0_619 << 0x0D | t0_619 >>u 0x13) ^ t0_619 >>u 0x0A) + (s5_403 + s7_667) + (((s0_720 >>u 0x07 | s0_720 << 0x19) ^ (s0_720 << 0x0E | s0_720 >>u 0x12)) ^ s0_720 >>u 0x03);
		a6_274 = a6_485 + t5_699;
		word32 t0_758 = ((a6_274 >>u 0x06 | a6_274 << 0x1A) ^ (a6_274 >>u 11 | a6_274 << 0x15) ^ (a6_274 << 0x07 | a6_274 >>u 0x19)) + (((a3_605 ^ a2_655) & a6_274 ^ a3_605) + (a4_535 + (Mem724[s1_618 + 84:int32] + t5_740)));
		Eq_503613 t0_783 = t3_401->dw001C;
		t3_401->dw0050 = t6_681;
		a5_120 = ((a7_654 >> 0x02 | a7_654 << 0x1E) ^ (a7_654 >> 0x0D | a7_654 << 0x13) ^ (a7_654 << 0x0A | a7_654 >> 22)) + ((a1_604 | a7_654) & t1_534 | a1_604 & a7_654) + t5_699;
		word32 s6_800 = s6_405 + s0_720 + (((t6_681 << 0x0F | t6_681 >>u 0x11) ^ (t6_681 << 0x0D | t6_681 >>u 0x13)) ^ t6_681 >>u 0x0A) + (((t0_783 >>u 0x07 | t0_783 << 0x19) ^ (t0_783 << 0x0E | t0_783 >>u 0x12)) ^ t0_783 >>u 0x03);
		t1 = t1_534 + t0_758;
		uint32 t6_818 = ((t1 >> 0x06 | t1 << 0x1A) ^ (t1 >> 11 | t1 << 0x15) ^ (t1 << 0x07 | t1 >> 0x19)) + (((a2_655 ^ a6_274) & t1 ^ a2_655) + (a3_605 + ((word32) s6_800 + s1_618->dw0058)));
		Eq_503704 t2_842 = t3_401[1];
		t3_401->dw0054 = (word32) t5_740;
		t3_401[2] = (struct Eq_502621) t4_429;
		uint32 t4_861 = (word32) t0_783 + t4_429 + (((t5_740 << 0x0F | t5_740 >> 0x11) ^ (t5_740 << 0x0D | t5_740 >> 0x13)) ^ t5_740 >> 0x0A) + (((t2_842 >> 0x07 | t2_842 << 0x19) ^ (t2_842 << 0x0E | t2_842 >> 0x12)) ^ t2_842 >> 0x03);
		a1_350 = a1_604 + t6_818;
		uint32 a2_867 = a2_655 + (s1_618->dw005C + t4_861) + ((a6_274 ^ t1) & a1_350 ^ a6_274);
		t3_401->dw005C = t4_861;
		a4_116 = ((a5_120 >> 0x02 | a5_120 << 0x1E) ^ (a5_120 >> 0x0D | a5_120 << 0x13) ^ (a5_120 << 0x0A | a5_120 >> 22)) + ((a7_654 | a5_120) & a1_604 | a7_654 & a5_120) + t0_758;
		t3_401->dw0058 = (word32) s6_800;
		uint32 t4_880 = ((a1_350 >> 0x06 | a1_350 << 0x1A) ^ (a1_350 >> 11 | a1_350 << 0x15) ^ (a1_350 << 0x07 | a1_350 >> 0x19)) + a2_867;
		a3_113 = ((a4_116 >> 0x02 | a4_116 << 0x1E) ^ (a4_116 >> 0x0D | a4_116 << 0x13) ^ (a4_116 << 0x0A | a4_116 >> 22)) + ((a5_120 | a4_116) & a7_654 | a5_120 & a4_116) + t6_818;
		++t3_401;
		a7 = a7_654 + t4_880;
		a2_101 = ((a3_113 >> 0x02 | a3_113 << 0x1E) ^ (a3_113 >> 0x0D | a3_113 << 0x13) ^ (a3_113 << 0x0A | a3_113 >> 22)) + ((a4_116 | a3_113) & a5_120 | a4_116 & a3_113) + t4_880;
		s1_448 = (struct Eq_502627 *) ((char *) s1_618 + 32);
	} while (dwLoc0148 + 6 != t3_401);
	do
	{
		++s2_9;
		s2_9[0x03FF] = (struct Eq_502553) (s2_9->dw0000 + *s3_10);
		++s3_10;
	} while (a0 + 40 != s2_9);
	a3Out = a3_113;
	a7Out = a7;
	return t1;
}

// 2308A7A8: Register uint32 mbedtls_sha256_update.part.0(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_493410) a3, Register (ptr32 word32) a5, Register Eq_502550 a7, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_493410) a3Out, Register out Eq_503887 a5Out, Register out Eq_502550 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out)
// Called from:
//      mbedtls_sha256_update
//      sha224_finish_wrap
uint32 mbedtls_sha256_update.part.0(uint32 t1, Eq_2 a1, Eq_2 a2, struct Eq_493410 * a3, word32 * a5, Eq_502550 a7, Eq_2 dwArg48, word32 dwArgA8, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a2Out, struct Eq_493410 & a3Out, union Eq_503887 & a5Out, union Eq_502550 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out)
{
	word32 a0_21 = *a5;
	word32 a5_27 = a5 + a2;
	*a5_27 = a0_21;
	Eq_2 s2_24 = a1;
	ui32 s3_139 = a5 & 63;
	Eq_2 s0_29 = a2;
	if (a5_27 < a2)
		*((word32) a5_27 + 5) = *((word32) a5_27 + 4);
	if ((a5 & 63) != 0x00)
	{
		Eq_2 s4_35 = 64 - (a5 & 63);
		if (a2 >= s4_35)
		{
			s0_29 = (word32) (a5 & 63) + ((word32) a2 - 64);
			word32 a1_265;
			word32 a2_266;
			Eq_502550 a7_45;
			struct Eq_493410 * a3_48;
			word32 a4_267;
			word32 a5_268;
			word32 a6_269;
			t1 = mbedtls_sha256_process(memcpy(a0_21 + 40 + (a5 & 63), a1, s4_35, out a1_265, out a2_266, out a3_48, out a4_267, out a5_268, out a6_269, out a7_45), a0_21, a0_21 + 40, a3_48, a7_45, out a3, out a7);
			s2_24 = a1 + s4_35;
			s3_139 = 0x00;
		}
	}
	Eq_2 s4_108 = s0_29;
	word32 s6_81 = s2_24 + s0_29;
	while (true)
	{
		struct Eq_502548 * a1_85 = s6_81 - s4_108;
		if (s4_108 <= 63)
			break;
		t1 = mbedtls_sha256_process(t1, a0_21, a1_85, a3, a7, out a3, out a7);
		s4_108 = (word32) s4_108 - 64;
	}
	uint32 a2_110 = s0_29 >> 0x06;
	Eq_2 a1_115 = (word32) s2_24 + (a2_110 << 0x06);
	if ((word32) s0_29 + (a2_110 + -64) == 0x00)
	{
		0x00 = dwArgA8;
		s0Out.u0 = <invalid>;
		s1Out.u0 = <invalid>;
		a2Out = dwArg48;
		a3Out = a3;
		a5Out.u0 = -64;
		a7Out = a7;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		return t1;
	}
	else
	{
		0x00 = dwArgA8;
		Eq_2 a0_140 = a0_21 + 40 + s3_139;
		Eq_503887 a5_144;
		Eq_502550 a7_145;
		Eq_2 a2_147;
		struct Eq_493410 * a3_148;
		word32 a1_270;
		word32 a4_271;
		word32 a6_272;
		uint32 t1_151 = memcpy(a0_140, a1_115, dwArg48, out a1_270, out a2_147, out a3_148, out a4_271, out a5_144, out a6_272, out a7_145);
		s0Out.u0 = <invalid>;
		s1Out.u0 = <invalid>;
		a2Out = a2_147;
		a3Out = a3_148;
		a5Out = a5_144;
		a7Out = a7_145;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		return t1_151;
	}
}

// 2308A86A: Register uint32 mbedtls_sha256_update(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_493410) a3, Register (ptr32 word32) a5, Register Eq_502550 a7, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Register out Eq_2 a2Out, Register out (ptr32 Eq_493410) a3Out, Register out (ptr32 word32) a5Out, Register out Eq_502550 a7Out)
// Called from:
//      ssl_update_checksum_sha256
//      sha256_wrap
//      sha224_finish_wrap
//      sha224_update_wrap
uint32 mbedtls_sha256_update(uint32 t1, Eq_2 a1, Eq_2 a2, struct Eq_493410 * a3, word32 * a5, Eq_502550 a7, Eq_2 dwArg48, word32 dwArgA8, union Eq_2 & a2Out, struct Eq_493410 & a3Out, word32 & a5Out, union Eq_502550 & a7Out)
{
	if (a2 == 0x00)
	{
		a2Out = a2;
		a3Out = a3;
		a5Out = a5;
		a7Out = a7;
		return t1;
	}
	else
	{
		Eq_2 a2_12;
		struct Eq_493410 * a3_13;
		word32 * a5_15;
		Eq_502550 a7_17;
		word32 s0_83;
		word32 s1_84;
		word32 s2_85;
		word32 s3_86;
		word32 s5_87;
		uint32 t1_27 = mbedtls_sha256_update.part.0(t1, a1, a2, a3, a5, a7, dwArg48, dwArgA8, out s0_83, out s1_84, out a2_12, out a3_13, out a5_15, out a7_17, out s2_85, out s3_86, out s5_87);
		a2Out = a2_12;
		a3Out = a3_13;
		a5Out = a5_15;
		a7Out = a7_17;
		return t1_27;
	}
}

// 2308A872: Register (ptr32 Eq_504038) mbedtls_sha256_finish(Register uint32 t1, Register uint32 a2, Register ui32 a5, Register Eq_502550 a7, Stack Eq_2 dwArg28, Stack word32 dwArg88, Register out (ptr32 Eq_504045) s1Out, Register out Eq_504046 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      sha256_wrap
//      sha224_finish_wrap
struct Eq_504038 * mbedtls_sha256_finish(uint32 t1, uint32 a2, ui32 a5, Eq_502550 a7, Eq_2 dwArg28, word32 dwArg88, struct Eq_504045 & s1Out, union Eq_504046 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 * a5_43;
	ui32 a5_17 = a5 << 3 | a2 >> 0x1D;
	if ((a2 & 63) <= 55)
		a5_43 = (word32 *) 56;
	else
		a5_43 = (word32 *) 0x0078;
	struct Eq_493410 * a3_62;
	word32 * a5_64;
	Eq_502550 a7_66;
	struct Eq_504066 * s0_94;
	struct Eq_504045 * s1_95;
	ptr32 s2_96;
	ptr32 s3_97;
	ptr32 s5_99;
	word32 a7_242;
	word32 a5_241;
	word32 a3_240;
	word32 a2_239;
	word32 a2_238;
	mbedtls_sha256_update.part.0(mbedtls_sha256_update(t1, 588017008, a5_43 - (a2 & 63), a5_17 << 0x08, a5_43, a7, dwArg28, dwArg88, out a2_238, out a3_62, out a5_64, out a7_66), fp + ~0x17, 0x08, a3_62, a5_64, a7_66, dwArg28, dwArg88, out s0_94, out s1_95, out a2_239, out a3_240, out a5_241, out a7_242, out s2_96, out s3_97, out s5_99);
	s1_95->b0000 = (byte) (word32) s0_94->b000B;
	uint32 a5_112 = (word32) s0_94->w000A;
	s1_95->b0001 = (byte) a5_112;
	s1_95->b0002 = (byte) (a5_112 >> 8);
	struct Eq_504126 * s0_117 = (a5_112 >> 8)->ptr0008;
	s1_95->b0003 = (byte) (a5_112 >> 8);
	s1_95->b0004 = (byte) (word32) s0_117->b000F;
	uint32 a5_121 = (word32) s0_117->w000E;
	s1_95->b0005 = (byte) a5_121;
	s1_95->b0006 = (byte) (a5_121 >> 8);
	struct Eq_504159 * s0_126 = (a5_121 >> 8)->ptr000C;
	s1_95->b0007 = (byte) (a5_121 >> 8);
	s1_95->b0008 = (byte) (word32) s0_126->b0013;
	uint32 a5_130 = (word32) s0_126->w0012;
	s1_95->b0009 = (byte) a5_130;
	s1_95->b000A = (byte) (a5_130 >> 8);
	struct Eq_504192 * s0_135 = (a5_130 >> 8)->ptr0010;
	s1_95->b000B = (byte) (a5_130 >> 8);
	s1_95->b000C = (byte) (word32) s0_135->b0017;
	uint32 a5_139 = (word32) s0_135->w0016;
	s1_95->b000D = (byte) a5_139;
	s1_95->b000E = (byte) (a5_139 >> 8);
	struct Eq_504225 * s0_144 = (a5_139 >> 8)->ptr0014;
	s1_95->b000F = (byte) (a5_139 >> 8);
	s1_95->b0010 = (byte) (word32) s0_144->b001B;
	uint32 a5_148 = (word32) s0_144->w001A;
	s1_95->b0011 = (byte) a5_148;
	s1_95->b0012 = (byte) (a5_148 >> 8);
	struct Eq_504258 * s0_153 = (a5_148 >> 8)->ptr0018;
	s1_95->b0013 = (byte) (a5_148 >> 8);
	s1_95->b0014 = (byte) (word32) s0_153->b001F;
	uint32 a5_157 = (word32) s0_153->w001E;
	s1_95->b0015 = (byte) a5_157;
	s1_95->b0016 = (byte) (a5_157 >> 8);
	struct Eq_504291 * s0_162 = (a5_157 >> 8)->ptr001C;
	s1_95->b0017 = (byte) (a5_157 >> 8);
	s1_95->b0018 = (byte) (word32) s0_162->b0023;
	uint32 a5_166 = (word32) s0_162->w0022;
	s1_95->b0019 = (byte) a5_166;
	s1_95->b001A = (byte) (a5_166 >> 8);
	s1_95->b001B = (byte) (a5_166 >> 8);
	Eq_504046 a5_169 = a5_166 >> 8;
	struct Eq_504038 * s0_173 = (a5_166 >> 8)->ptr0068;
	if (a5_166 >> 8 == 0x00)
	{
		s1_95->b001C = (byte) (word32) s0_173->b0027;
		uint32 a5_176 = (word32) s0_173->w0026;
		s1_95->b001D = (byte) a5_176;
		s1_95->b001E = (byte) (a5_176 >> 8);
		s0_173 = (a5_176 >> 8)->ptr0024;
		s1_95->b001F = (byte) (a5_176 >> 8);
		a5_169 = a5_176 >> 8;
	}
	s1Out = s1_95;
	a5Out = a5_169;
	s2Out = s2_96;
	s3Out = s3_97;
	s4Out = dwArg04;
	s5Out = s5_99;
	return s0_173;
}

// 2308A9FE: void mbedtls_sha256(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_502550 a7, Register Eq_2 s2, Stack word32 dwArg08)
// Called from:
//      sha224_wrap
//      sha256_wrap
void mbedtls_sha256(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_502550 a7, Eq_2 s2, word32 dwArg08)
{
	struct Eq_493410 * a3_24;
	uint32 t1_29;
	word32 a4_108;
	word32 a5_109;
	mbedtls_sha256_init(ra, fp + -0x0084, out t1_29, out a3_24, out a4_108, out a5_109);
	uint32 a2_40;
	ui32 a5_43;
	Eq_502550 a7_45;
	word32 a3_110;
	word32 s1_111;
	word32 a5_112;
	word32 s2_113;
	word32 s3_114;
	word32 s4_115;
	word32 s5_116;
	mbedtls_sha256_finish(mbedtls_sha256_update(t1_29, a0, a1, a3_24, mbedtls_sha256_starts(fp + -0x0084, a3_24), a7, s2, dwArg08, out a2_40, out a3_110, out a5_43, out a7_45), a2_40, a5_43, a7_45, dwLoc78, dwLoc18, out s1_111, out a5_112, out s2_113, out s3_114, out s4_115, out s5_116);
	word32 a5_117;
	mbedtls_sha256_free(fp + -0x0084, out a5_117);
}

