pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308AA44: Register Eq_2 mbedtls_ssl_own_cert(Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_write_certificate
Eq_2 mbedtls_ssl_own_cert(Eq_2 a5, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		a5 = *((word32) a5 + 8);
		if (a5 != 0x00)
		{
l2308AA52:
			a5 = *a5;
l2308AA54:
			a5Out = a5;
			return a5;
		}
	}
	a5 = *((word32) a5 + 76);
	if (a5 == 0x00)
		goto l2308AA54;
	goto l2308AA52;
}

// 2308AA58: Register Eq_2 mbedtls_zeroize(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_transform_free
//      mbedtls_ssl_handshake_free
//      mbedtls_ssl_session_free
//      mbedtls_ssl_free
//      mbedtls_ssl_config_free
Eq_2 mbedtls_zeroize(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 != a1_5)
	{
		*a0 = 0x00;
		a0 = (word32) a0 + 1;
	}
	a1Out = a1_5;
	return a0;
}

// 2308AA68: Register (ptr32 Eq_504462) ssl_swap_epochs(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 Eq_504466) a1Out, Register out (ptr32 Eq_504467) a2Out, Register out (ptr32 Eq_504468) a3Out, Register out Eq_504469 a4Out, Register out Eq_504470 a5Out)
// Called from:
//      mbedtls_ssl_resend
struct Eq_504462 * ssl_swap_epochs(Eq_2 ra, Eq_2 a4, Eq_2 a5, struct Eq_504466 & a1Out, struct Eq_504467 & a2Out, struct Eq_504468 & a3Out, union Eq_504469 & a4Out, union Eq_504470 & a5Out)
{
	Eq_504470 a5_102;
	Eq_504469 a4_101;
	struct Eq_504468 * a3_100;
	struct Eq_504467 * a2_115;
	struct Eq_504466 * a1_114;
	Eq_2 a0_11 = *((word32) a4 + 56);
	Eq_2 a5_13 = *((word32) a5 + 0x0044);
	if (a4 == a5_13)
	{
		word32 a7_222;
		word32 s4_223;
		word32 s5_224;
		word32 s6_225;
		word32 s7_226;
		word32 s8_227;
		word32 s9_228;
		word32 s10_229;
		word32 s11_230;
		word32 t4_231;
		mbedtls_debug_print_msg(ra, a0_11, 0x03, &g_t230C8240, a5_13, out a1_114, out a2_115, out a3_100, out a4_101, out a5_102, out a7_222, out s4_223, out s5_224, out s6_225, out s7_226, out s8_227, out s9_228, out s10_229, out s11_230, out t4_231);
	}
	else
	{
		struct Eq_504485 * a3_25;
		struct Eq_504486 * a4_26;
		word32 s10_203;
		word32 s11_204;
		word32 s9_202;
		word32 s8_201;
		word32 s7_200;
		word32 s6_199;
		word32 s5_198;
		word32 s4_197;
		word32 a7_196;
		word32 a5_195;
		word32 a2_194;
		word32 a1_193;
		word32 t4_205;
		mbedtls_debug_print_msg(ra, a0_11, 0x03, &g_t230C825C, a5_13, out a1_193, out a2_194, out a3_25, out a4_26, out a5_195, out a7_196, out s4_197, out s5_198, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204, out t4_205);
		struct Eq_504540 * s0_41 = a4_26->ptr0038;
		word32 a5_43 = a3_25->dw0044;
		a3_25->ptr0038 = s0_41;
		a4_26->dw0044 = a5_43;
		struct Eq_504554 * a1_51;
		word32 a2_206;
		word32 a3_207;
		word32 a4_208;
		word32 a5_209;
		word32 a6_210;
		word32 a7_211;
		memcpy(fp + ~0x17, s0_41->t0090, 0x08, out a1_51, out a2_206, out a3_207, out a4_208, out a5_209, out a6_210, out a7_211);
		Eq_2 a0_62 = a1_51->ptr0030->t0090;
		word32 a1_212;
		word32 a2_213;
		word32 a3_214;
		word32 a4_215;
		word32 a5_216;
		word32 a6_217;
		word32 a7_218;
		memcpy(a0_62, (char *) &a1_51->ptr0030 + 24, 0x08, out a1_212, out a2_213, out a3_214, out a4_215, out a5_216, out a6_217, out a7_218);
		word32 a5_219;
		word32 a6_220;
		word32 a7_221;
		memcpy((word32) a0_62 + 72, fp + ~0x17, 0x08, out a1_114, out a2_115, out a3_100, out a4_101, out a5_219, out a6_220, out a7_221);
		s0 = a3_100->ptr0038;
		a5_102 = s0->t009C;
		if (a3_100 != null)
		{
			s0 = a2_115->ptr000C;
			a4_101.u0 = 0x01;
			if (a2_115 > (struct Eq_504467 *) 0x01)
			{
				a3_100 = (struct Eq_504468 *) *((word32) *(union Eq_2 *) 0x0D + 16);
				a4_101 = 0x01 - a3_100;
				a5_102 += a4_101;
			}
		}
		s0->t00A0 = a5_102;
	}
	a1Out = a1_114;
	a2Out = a2_115;
	a3Out = a3_100;
	a4Out = a4_101;
	a5Out = a5_102;
	return s0;
}

// 2308AB08: void ssl_calc_finished_tls_sha256(Register Eq_2 ra, Register (ptr32 Eq_504675) s1)
void ssl_calc_finished_tls_sha256(Eq_2 ra, struct Eq_504675 * s1)
{
	Eq_2 a0_18 = s1->t002C;
	uint32 a2_102;
	Eq_2 a5_33;
	word32 a4_276;
	word32 t1_274;
	word32 a3_275;
	Eq_2 ra_34 = mbedtls_sha256_init(ra, fp + -0x0094, out t1_274, out a3_275, out a4_276, out a5_33);
	word32 s10_287;
	word32 a1_48;
	word32 s5_56;
	word32 s9_286;
	word32 s7_284;
	word32 s8_285;
	word32 s4_282;
	word32 s6_283;
	word32 a5_280;
	word32 a7_281;
	word32 a3_278;
	word32 a4_279;
	word32 a2_277;
	word32 s11_288;
	word32 t4_289;
	mbedtls_debug_print_msg(ra_34, a0_18, 0x02, &g_t230C8114, a5_33, out a1_48, out a2_277, out a3_278, out a4_279, out a5_280, out a7_281, out s4_282, out s5_56, out s6_283, out s7_284, out s8_285, out s9_286, out s10_287, out s11_288, out t4_289);
	word32 a2_290;
	word32 a5_291;
	word32 a7_292;
	mbedtls_sha256_clone(fp + -0x0094, a1_48 + 80, out a2_290, out a5_291, out a7_292);
	ui32 a5_91;
	Eq_502550 a7_96;
	word32 a0_293;
	word32 a1_294;
	word32 a2_295;
	word32 a3_296;
	word32 a4_297;
	uint32 t1_98 = mbedtls_debug_print_buf(ra_34, 0x04, fp + -0x008C, out a0_293, out a1_294, out a2_295, out a3_296, out a4_297, out a5_91, out a7_96);
	if (s5_56 != 0x00)
		a2_102 = 588022020;
	else
		a2_102 = 588022004;
	struct Eq_504779 * a5_118;
	word32 s1_122;
	word32 s2_123;
	word32 s3_124;
	word32 s4_125;
	word32 s5_126;
	mbedtls_sha256_finish(t1_98, a2_102, a5_91, a7_96, dwLocA8, dwLoc48, out s1_122, out a5_118, out s2_123, out s3_124, out s4_125, out s5_126);
	Eq_2 s0_148;
	Eq_2 s3_149;
	Eq_2 ra_151;
	a5_118->ptr00D0();
	word32 a0_298;
	word32 a1_299;
	word32 a2_300;
	word32 a3_301;
	word32 a4_302;
	word32 a5_303;
	word32 a7_304;
	mbedtls_debug_print_buf(ra_151, 0x03, s3_149, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303, out a7_304);
	Eq_2 a5_200;
	mbedtls_sha256_free(fp - 0x0094, out a5_200);
	word32 a1_305;
	mbedtls_zeroize(fp - 0x00B4, 32, out a1_305);
	word32 a1_306;
	word32 a2_307;
	word32 a3_308;
	word32 a4_309;
	word32 a5_310;
	word32 a7_311;
	word32 s4_312;
	word32 s5_313;
	word32 s6_314;
	word32 s7_315;
	word32 s8_316;
	word32 s9_317;
	word32 s10_318;
	word32 s11_319;
	word32 t4_320;
	mbedtls_debug_print_msg(ra_151, s0_148, 0x02, &g_t230C8160, a5_200, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310, out a7_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_318, out s11_319, out t4_320);
}

// 2308AC06: void ssl_calc_verify_tls_sha256(Register Eq_2 ra, Register Eq_2 a0)
void ssl_calc_verify_tls_sha256(Eq_2 ra, Eq_2 a0)
{
	Eq_2 a5_22;
	word32 t1_156;
	word32 a3_157;
	word32 a4_158;
	Eq_2 ra_23 = mbedtls_sha256_init(ra, fp + -0x0084, out t1_156, out a3_157, out a4_158, out a5_22);
	word32 a1_35;
	word32 a2_159;
	word32 a3_160;
	word32 a4_161;
	word32 a5_162;
	word32 a7_163;
	word32 s4_164;
	word32 s5_165;
	word32 s6_166;
	word32 s7_167;
	word32 s8_168;
	word32 s9_169;
	word32 s10_170;
	word32 s11_171;
	word32 t4_172;
	mbedtls_debug_print_msg(ra_23, a0, 0x02, &g_t230C8174, a5_22, out a1_35, out a2_159, out a3_160, out a4_161, out a5_162, out a7_163, out s4_164, out s5_165, out s6_166, out s7_167, out s8_168, out s9_169, out s10_170, out s11_171, out t4_172);
	uint32 a2_56;
	ui32 a5_59;
	Eq_502550 a7_61;
	Eq_2 s2_80;
	word32 s1_173;
	word32 a5_174;
	word32 s3_175;
	word32 s4_176;
	word32 s5_177;
	Eq_2 s0_78 = mbedtls_sha256_finish(mbedtls_sha256_clone(fp + -0x0084, a1_35 + 80, out a2_56, out a5_59, out a7_61), a2_56, a5_59, a7_61, dwLoc68, dwLoc08, out s1_173, out a5_174, out s2_80, out s3_175, out s4_176, out s5_177);
	Eq_2 a5_103;
	word32 a0_178;
	word32 a1_179;
	word32 a2_180;
	word32 a3_181;
	word32 a4_182;
	word32 a7_183;
	mbedtls_debug_print_buf(ra_23, 0x03, s2_80, out a0_178, out a1_179, out a2_180, out a3_181, out a4_182, out a5_103, out a7_183);
	word32 a1_184;
	word32 a2_185;
	word32 a3_186;
	word32 a4_187;
	word32 a5_188;
	word32 a7_189;
	word32 s4_190;
	word32 s5_191;
	word32 s6_192;
	word32 s7_193;
	word32 s8_194;
	word32 s9_195;
	word32 s10_196;
	word32 s11_197;
	word32 t4_198;
	mbedtls_debug_print_msg(ra_23, s0_78, 0x02, &g_t230C81A8, a5_103, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a7_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
	word32 a5_199;
	mbedtls_sha256_free(fp + -0x0084, out a5_199);
}

// 2308AC92: Register Eq_2 ssl_flight_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_ssl_recv_flight_completed
//      mbedtls_ssl_handshake_free
Eq_2 ssl_flight_free(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	Eq_2 s0_11 = a0;
	while (s0_11 != 0x00)
	{
		Eq_2 a2_22;
		Eq_2 a5_25;
		Eq_2 s0_31;
		word32 s1_83;
		word32 a0_84;
		word32 a1_85;
		word32 a3_86;
		word32 a4_87;
		word32 a6_88;
		word32 s4_89;
		word32 t3_90;
		vPortFree(a0, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_31, out s1_83, out a0_84, out a1_85, out a2_22, out a3_86, out a4_87, out a5_25, out a6_88, out s4_89, out t3_90);
		word32 s0_91;
		word32 a1_92;
		word32 a6_93;
		word32 t3_94;
		vPortFree(s0_31, a2_22, a5_25, mstatus, dwArg0148, dwArg0188, out s0_91, out s1, out a0, out a1_92, out a2, out a3, out a4, out a5, out a6_93, out s4, out t3_94);
		s0_11 = s1;
	}
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s4Out = s4;
	return s1;
}

// 2308ACBA: Register Eq_2 ssl_append_key_cert(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out (ptr32 word32) s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_505076) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      mbedtls_ssl_conf_own_cert
Eq_2 ssl_append_key_cert(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_2 & s0Out, word32 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, struct Eq_505076 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 a0_40;
	ptr32 a3_24;
	struct Eq_505076 * a4_25;
	word32 * s1_30;
	ptr32 s2_31;
	ptr32 s3_32;
	word32 a1_131;
	word32 s4_132;
	word32 s8_133;
	Eq_2 a2_23;
	Eq_2 a5_26;
	Eq_2 s0_101;
	Eq_2 ra_28 = mycalloc(ra, a1, 0x01, 0x0C, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out s0_101, out s1_30, out a1_131, out a2_23, out a3_24, out a4_25, out a5_26, out s2_31, out s3_32, out s4_132, out s8_133);
	if (true)
	{
		*s1_30 = 0x01;
		((union Eq_2 *) 0x09)->u0 = 0x00;
		*((word32) a2 + 4) = 0x01;
		a2_23 = a2;
		s0_101 = *a5_26;
		if (a5_26 == 0x00)
			*(union Eq_2 *) 0x01 = s0_101;
		else
		{
			do
				a5_26 = a4_25->t0008;
			while (a4_25 != null);
			*(union Eq_2 *) 0x09 = a5_26;
		}
		a0_40 = 0x00;
	}
	else
		a0_40 = 0xF8000100;
	s0Out = s0_101;
	s1Out = s1_30;
	a0Out = a0_40;
	a2Out = a2_23;
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_26;
	s2Out = s2_31;
	s3Out = s3_32;
	return ra_28;
}

// 2308AD00: void ssl_update_checksum_start(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_493410) a3, Register (ptr32 word32) a5, Register Eq_502550 a7, Stack Eq_2 dwArg48, Stack word32 dwArgA8)
// Called from:
//      ssl_update_checksum_sha256
void ssl_update_checksum_start(uint32 t1, Eq_2 a1, Eq_2 a2, struct Eq_493410 * a3, word32 * a5, Eq_502550 a7, Eq_2 dwArg48, word32 dwArgA8)
{
	word32 a2_39;
	word32 a3_40;
	word32 a5_41;
	word32 a7_42;
	mbedtls_sha256_update(t1, a1, a2, a3, a5, a7, dwArg48, dwArgA8, out a2_39, out a3_40, out a5_41, out a7_42);
}

// 2308AD0A: void ssl_update_checksum_sha256(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_493410) a3, Register (ptr32 word32) a5, Register Eq_502550 a7, Stack Eq_2 dwArg48, Stack word32 dwArgA8)
void ssl_update_checksum_sha256(uint32 t1, Eq_2 a1, Eq_2 a2, struct Eq_493410 * a3, word32 * a5, Eq_502550 a7, Eq_2 dwArg48, word32 dwArgA8)
{
	ssl_update_checksum_start(t1, a1, a2, a3, a5, a7, dwArg48, dwArgA8);
}

// 2308AD0E: Register Eq_2 mbedtls_ssl_hdr_len.isra.1(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_flush_output
//      mbedtls_ssl_get_record_expansion
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_ssl_hdr_len.isra.1(Eq_2 a0, union Eq_2 & a5Out)
{
	if (((word32) *((word32) a0 + 116) & 0x02) == 0x00)
	{
		a5Out.u0 = <invalid>;
		return 0x05;
	}
	else
	{
		a5Out.u0 = <invalid>;
		return 0x0D;
	}
}

