pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308AD1E: Register Eq_2 ssl_set_timer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Register out Eq_2 s0Out, Register out (ptr32 Eq_505184) s1Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_505187) a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_recv_flight_completed
//      mbedtls_ssl_send_flight_completed
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_resend
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_read
Eq_2 ssl_set_timer(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a5, Eq_2 dwArg10, Eq_2 dwArg14, union Eq_2 & s0Out, struct Eq_505184 & s1Out, union Eq_2 & a1Out, ptr32 & a3Out, struct Eq_505187 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 a0_5 = *((word32) a5 + 72);
	if (a5 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	else
	{
		word32 a5_24;
		word32 a1_134;
		word32 a2_135;
		word32 a3_136;
		word32 a4_137;
		word32 a7_138;
		word32 s4_139;
		word32 s5_140;
		word32 s6_141;
		word32 s7_142;
		word32 s8_143;
		word32 s9_144;
		word32 s10_145;
		word32 s11_146;
		word32 t4_147;
		mbedtls_debug_print_msg(ra, a0_5, 0x03, &g_t230C822C, a1, out a1_134, out a2_135, out a3_136, out a4_137, out a5_24, out a7_138, out s4_139, out s5_140, out s6_141, out s7_142, out s8_143, out s9_144, out s10_145, out s11_146, out t4_147);
		Eq_2 a5_52;
		struct Eq_505187 * a4_53;
		struct Eq_505184 * s1_55;
		Eq_2 a1_56;
		ptr32 a3_57;
		Eq_2 s0_58;
		Eq_2 ra_59;
		word32 t1_60;
		word32 a7_62;
		ptr32 s10_63;
		ptr32 s11_64;
		ptr32 s4_65;
		ptr32 s5_66;
		ptr32 s6_67;
		ptr32 s7_68;
		word32 s8_69;
		ptr32 s9_70;
		word32 t0_71;
		word32 t3_72;
		word32 t4_73;
		(*((word32) a0_5 + 72))();
		s0Out = s0_58;
		s1Out = s1_55;
		a1Out = a1_56;
		a3Out = a3_57;
		a4Out = a4_53;
		a5Out = a5_52;
		s4Out = s4_65;
		s5Out = s5_66;
		s6Out = s6_67;
		s7Out = s7_68;
		s9Out = s9_70;
		s10Out = s10_63;
		s11Out = s11_64;
		return ra_59;
	}
}

// 2308AD62: Register Eq_2 ssl_check_timer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a5, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      mbedtls_ssl_fetch_input
Eq_2 ssl_check_timer(Eq_2 ra, Eq_2 s0, Eq_2 a5, ptr32 & a0Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	Eq_2 a0_5 = *((word32) a5 + 76);
	if (a5 != 0x00)
	{
		ptr32 a0_23;
		word32 a0_14;
		Eq_2 s0_16;
		Eq_2 ra_17;
		word32 a2_19;
		word32 a3_20;
		word32 a1_21;
		word32 a7_59;
		word32 s10_60;
		word32 s11_61;
		word32 s4_62;
		word32 s5_63;
		word32 s8_66;
		word32 s9_67;
		word32 t0_68;
		word32 t1_69;
		word32 t3_70;
		word32 t4_71;
		ptr32 a4_18;
		ptr32 s6_107;
		ptr32 s7_110;
		a5();
		Eq_2 a5_22 = 0x02;
		if (a0_14 == 0x02)
		{
			word32 a1_139;
			word32 a2_140;
			word32 a3_141;
			word32 a7_142;
			word32 s4_143;
			word32 s5_144;
			word32 s8_145;
			word32 s9_146;
			word32 s10_147;
			word32 s11_148;
			word32 t4_149;
			mbedtls_debug_print_msg(ra_17, s0_16, 0x03, &g_t230C81B8, 0x02, out a1_139, out a2_140, out a3_141, out a4_18, out a5_22, out a7_142, out s4_143, out s5_144, out s6_107, out s7_110, out s8_145, out s9_146, out s10_147, out s11_148, out t4_149);
			a0_23 = ~0x00;
		}
		else
			a0_23 = 0x00;
		a0Out = a0_23;
		a4Out = a4_18;
		a5Out = a5_22;
		s6Out = s6_107;
		s7Out = s7_110;
		return ra_17;
	}
	else
	{
		a0Out = 0x00;
		a4Out = a4;
		a5Out = a5;
		s6Out = s6;
		s7Out = s7;
		return ra;
	}
}

// 2308ADA6: void tls_prf_sha256(Register Eq_2 ra, Register (ptr32 Eq_505346) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack ptr32 dwArg20, Stack word32 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68)
void tls_prf_sha256(Eq_2 ra, struct Eq_505346 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, ptr32 mstatus, ptr32 dwArg20, word32 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68)
{
	word32 a3_465;
	word32 a4_466;
	word32 a5_467;
	Eq_2 ra_49 = mbedtls_md_init(ra, fp + -220, out a3_465, out a4_466, out a5_467);
	word32 a5_468;
	Eq_2 a0_53 = mbedtls_md_info_from_type(0x06, out a5_468);
	if (a0_53 != 0x00)
	{
		Eq_2 a0_58 = mbedtls_md_get_size(a0_53);
		word32 a1_469;
		word32 a2_470;
		word32 a3_471;
		word32 a5_473;
		word32 a4_472;
		if (strlen(a2, out a1_469, out a2_470, out a3_471, out a4_472, out a5_473) + a4 + a0_58 <=u 0x0080)
		{
			word32 a1_474;
			word32 a3_476;
			word32 a4_477;
			word32 a2_475;
			word32 a5_478;
			Eq_2 a0_73 = strlen(a2, out a1_474, out a2_475, out a3_476, out a4_477, out a5_478);
			word32 a6_484;
			word32 a1_479;
			word32 a2_480;
			word32 a3_481;
			word32 a4_482;
			word32 a5_483;
			word32 a7_485;
			memcpy(fp + -0x00B0 + a0_58, a2, a0_73, out a1_479, out a2_480, out a3_481, out a4_482, out a5_483, out a6_484, out a7_485);
			Eq_2 a4_103;
			Eq_2 a5_104;
			Eq_2 a3_108;
			word32 a6_488;
			word32 a1_486;
			word32 a7_489;
			word32 a2_487;
			memcpy(a0_58 + a0_73 + (fp + -0x00B0), a3, a4, out a1_486, out a2_487, out a3_108, out a4_103, out a5_104, out a6_488, out a7_489);
			word32 a0_120;
			Eq_2 a4_124;
			Eq_2 a5_125;
			ptr32 mstatus_127;
			Eq_2 s2_130;
			Eq_505453 s4_132;
			Eq_2 s8_133;
			word32 s3_493;
			word32 s1_490;
			word32 a2_491;
			word32 a3_492;
			word32 ra_128 = mbedtls_md_setup(ra_49, a2, a0_58, fp + -220, a0_53, 0x01, a3_108, a4_103, a5_104, a4, mstatus, dwLocD0, dwLocCC, dwLocA8, dwArg28, dwArg68, out s1_490, out a0_120, out a2_491, out a3_492, out a4_124, out a5_125, out s2_130, out s3_493, out s4_132, out s8_133, out mstatus_127);
			if (a0_120 == 0x00)
			{
				word32 s0_145;
				Eq_2 s4_146;
				struct Eq_505483 * a4_151;
				Eq_2 a5_152;
				Eq_2 s1_154;
				word32 s2_155;
				word32 s3_156;
				ptr32 a4_165;
				struct Eq_505489 * a5_166;
				word32 s2_178;
				word32 a0_497;
				word32 a2_494;
				word32 s8_495;
				word32 a0_496;
				Eq_2 s1_177;
				Eq_2 a5_174;
				Eq_2 a4_173;
				Eq_2 a2_172;
				struct Eq_505499 * a1_171;
				word32 ra_175 = mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_starts(ra_128, fp + -220, a0, s8_133, a4_124, a5_125, s2_130, s4_132, out s0_145, out s1_154, out a2_494, out a4_151, out a5_152, out s2_155, out s3_156, out s4_146, out s8_495), fp + -220, a4_151, a5_152, dwLocD0, out a0_496, out a4_165, out a5_166), s0_145, s1_154, fp + -220, fp + -0x00B0, a4_165, a5_166, s2_155 + s3_156, dwArg20, dwArg24, dwArg48, out s1_177, out a0_497, out a1_171, out a2_172, out a4_173, out a5_174, out s2_178);
				Eq_2 s3_180 = 0x00;
				Eq_2 s2_181 = (word32) s1_177 + s2_178;
				while (s3_180 < s4_146)
				{
					struct Eq_505483 * a4_194;
					Eq_2 a5_195;
					word32 s0_197;
					ptr32 a4_205;
					struct Eq_505489 * a5_206;
					struct Eq_505499 * a1_212;
					Eq_2 a5_215;
					Eq_2 s1_218;
					Eq_2 s2_219;
					struct Eq_505483 * a4_227;
					Eq_2 a5_228;
					word32 s0_230;
					ptr32 a4_236;
					struct Eq_505489 * a5_237;
					word32 a2_500;
					word32 a0_499;
					word32 a0_498;
					word32 a4_501;
					word32 a0_502;
					word32 a0_503;
					word32 a4_504;
					word32 a5_505;
					ra_175 = mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_reset(mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_reset(ra_175, fp + -220, a1_171, a5_174, out s0_197, out a4_194, out a5_195), fp + -220, a4_194, a5_195, dwLocD0, out a0_498, out a4_205, out a5_206), s0_197, s1_177, fp + -220, fp + -0x00D0, a4_205, a5_206, s2_181, dwArg20, dwArg24, dwArg48, out s1_218, out a0_499, out a1_212, out a2_500, out a4_501, out a5_215, out s2_219), fp + -220, a1_212, a5_215, out s0_230, out a4_227, out a5_228), fp + -220, a4_227, a5_228, dwLocD0, out a0_502, out a4_236, out a5_237), s0_230, s1_218, fp + -220, fp + -0x00B0, a4_236, a5_237, s2_219, dwArg20, dwArg24, dwArg48, out s1_177, out a0_503, out a1_171, out a2_172, out a4_504, out a5_505, out s2_181);
					a4_173 = s1_177 + s3_180;
					Eq_2 a3_252 = s1_177;
					if (s4_146 < a4_173)
						a3_252 = s4_146 & s1_177;
					a5_174.u0 = 0x00;
					word32 s3_258 = (word32) s3_180 + a5;
					for (; a5_174 != a3_252; ++a5_174)
					{
						a1_171 = CONVERT(Mem264[fp + -0x00D0 + a5_174:byte], byte, word32);
						a2_172 = (byte) a5_174.u0 + s3_258;
						*a2_172 = (byte) a1_171;
					}
					s3_180 = a4_173;
				}
				word32 a5_506;
				mbedtls_md_free(ra_175, fp + -220, a2_172, a4_173, a5_174, mstatus_127, out a5_506);
				word32 a1_507;
				mbedtls_zeroize(fp + -0x00B0, 0x0080, out a1_507);
				word32 a1_508;
				mbedtls_zeroize(fp + -0x00D0, 32, out a1_508);
			}
		}
	}
}

