pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308AEF8: void mbedtls_ssl_derive_keys(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_505712) s1, Register Eq_2 a5, Register ptr32 mstatus)
void mbedtls_ssl_derive_keys(Eq_2 ra, Eq_2 s0, struct Eq_505712 * s1, Eq_2 a5, ptr32 mstatus)
{
	struct Eq_274 * a4_936;
	Eq_2 a5_937;
	Eq_2 a0_30 = s1->t0040;
	struct Eq_505721 * a5_42;
	struct Eq_505722 * a4_46;
	word32 s11_49;
	struct Eq_505724 * s4_50;
	word32 s6_52;
	word32 a1_1286;
	word32 s5_1290;
	word32 s7_1291;
	word32 s8_1292;
	word32 s10_1294;
	word32 t4_1295;
	word32 s9_1293;
	word32 a3_1288;
	word32 a7_1289;
	word32 a2_1287;
	mbedtls_debug_print_msg(ra, a0_30, 0x02, &g_t230C6DCC, a5, out a1_1286, out a2_1287, out a3_1288, out a4_46, out a5_42, out a7_1289, out s4_50, out s5_1290, out s6_52, out s7_1291, out s8_1292, out s9_1293, out s10_1294, out s11_49, out t4_1295);
	struct Eq_505755 * a5_64;
	word32 a0_62 = mbedtls_cipher_info_from_type((word32) a5_42->b0008, a4_46, out a5_64);
	ptr32 sp_119 = fp + -400;
	Eq_2 s2_121 = a0_30;
	word32 s1_124 = a5_64->dw0000;
	if (a0_62 == 0x00)
	{
		a5_937 = (word32) a5_64->b0008;
		a4_936 = (struct Eq_274 *) &g_t230C6DDC;
		goto l2308AF72;
	}
	struct Eq_505779 * a5_69;
	Eq_2 a0_68 = mbedtls_md_info_from_type((word32) a5_64->b0009, out a5_69);
	if (a0_68 == 0x00)
	{
		a4_936 = (struct Eq_274 *) &g_t230C6DFC;
		a5_937 = (word32) a5_69->b0009;
l2308AF72:
		word32 a7_1301;
		word32 s7_1305;
		word32 s8_1306;
		word32 s9_1307;
		word32 s11_1309;
		word32 t4_1310;
		word32 s10_1308;
		word32 s5_1303;
		word32 s6_1304;
		word32 s4_1302;
		word32 a5_1300;
		word32 a4_1299;
		word32 a3_1298;
		word32 a1_1296;
		word32 a2_1297;
		mbedtls_debug_print_msg(ra, a0_30, 0x01, a4_936, a5_937, out a1_1296, out a2_1297, out a3_1298, out a4_1299, out a5_1300, out a7_1301, out s4_1302, out s5_1303, out s6_1304, out s7_1305, out s8_1306, out s9_1307, out s10_1308, out s11_1309, out t4_1310);
		return;
	}
	Eq_2 a5_431 = 0x03;
	if (*((word32) a0_30 + 0x0C) != 0x03)
	{
l2308B048:
		word32 a3_1451;
		word32 s4_1455;
		word32 s5_1456;
		word32 t4_1463;
		word32 s6_1457;
		word32 s8_1459;
		word32 s9_1460;
		word32 s10_1461;
		word32 s11_1462;
		word32 s7_1458;
		word32 a5_1453;
		word32 a7_1454;
		word32 a4_1452;
		word32 a2_1450;
		word32 a1_1449;
		mbedtls_debug_print_msg(ra, s2_121, 0x01, &g_t230C6E20, a5_431, out a1_1449, out a2_1450, out a3_1451, out a4_1452, out a5_1453, out a7_1454, out s4_1455, out s5_1456, out s6_1457, out s7_1458, out s8_1459, out s9_1460, out s10_1461, out s11_1462, out t4_1463);
		return;
	}
	Eq_2 a5_151;
	Eq_2 a3_153;
	word32 s11_132;
	Eq_2 s10_131;
	word32 s8_129;
	word32 s5_127;
	word32 s6_122;
	word32 s9_130;
	struct Eq_505848 * s4_126;
	Eq_2 s7_128;
	s4_50->ptr00D0 = &g_t2308ADA6;
	s4_50->dw00C8 = 587770886;
	s4_50->dw00CC = 0x2308AB08;
	Eq_2 a5_86 = s4_50->t0148;
	word32 s3_125 = s6_52;
	if (a5_86 != 0x00)
	{
		word32 a3_1320;
		word32 a4_1321;
		word32 a5_1322;
		word32 t4_1324;
		word32 a7_1323;
		word32 a1_1318;
		word32 a2_1319;
		mbedtls_debug_print_msg(ra, a0_30, 0x03, &g_t230C6E5C, a5_86, out a1_1318, out a2_1319, out a3_1320, out a4_1321, out a5_1322, out a7_1323, out s4_126, out s5_127, out s6_122, out s7_128, out s8_129, out s9_130, out s10_131, out s11_132, out t4_1324);
	}
	else
	{
		word32 a5_1316;
		word32 a7_1317;
		word32 a4_1315;
		word32 a3_1314;
		word32 a2_1313;
		word32 a0_1311;
		word32 a1_1312;
		mbedtls_debug_print_buf(ra, 0x03, (char *) &s4_50->ptr00D0 + 72, out a0_1311, out a1_1312, out a2_1313, out a3_1314, out a4_1315, out a5_1316, out a7_1317);
		Eq_2 a0_133;
		word32 tp_1022;
		word32 t6_1020;
		word32 t5_1019;
		s4_50->ptr00D0();
		s0 = a0_133;
		if (a0_133 != 0x00)
		{
			a5_151 = a0_133;
			a3_153.u0 = 629;
			goto l2308B0B0;
		}
		word32 a1_1391;
		mbedtls_zeroize(s10_131, 48, out a1_1391);
	}
	word32 a7_1331;
	word32 a6_1330;
	word32 a5_1329;
	word32 a4_1328;
	word32 a1_1325;
	word32 a2_1326;
	word32 a3_1327;
	memcpy(sp_119 + 16, s7_128, 64, out a1_1325, out a2_1326, out a3_1327, out a4_1328, out a5_1329, out a6_1330, out a7_1331);
	word32 a4_1335;
	word32 a5_1336;
	word32 a6_1337;
	word32 a7_1338;
	word32 a2_1333;
	word32 a3_1334;
	word32 a1_1332;
	memcpy(s7_128, sp_119 + 48, 32, out a1_1332, out a2_1333, out a3_1334, out a4_1335, out a5_1336, out a6_1337, out a7_1338);
	word32 a7_1345;
	word32 a6_1344;
	word32 a5_1343;
	word32 a1_1339;
	word32 a2_1340;
	word32 a3_1341;
	word32 a4_1342;
	memcpy((char *) &s4_126->ptr00D0 + 40, sp_119 + 16, 32, out a1_1339, out a2_1340, out a3_1341, out a4_1342, out a5_1343, out a6_1344, out a7_1345);
	word32 a1_1346;
	mbedtls_zeroize(sp_119 + 16, 64, out a1_1346);
	struct Eq_505989 * sp_256;
	Eq_2 s1_261;
	struct Eq_505993 ** s11_269;
	Eq_2 a0_270;
	struct Eq_505993 * a4_271;
	word32 t5_282;
	word32 t6_283;
	word32 tp_1024;
	s4_126->ptr00D0();
	Eq_2 s0_284 = a0_270;
	if (a0_270 != 0x00)
	{
		a5_151 = a0_270;
		a3_153.u0 = 662;
		goto l2308B126;
	}
	int32 a4_432;
	Eq_2 s1_418;
	struct Eq_506005 * s5_306;
	Eq_2 s7_308;
	Eq_2 s8_309;
	Eq_2 s9_310;
	word32 a4_1350;
	word32 a5_1351;
	word32 a7_1352;
	word32 s6_1354;
	word32 s10_1355;
	word32 s11_1356;
	word32 t4_1357;
	word32 s4_1353;
	word32 a2_1348;
	word32 a3_1349;
	word32 a1_1347;
	mbedtls_debug_print_msg(ra, s2_121, 0x03, &g_t230C6E8C, mbedtls_ssl_get_ciphersuite_name(*s11_269, a4_271), out a1_1347, out a2_1348, out a3_1349, out a4_1350, out a5_1351, out a7_1352, out s4_1353, out s5_306, out s6_1354, out s7_308, out s8_309, out s9_310, out s10_1355, out s11_1356, out t4_1357);
	word32 a3_1361;
	word32 a5_1363;
	word32 a7_1364;
	word32 a4_1362;
	word32 a2_1360;
	word32 a1_1359;
	word32 a0_1358;
	mbedtls_debug_print_buf(ra, 0x03, s9_310, out a0_1358, out a1_1359, out a2_1360, out a3_1361, out a4_1362, out a5_1363, out a7_1364);
	word32 a0_1365;
	word32 a1_1366;
	word32 a2_1367;
	word32 a4_1369;
	word32 a5_1370;
	word32 a7_1371;
	word32 a3_1368;
	mbedtls_debug_print_buf(ra, 0x04, s7_308, out a0_1365, out a1_1366, out a2_1367, out a3_1368, out a4_1369, out a5_1370, out a7_1371);
	Eq_2 a3_365;
	Eq_2 a4_366;
	word32 a7_1376;
	word32 a5_1375;
	word32 a2_1374;
	word32 a1_1373;
	word32 a0_1372;
	mbedtls_debug_print_buf(ra, 0x04, (char *) &sp_256->t0038 + 24, out a0_1372, out a1_1373, out a2_1374, out a3_365, out a4_366, out a5_1375, out a7_1376);
	word32 a1_1377;
	mbedtls_zeroize(s7_308, 64, out a1_1377);
	(s5_306->t0004 >> 3)->t0004 = s1_261;
	Eq_2 a5_381 = (word32) s5_306->b0001 + ~0x05 & 0x00FD;
	if (a5_381 != 0x00)
	{
		Eq_2 a0_387;
		Eq_2 a3_390;
		Eq_2 a4_391;
		Eq_2 a5_392;
		ptr32 mstatus_394;
		Eq_2 s1_396;
		Eq_2 s2_397;
		Eq_2 s8_400;
		word32 s3_1393;
		word32 s4_1394;
		word32 a2_1392;
		ra = mbedtls_md_setup(ra, a0_270, s1_261, (word32) s1_261 + 56, s8_309, 0x01, a3_365, a4_366, a5_381, s2_121, mstatus, sp_256->t0010, sp_256->t0014, sp_256->t0038, sp_256->t0108, sp_256->t0148, out s1_396, out a0_387, out a2_1392, out a3_390, out a4_391, out a5_392, out s2_397, out s3_1393, out s4_1394, out s8_400, out mstatus_394);
		s0_284 = a0_387;
		if (a0_387 == 0x00)
		{
			Eq_2 a0_409;
			Eq_2 s8_422;
			word32 a4_1421;
			word32 mstatus_1425;
			word32 s3_1423;
			word32 s4_1424;
			word32 a5_1422;
			word32 a3_1420;
			word32 a2_1419;
			ra = mbedtls_md_setup(ra, a0_387, s1_396, (word32) s1_396 + 0x0044, s8_400, 0x01, a3_390, a4_391, a5_392, s2_397, mstatus_394, sp_256->t0010, sp_256->t0014, sp_256->t0038, sp_256->t0108, sp_256->t0148, out s1_418, out a0_409, out a2_1419, out a3_1420, out a4_1421, out a5_1422, out s2_121, out s3_1423, out s4_1424, out s8_422, out mstatus_1425);
			s0_284 = a0_409;
			if (a0_409 == 0x00)
			{
				Eq_2 a0_429 = mbedtls_md_get_size(s8_422);
				*((word32) a0_429 + 20) = s1_418;
				a5_431 = s5_306->t000C;
				*((word32) a5_431 + 0x0C) = s1_418;
				a4_432 = 0x07;
				if ((word32) s5_306->b0001 == 0x07)
				{
					*((word32) a0_429 + 8) = s1_418;
					goto l2308B230;
				}
				int32 a3_435 = s5_306->dw0014;
				struct Eq_506464 * a0_439 = (word32) a0_429 + a3_435 - (a0_429 & a3_435);
				a0_439->t0008 = s1_418;
				Eq_2 a4_441 = *((word32) s2_121 + 0x0C);
				a4_432 = (word32) a4_441 - 2;
				if (a4_441 > ~0x02)
					goto l2308B310;
				a5_431 += a0_439;
l2308B1E2:
				*((word32) a5_431 + 8) = s1_418;
l2308B230:
				Eq_2 a4_561;
				Eq_505453 s4_531;
				struct Eq_505346 * s7_532;
				Eq_2 a2_565;
				sp_256->dw0000 = a4_432;
				word32 a1_499;
				struct Eq_506254 * s5_507;
				word32 s11_1406;
				word32 t4_1407;
				word32 s10_1405;
				word32 a2_1395;
				word32 a3_1396;
				word32 s9_1404;
				word32 s8_1403;
				word32 a4_1397;
				word32 a7_1399;
				word32 s4_1400;
				word32 s6_1401;
				word32 s7_1402;
				word32 a5_1398;
				mbedtls_debug_print_msg(ra, s2_121, 0x03, &g_t230C6ED0, a5_431, out a1_499, out a2_1395, out a3_1396, out a4_1397, out a5_1398, out a7_1399, out s4_1400, out s5_507, out s6_1401, out s7_1402, out s8_1403, out s9_1404, out s10_1405, out s11_1406, out t4_1407);
				struct Eq_506287 * a5_516 = *s2_121;
				word32 s1_523 = a5_516->dw0014;
				if (((word32) a5_516->w0074 & 0x01) == 0x00)
				{
					s4_531 = (a5_516 << 0x01) + a1_499 + (sp_256 + 80);
					word32 a1_592;
					word32 a4_1410;
					word32 a5_1411;
					word32 a6_1412;
					word32 a7_1413;
					word32 a2_1408;
					word32 a3_1409;
					memcpy(s1_523 + 24, (word32) s4_531.u0 + a1_499, s0_284, out a1_592, out a2_1408, out a3_1409, out a4_1410, out a5_1411, out a6_1412, out a7_1413);
					word32 a7_1418;
					word32 a1_1414;
					word32 a3_1415;
					word32 a5_1416;
					word32 a6_1417;
					memcpy(s1_523 + 40, (word32) s4_531.u0 + ((word32) s0_284 + a1_592), s0_284, out a1_1414, out a2_565, out a3_1415, out a4_561, out a5_1416, out a6_1417, out a7_1418);
					s7_532 = sp_256 + 80;
				}
				else
				{
					word32 s6_530 = (a5_516 << 0x01) + a1_499 + (sp_256 + 80);
					s4_531 = (a5_516 << 0x01) + (sp_256 + 80);
					s7_532 = sp_256 + 80 + a5_516;
					word32 a1_544;
					word32 a2_1426;
					word32 a3_1427;
					word32 a5_1429;
					word32 a6_1430;
					word32 a7_1431;
					word32 a4_1428;
					memcpy(s1_523 + 40, a1_499 + s6_530, s0_284, out a1_544, out a2_1426, out a3_1427, out a4_1428, out a5_1429, out a6_1430, out a7_1431);
					word32 a7_1436;
					word32 a6_1435;
					word32 a5_1434;
					word32 a3_1433;
					word32 a1_1432;
					memcpy(s1_523 + 24, (word32) s0_284 + a1_544 + s6_530, s0_284, out a1_1432, out a2_565, out a3_1433, out a4_561, out a5_1434, out a6_1435, out a7_1436);
				}
				a5_431 = *((word32) s2_121 + 0x0C);
				if (a5_431 > 0x00)
				{
					Eq_2 a2_681;
					Eq_505453 s4_684;
					struct Eq_505346 * s8_685;
					Eq_2 a4_689;
					Eq_2 a5_690;
					Eq_2 s2_693;
					word32 s1_712;
					Eq_2 s2_713;
					Eq_2 a0_723;
					word32 s1_731;
					word32 s0_1440;
					word32 a2_1441;
					word32 a5_1448;
					word32 a4_1442;
					word32 s3_1444;
					word32 s4_1445;
					word32 s8_1446;
					word32 a4_1447;
					word32 a5_1443;
					word32 s1_1438;
					word32 s3_1439;
					word32 s0_1437;
					ra = mbedtls_cipher_setup(mbedtls_md_hmac_starts(mbedtls_md_hmac_starts(ra, (word32) *((word32) a2_565 + 20) + 56, s7_532, a2_565, a4_561, a5_431, s2_121, s4_531, out s0_1437, out s1_1438, out a2_681, out a4_689, out a5_690, out s2_693, out s3_1439, out s4_684, out s8_685), (word32) *((word32) a2_681 + 20) + 0x0044, s8_685, a2_681, a4_689, a5_690, s2_693, s4_684, out s0_1440, out s1_712, out a2_1441, out a4_1442, out a5_1443, out s2_713, out s3_1444, out s4_1445, out s8_1446), s1_712 + 80, s5_507, out s1_731, out a0_723, out a4_1447, out a5_1448);
					if (a0_723 != 0x00)
					{
						a5_151 = a0_723;
						a3_153.u0 = 877;
					}
					else
					{
						Eq_2 a0_738;
						struct Eq_506564 * a4_743;
						struct Eq_506565 * a5_744;
						Eq_2 s1_746;
						ra = mbedtls_cipher_setup(ra, s1_731 + 144, s5_507, out s1_746, out a0_738, out a4_743, out a5_744);
						if (a0_738 != 0x00)
						{
							a5_151 = a0_738;
							a3_153.u0 = 884;
						}
						else
						{
							struct Eq_506564 * a4_759;
							struct Eq_506565 * a5_760;
							Eq_2 a0_756 = mbedtls_cipher_setkey(s1_712 + 80, s5_507->ptr0004, 0x01, a4_743, a5_744, out a4_759, out a5_760);
							if (a0_756 != 0x00)
							{
								a5_151 = a0_756;
								a3_153.u0 = 892;
							}
							else
							{
								word32 a5_1465;
								word32 a4_1464;
								Eq_2 a0_767 = mbedtls_cipher_setkey(s1_746, s5_507->ptr0004, 0x00, a4_759, a5_760, out a4_1464, out a5_1465);
								if (a0_767 == 0x00)
								{
									Eq_2 a5_775 = 0x02;
									if ((word32) s5_507->b0001 == 0x02)
									{
										struct Eq_506521 * a5_780;
										word32 a4_1482;
										Eq_2 a0_778 = mbedtls_cipher_set_padding_mode(s1_712 + 80, 0x04, (struct Eq_506521 *) 0x02, out a4_1482, out a5_780);
										if (a0_778 != 0x00)
										{
											word32 a1_1484;
											word32 a2_1485;
											word32 a3_1486;
											word32 a4_1487;
											word32 a5_1488;
											word32 s4_1489;
											word32 s5_1490;
											word32 s6_1491;
											word32 s7_1492;
											word32 s8_1493;
											word32 s9_1494;
											word32 s10_1495;
											word32 s11_1496;
											mbedtls_debug_print_ret(ra, 0x01, 910, a0_778, out a1_1484, out a2_1485, out a3_1486, out a4_1487, out a5_1488, out s4_1489, out s5_1490, out s6_1491, out s7_1492, out s8_1493, out s9_1494, out s10_1495, out s11_1496);
											return;
										}
										word32 a4_1483;
										Eq_2 a0_784 = mbedtls_cipher_set_padding_mode(s1_746, 0x04, a5_780, out a4_1483, out a5_775);
										if (a0_784 != 0x00)
										{
											word32 a1_1497;
											word32 a2_1498;
											word32 a3_1499;
											word32 a4_1500;
											word32 a5_1501;
											word32 s4_1502;
											word32 s5_1503;
											word32 s6_1504;
											word32 s7_1505;
											word32 s8_1506;
											word32 s9_1507;
											word32 s10_1508;
											word32 s11_1509;
											mbedtls_debug_print_ret(ra, 0x01, 917, a0_784, out a1_1497, out a2_1498, out a3_1499, out a4_1500, out a5_1501, out s4_1502, out s5_1503, out s6_1504, out s7_1505, out s8_1506, out s9_1507, out s10_1508, out s11_1509);
											return;
										}
									}
									word32 a1_1466;
									mbedtls_zeroize(sp_256 + 80, 0x0100, out a1_1466);
									word32 s8_1477;
									word32 s4_1473;
									word32 a2_1468;
									word32 a1_1467;
									word32 a3_1469;
									word32 s7_1476;
									word32 s6_1475;
									word32 s5_1474;
									word32 a7_1472;
									word32 s9_1478;
									word32 s11_1480;
									word32 a5_1471;
									word32 s10_1479;
									word32 a4_1470;
									word32 t4_1481;
									mbedtls_debug_print_msg(ra, s2_713, 0x02, &g_t230C6F50, a5_775, out a1_1467, out a2_1468, out a3_1469, out a4_1470, out a5_1471, out a7_1472, out s4_1473, out s5_1474, out s6_1475, out s7_1476, out s8_1477, out s9_1478, out s10_1479, out s11_1480, out t4_1481);
									return;
								}
								a5_151 = a0_767;
								a3_153.u0 = 900;
							}
						}
					}
l2308B0B0:
					word32 s11_1390;
					word32 a3_1380;
					word32 a4_1381;
					word32 s10_1389;
					word32 s9_1388;
					word32 a5_1382;
					word32 s5_1384;
					word32 s6_1385;
					word32 s7_1386;
					word32 s8_1387;
					word32 s4_1383;
					word32 a1_1378;
					word32 a2_1379;
					mbedtls_debug_print_ret(ra, 0x01, a3_153, a5_151, out a1_1378, out a2_1379, out a3_1380, out a4_1381, out a5_1382, out s4_1383, out s5_1384, out s6_1385, out s7_1386, out s8_1387, out s9_1388, out s10_1389, out s11_1390);
					return;
				}
l2308B310:
				goto l2308B048;
			}
		}
		a5_151 = s0_284;
		a3_153.u0 = 699;
		goto l2308B126;
	}
	else
	{
		*(union Eq_2 *) 0x18 = s1_261;
		*(union Eq_2 *) 0x14 = s1_261;
		s1_418 = *(union Eq_2 *) 0x04;
		*((word32) s1_418 + 20) = 0x00;
		ui32 a4_459 = (word32) *(union Eq_2 *) 0x20;
		word32 a5_460 = 0x08;
		a4_432 = a4_459 & 0x02;
		if ((a4_459 & 0x02) == 0x00)
			a5_460 = 0x10;
		a5_431 = a5_460 + 0x08;
		goto l2308B1E2;
	}
}

