pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308B43A: Register word32 mbedtls_ssl_flush_output(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_490569) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      altcp_mbedtls_write
//      altcp_mbedtls_lower_sent
//      altcp_mbedtls_lower_poll
//      mbedtls_ssl_write_record
//      mbedtls_ssl_write
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_ssl_flush_output(Eq_2 ra, Eq_2 a0, Eq_2 a5, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, struct Eq_490569 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a4_125;
	ptr32 s10_129;
	ptr32 a5_126;
	ptr32 s11_130;
	ptr32 a3_122;
	ptr32 s5_132;
	ptr32 s9_136;
	ptr32 s7_134;
	Eq_2 s1_113;
	ptr32 a1_123;
	Eq_2 a5_31;
	word32 s6_391;
	word32 s7_392;
	word32 s8_393;
	word32 s5_390;
	word32 s10_395;
	word32 a7_388;
	word32 s11_396;
	word32 t4_397;
	word32 s9_394;
	word32 s4_389;
	word32 a4_387;
	word32 a1_384;
	word32 a2_385;
	word32 a3_386;
	Eq_2 a0_121 = mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C7068, a5, out a1_384, out a2_385, out a3_386, out a4_387, out a5_31, out a7_388, out s4_389, out s5_390, out s6_391, out s7_392, out s8_393, out s9_394, out s10_395, out s11_396, out t4_397);
	ptr32 s2_10 = 0x230C8000;
	Eq_2 s0_110 = *((word32) a5_31 + 16);
	if (a5_31 == 0x00)
	{
		word32 a2_398;
		word32 a7_399;
		word32 s4_400;
		word32 s6_401;
		word32 s8_402;
		word32 t4_403;
		mbedtls_debug_print_msg(ra, s0_110, 0x01, &g_t230C7078, a5_31, out a1_123, out a2_398, out a3_122, out a4_125, out a5_126, out a7_399, out s4_400, out s5_132, out s6_401, out s7_134, out s8_402, out s9_136, out s10_129, out s11_130, out t4_403);
		s1_113.u0 = ~0x070000FF;
		goto l2308B48C;
	}
	Eq_2 a5_141 = *((word32) s0_110 + 0x00AC);
	if (a5_141 != 0x00)
	{
		s3 = (struct Eq_490569 *) &g_t230C8000;
		word32 s4_131 = 0x230C7000;
		s2_10 = 0x00FFF9A3;
		while (true)
		{
			Eq_2 a6_164 = *((word32) s0_110 + 0x00AC);
			Eq_2 s0_64 = *a0_121;
			if (a6_164 == 0x00)
				break;
			word32 a5_404;
			word32 a1_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a7_410;
			word32 s4_411;
			word32 s5_412;
			word32 s6_413;
			word32 s7_414;
			word32 s8_415;
			word32 s9_416;
			word32 s10_417;
			word32 s11_418;
			word32 t4_419;
			word32 a0_81 = mbedtls_debug_print_msg(ra, s0_64, 0x02, s4_131 + 0x00C4, Mem66[s0_64 + 0x00A8:int32] + mbedtls_ssl_hdr_len.isra.1(a0_121, out a5_404), out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a7_410, out s4_411, out s5_412, out s6_413, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out t4_419);
			struct Eq_506923 * s0_100 = *a0_81;
			<anonymous> * a5_102;
			struct Eq_506928 * a0_107 = (word32) mbedtls_ssl_hdr_len.isra.1(a0_81, out a5_102) + (s0_100->dw00A8 - s0_100->dw00AC);
			Eq_2 a0_111;
			a5_102();
			s0_110 = a0_107->t001C;
			s1_113 = a0_111;
			word32 a2_420;
			word32 s6_421;
			word32 s8_422;
			a0_121 = mbedtls_debug_print_ret(ra, 0x02, 0x00FFF9A3, a0_111, out a1_123, out a2_420, out a3_122, out a4_125, out a5_126, out s4_131, out s5_132, out s6_421, out s7_134, out s8_422, out s9_136, out s10_129, out s11_130);
			if (a0_111 <= 0x00)
				goto l2308B48C;
			a5_141 = *((word32) s0_110 + 0x00AC);
			*((word32) s0_110 + 0x00AC) = a5_141 - a0_111;
		}
		Eq_2 a4_144 = 0x08;
		while (true)
		{
			ui32 a5_148 = (word32) *((word32) a5_141 + 116);
			Eq_2 s0_147 = *a5_141;
			a5_141 = a5_148 & 0x02;
			if ((a5_148 & 0x02) >= a4_144)
				break;
			ui32 a2_152 = (word32) a4_144 - 1;
			byte * a3_153 = (word32) *((word32) s0_147 + 144) + a2_152;
			a5_141 = (word32) *a3_153 + 0x01 & 0x00FF;
			*a3_153 = (byte) a5_141;
			if (a5_141 != 0x00)
				break;
			a4_144 = a2_152 & 0x00FF;
		}
		ui32 a5_162 = (word32) *((word32) a5_141 + 116);
		s0_110 = *a5_141;
		a5_141 = a5_162 & 0x02;
		if ((a5_162 & 0x02) != 0x00)
			a6_164.u0 = 0x02;
		if (a4_144 == a6_164)
		{
			word32 a2_423;
			word32 a7_424;
			word32 s4_425;
			word32 s6_426;
			word32 s8_427;
			word32 t4_428;
			mbedtls_debug_print_msg(ra, s0_110, 0x01, &g_t230C70F4, a5_162 & 0x02, out a1_123, out a2_423, out a3_122, out a4_125, out a5_126, out a7_424, out s4_425, out s5_132, out s6_426, out s7_134, out s8_427, out s9_136, out s10_129, out s11_130, out t4_428);
			s1_113.u0 = 0xF9000480;
			goto l2308B48C;
		}
	}
	word32 a2_429;
	word32 a7_430;
	word32 s4_431;
	word32 s6_432;
	word32 s8_433;
	word32 t4_434;
	mbedtls_debug_print_msg(ra, s0_110, 0x02, &g_t230C70B4, a5_141, out a1_123, out a2_429, out a3_122, out a4_125, out a5_126, out a7_430, out s4_431, out s5_132, out s6_432, out s7_134, out s8_433, out s9_136, out s10_129, out s11_130, out t4_434);
	s1_113.u0 = 0x00;
l2308B48C:
	0x00 = (int8) dwArg0128;
	s1Out = s1_113;
	a0Out = s1_113;
	a1Out = a1_123;
	a2Out = dwArg0100;
	a3Out = a3_122;
	a4Out = a4_125;
	a5Out = a5_126;
	s2Out = s2_10;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = s5_132;
	s7Out = s7_134;
	s9Out = s9_136;
	s10Out = s10_129;
	s11Out = s11_130;
	return dwArgE4;
}

// 2308B5BA: Register Eq_2 mbedtls_ssl_recv_flight_completed(Register Eq_2 ra, Register Eq_2 a2, Register (ptr32 Eq_507095) a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_507101) a5Out, Register out (ptr32 Eq_507102) s10Out)
// Called from:
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_recv_flight_completed(Eq_2 ra, Eq_2 a2, struct Eq_507095 * a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0138, Eq_2 dwArg0178, struct Eq_507101 & a5Out, struct Eq_507102 & s10Out)
{
	Eq_2 a0_9 = a5->t0030;
	struct Eq_507107 * a4_18;
	struct Eq_507108 * a5_19;
	word32 a3_129;
	word32 s4_130;
	ssl_flight_free(a0_9, a2, *((word32) a0_9 + 56), mstatus, dwArg0138, dwArg0178, out a3_129, out a4_18, out a5_19, out s4_130);
	a5_19->dw0038 = 0x00;
	a5_19->dw003C = 0x00;
	Eq_2 s0_31 = a5_19->t0030;
	Eq_2 a5_32 = a4_18->t0020;
	a4_18->t0040 = a5_32;
	word32 a3_37;
	struct Eq_507101 * a5_39;
	struct Eq_507102 * s10_44;
	word32 s9_139;
	word32 s11_140;
	word32 s6_137;
	word32 s7_138;
	word32 s4_135;
	word32 s5_136;
	word32 a1_133;
	word32 a4_134;
	word32 s0_131;
	word32 s1_132;
	Eq_2 ra_41 = ssl_set_timer(ra, s0_31, 0x00, a5_32, dwArg00, dwArg04, out s0_131, out s1_132, out a1_133, out a3_37, out a4_134, out a5_39, out s4_135, out s5_136, out s6_137, out s7_138, out s9_139, out s10_44, out s11_140);
	if (a3_37 == 22 && (word32) (*((union Eq_2 *) 22)) == 0x14)
		a5_39->b0034 = 0x03;
	else
		a5_39->b0034 = 0x00;
	a5Out = a5_39;
	s10Out = s10_44;
	return ra_41;
}

// 2308B60E: Register Eq_2 mbedtls_ssl_send_flight_completed(Register Eq_2 ra, Register Eq_2 a4, Register (ptr32 Eq_507188) a5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Register out ptr32 s1Out, Register out (ptr32 Eq_507192) a5Out, Register out (ptr32 Eq_507193) s11Out)
// Called from:
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_handshake_client_step
Eq_2 mbedtls_ssl_send_flight_completed(Eq_2 ra, Eq_2 a4, struct Eq_507188 * a5, Eq_2 dwArg00, Eq_2 dwArg04, ptr32 & s1Out, struct Eq_507192 & a5Out, struct Eq_507193 & s11Out)
{
	word32 a4_74;
	*((word32) *((word32) a4 + 0x0068) + 48) = a5;
	struct Eq_507201 * a5_24;
	Eq_2 a1_25;
	word32 s11_146;
	word32 t4_147;
	word32 s9_144;
	word32 s10_145;
	word32 s7_142;
	word32 s8_143;
	word32 s5_140;
	word32 s6_141;
	word32 a7_138;
	word32 s4_139;
	word32 a3_136;
	word32 a4_137;
	word32 a2_135;
	mbedtls_debug_print_msg(ra, a5->t0030, 0x03, &g_t230C7C88, a5->t0030, out a1_25, out a2_135, out a3_136, out a4_137, out a5_24, out a7_138, out s4_139, out s5_140, out s6_141, out s7_142, out s8_143, out s9_144, out s10_145, out s11_146, out t4_147);
	word32 a3_48;
	struct Eq_507192 * a5_50;
	ptr32 s1_54;
	struct Eq_507193 * s11_56;
	word32 s10_156;
	word32 s7_154;
	word32 s9_155;
	word32 s5_152;
	word32 s6_153;
	word32 a4_150;
	word32 s4_151;
	word32 s0_148;
	word32 a1_149;
	Eq_2 ra_52 = ssl_set_timer(ra, a5_24->t0030, a1_25, *((word32) a1_25 + 48), dwArg00, dwArg04, out s0_148, out s1_54, out a1_149, out a3_48, out a4_150, out a5_50, out s4_151, out s5_152, out s6_153, out s7_154, out s9_155, out s10_156, out s11_56);
	if (a3_48 == 22 && (word32) (*((union Eq_2 *) 22)) == 0x14)
		a4_74 = 0x03;
	else
		a4_74 = 0x02;
	a5_50->b0034 = (byte) a4_74;
	s1Out = s1_54;
	a5Out = a5_50;
	s11Out = s11_56;
	return ra_52;
}

// 2308B66E: Register ui32 mbedtls_ssl_update_handshake_status(Register Eq_2 ra, Register word32 a1, Register (ptr32 Eq_507292) a4)
// Called from:
//      mbedtls_ssl_read_record
ui32 mbedtls_ssl_update_handshake_status(Eq_2 ra, word32 a1, struct Eq_507292 * a4)
{
	word32 a0_5 = a4->dw0004;
	struct Eq_507297 * a5_11 = (struct Eq_507297 *) 0x10;
	if (a4 != (struct Eq_507292 *) 0x10)
	{
		Eq_2 a0_13 = *(union Eq_2 *) 0x40;
		if (true)
			(*(<anonymous> **) 212)();
	}
	ui32 a5_29 = (word32) a5_11->w0074;
	ui32 a5_30 = a5_29 & 0x02;
	if ((a5_29 & 0x02) != 0x00 && (a5_29 & 0x02) != 0x00)
	{
		a5_30 = a4->dw0020;
		a4->dw0021 = a5_30;
	}
	return a5_30;
}

// 2308B6AA: void mbedtls_ssl_optimize_checksum(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_507329) a1, Register Eq_2 a5)
void mbedtls_ssl_optimize_checksum(Eq_2 ra, Eq_2 a0, struct Eq_507329 * a1, Eq_2 a5)
{
	if ((word32) a1->b0009 == 0x07)
	{
		word32 a1_74;
		word32 a2_75;
		word32 a3_76;
		word32 a4_77;
		word32 a5_78;
		word32 a7_79;
		word32 s4_80;
		word32 s5_81;
		word32 s6_82;
		word32 s7_83;
		word32 s8_84;
		word32 s9_85;
		word32 s10_86;
		word32 s11_87;
		word32 t4_88;
		mbedtls_debug_print_msg(ra, a0, 0x01, &g_t230C6E20, a5, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out a7_79, out s4_80, out s5_81, out s6_82, out s7_83, out s8_84, out s9_85, out s10_86, out s11_87, out t4_88);
	}
	else
		*(word32 *) 0xCB = 0x2308AD0A;
}

// 2308B6E0: void mbedtls_ssl_reset_checksum(Register (ptr32 Eq_507374) a0)
void mbedtls_ssl_reset_checksum(struct Eq_507374 * a0)
{
	word32 a0_5 = a0->dw0030;
	mbedtls_sha256_starts(a0_5 + 80, null);
}

// 2308B6EC: Register Eq_2 mbedtls_ssl_session_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a4Out)
// Called from:
//      mbedtls_ssl_setup
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_session_init(Eq_2 ra, Eq_2 a0, ptr32 & a4Out)
{
	ptr32 a4_11;
	word32 t1_17;
	word32 a0_18;
	word32 a1_19;
	word32 a2_20;
	word32 a3_21;
	word32 a5_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 116, out t1_17, out a0_18, out a1_19, out a2_20, out a3_21, out a4_11, out a5_22);
	a4Out = a4_11;
	return ra_13;
}

// 2308B6F6: Register Eq_2 mbedtls_ssl_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      altcp_mbedtls_setup
Eq_2 mbedtls_ssl_init(Eq_2 ra, Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_19;
	word32 a0_20;
	word32 a1_21;
	word32 a2_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 0x00C0, out t1_19, out a0_20, out a1_21, out a2_22, out a3_10, out a4_11, out a5_12);
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 2308B700: Register ui32 mbedtls_ssl_conf_authmode(Register Eq_2 a0, Register ui32 a1, Register out Eq_471952 a5Out)
// Called from:
//      bl_cipstart
//      altcp_tls_create_config
ui32 mbedtls_ssl_conf_authmode(Eq_2 a0, ui32 a1, union Eq_471952 & a5Out)
{
	Eq_471952 a5_5 = (a1 & 0x03) << 0x02;
	ui32 a1_10 = (word32) *((word32) a0 + 116) & ~0x0C | a5_5;
	((word32) a0 + 116)->u2 = (word16) a1_10;
	a5Out = a5_5;
	return a1_10;
}

