pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308B714: void mbedtls_ssl_conf_rng(Register Eq_2 a0, Register (ptr32 Eq_490094) a1, Register Eq_2 a2)
// Called from:
//      altcp_tls_create_config
void mbedtls_ssl_conf_rng(Eq_2 a0, struct Eq_490094 * a1, Eq_2 a2)
{
	a1->t0018 = a0;
	*((word32) a2 + 28) = a0;
}

// 2308B71A: void mbedtls_ssl_set_bio(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_489595) a2, Register (ptr32 Eq_489596) a3, Register (ptr32 Eq_489597) a4)
// Called from:
//      altcp_mbedtls_setup
void mbedtls_ssl_set_bio(Eq_2 a0, Eq_2 a1, struct Eq_489595 * a2, struct Eq_489596 * a3, struct Eq_489597 * a4)
{
	*((word32) a1 + 28) = a0;
	a2->t0010 = a0;
	a3->t0014 = a0;
	a4->t0018 = a0;
}

// 2308B724: Register Eq_2 mbedtls_ssl_conf_own_cert(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      altcp_tls_create_config_client_2wayauth
Eq_2 mbedtls_ssl_conf_own_cert(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 a0_13;
	ptr32 a2_15;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_18;
	ptr32 s0_21;
	ptr32 s1_22;
	ptr32 s2_23;
	ptr32 s3_24;
	Eq_2 ra_20 = ssl_append_key_cert(ra, a1, a2, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out s0_21, out s1_22, out a0_13, out a2_15, out a3_16, out a4_17, out a5_18, out s2_23, out s3_24);
	s0Out = s0_21;
	s1Out = s1_22;
	a0Out = a0_13;
	a2Out = a2_15;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s2Out = s2_23;
	s3Out = s3_24;
	return ra_20;
}

// 2308B72C: void mbedtls_ssl_conf_ca_chain(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_490294) a2)
// Called from:
//      altcp_tls_create_config_client_common
void mbedtls_ssl_conf_ca_chain(Eq_2 a0, Eq_2 a1, struct Eq_490294 * a2)
{
	*((word32) a1 + 80) = a0;
	a2->t0054 = a0;
}

// 2308B732: Register Eq_2 mbedtls_ssl_set_hostname(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out (ptr32 Eq_471974) a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_471977 a5Out, Register out (ptr32 Eq_471978) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      bl_cipstart
Eq_2 mbedtls_ssl_set_hostname(Eq_2 ra, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s1Out, struct Eq_471974 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_471977 & a5Out, struct Eq_471978 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a1 != 0x00)
	{
		struct Eq_471974 * a0_26;
		Eq_2 a3_18;
		word32 a2_156;
		word32 a5_157;
		Eq_2 a1_21;
		Eq_2 a4_101;
		Eq_2 a0_17 = strlen(a1, out a1_21, out a2_156, out a3_18, out a4_101, out a5_157);
		struct Eq_471978 * s2_117 = a0;
		Eq_471977 a5_104 = 0x00FF;
		Eq_2 s1_115 = a0_17;
		if (a0_17 <= 0x00FF)
		{
			Eq_2 s0_37;
			word32 a2_158;
			word32 a3_159;
			word32 s8_160;
			ra = mycalloc(ra, a0_17, 0x01, (word32) a0_17 + 1, a3_18, a4_101, 0x00FF, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_37, out s1_115, out a1_21, out a2_158, out a3_159, out a4_101, out a5_104, out s2_117, out s3, out s4, out s8_160);
			s2_117->t00B4.u0 = 0x01;
			if (true)
			{
				word32 a2_161;
				word32 a3_162;
				word32 a5_163;
				word32 a6_164;
				word32 a7_165;
				memcpy(0x01, s0_37, s1_115, out a1_21, out a2_161, out a3_162, out a4_101, out a5_163, out a6_164, out a7_165);
				a5_104 = s2_117->t00B4;
				s1_115 += a5_104;
				*s1_115 = 0x00;
				a0_26 = null;
			}
			else
				a0_26 = (struct Eq_471974 *) 0xF8000100;
		}
		else
			a0_26 = (struct Eq_471974 *) ~0x070000FF;
		0x00 = (int8) dwArg38;
		s1Out = s1_115;
		a0Out = a0_26;
		a1Out = a1_21;
		a4Out = a4_101;
		a5Out = a5_104;
		s2Out = s2_117;
		s3Out = s3;
		s4Out = s4;
		return ra;
	}
	else
	{
		s1Out = s1;
		a0Out = (struct Eq_471974 *) ~0x070000FF;
		a1Out = a1;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ra;
	}
}

// 2308B79A: Register up32 mbedtls_ssl_conf_alpn_protocols(Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_472133 s3Out, Register out ptr32 s4Out)
// Called from:
//      bl_cipstart
up32 mbedtls_ssl_conf_alpn_protocols(Eq_2 a0, Eq_2 a1, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_472133 & s3Out, ptr32 & s4Out)
{
	up32 s1_104 = 0x00;
	a0_23 = a0;
	do
	{
		Eq_2 a0_23;
		if (a0_23 == 0x00)
		{
			*((word32) a0 + 96) = a1;
			goto l2308B7BC;
		}
		word32 a2_118;
		word32 a3_119;
		Eq_2 a0_29 = strlen(a0_23, out a1, out a2_118, out a3_119, out a4, out a5);
		s1_104 = (word32) a0_29 + s1_104;
		a0_23 = (word32) a0_29 - 1;
	} while (a0_29 <= ~0xFE && s1_104 < 0x10000000);
	a0_23.u0 = ~0x070000FF;
l2308B7BC:
	0x00 = (int8) dwArg0128;
	a0Out = a0_23;
	a4Out = a4;
	a5Out = a5;
	s2Out = a0;
	s3Out.u0 = 0x00FE;
	s4Out = 0x10000000;
	return s1_104;
}

// 2308B7EC: Register Eq_2 mbedtls_ssl_get_alpn_protocol(Register Eq_2 a0)
// Called from:
//      tcp_connected_callback
Eq_2 mbedtls_ssl_get_alpn_protocol(Eq_2 a0)
{
	return *((word32) a0 + 0x00B8);
}

// 2308B7F2: Register Eq_2 mbedtls_ssl_get_bytes_avail(Register Eq_2 a5)
// Called from:
//      altcp_mbedtls_handle_rx_appldata
Eq_2 mbedtls_ssl_get_bytes_avail(Eq_2 a5)
{
	Eq_2 a0_5 = *((word32) a5 + 0x0068);
	if (a5 == 0x00)
		return 0x00;
	return *((word32) a0_5 + 112);
}

// 2308B7FE: Register Eq_2 mbedtls_ssl_get_record_expansion(Register Eq_2 ra, Register Eq_488079 s0, Register (ptr32 Eq_490433) a3, Register (ptr32 Eq_490434) a4, Register Eq_2 a5, Register out (ptr32 Eq_490433) a3Out, Register out Eq_490476 a5Out)
// Called from:
//      altcp_mbedtls_sndbuf
Eq_2 mbedtls_ssl_get_record_expansion(Eq_2 ra, Eq_488079 s0, struct Eq_490433 * a3, struct Eq_490434 * a4, Eq_2 a5, struct Eq_490433 & a3Out, union Eq_490476 & a5Out)
{
	Eq_2 a0_5 = a4->t0038;
	if (a4 == null)
	{
		Eq_2 a0_68 = *a0_5;
		Eq_490476 a5_70;
		Eq_2 a0_69 = mbedtls_ssl_hdr_len.isra.1(a0_68, out a5_70);
		a3Out = a3;
		a5Out = a5_70;
		return a0_69;
	}
	Eq_490476 a5_32;
	Eq_2 a0_51;
	if (a3 != null)
	{
		a5 = (word32) a3->b0001;
		if (a5 == 0x02)
		{
			a3 = (struct Eq_490433 *) *((word32) a5 + 20);
			s0 += a5;
			goto l2308B82C;
		}
		if (a5 >= 0x02)
		{
			a5 = a5 + ~0x05 & 0x00FF;
			if (a5 <= 0x02)
			{
l2308B82C:
				a0_51 = mbedtls_ssl_hdr_len.isra.1(*a0_5, out a5_32) + s0;
l2308B860:
				a3Out = a3;
				a5Out = a5_32;
				return a0_51;
			}
		}
	}
	word32 s11_163;
	word32 s10_162;
	word32 s9_161;
	word32 s8_160;
	word32 s7_159;
	word32 s6_158;
	word32 s5_157;
	word32 s4_156;
	word32 a7_155;
	word32 a4_154;
	word32 a2_153;
	word32 a1_152;
	word32 t4_164;
	mbedtls_debug_print_msg(ra, a0_5, 0x01, &g_t230C6E20, a5, out a1_152, out a2_153, out a3, out a4_154, out a5_32, out a7_155, out s4_156, out s5_157, out s6_158, out s7_159, out s8_160, out s9_161, out s10_162, out s11_163, out t4_164);
	a0_51.u0 = 0xF9000400;
	goto l2308B860;
}

