pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308B868: Register ptr32 mbedtls_ssl_get_max_frag_len(Register (ptr32 Eq_490466) a3, Register (ptr32 Eq_490493) a5, Register out ptr32 a5Out)
// Called from:
//      altcp_mbedtls_sndbuf
//      mbedtls_ssl_write
ptr32 mbedtls_ssl_get_max_frag_len(struct Eq_490466 * a3, struct Eq_490493 * a5, ptr32 & a5Out)
{
	ptr32 a5_14 = (a5->dw0074 >> 4 & 0x1C)->ptr230C80E0;
	if (a3 != null)
	{
		ptr32 a4_18 = g_a230C80E0[(word32) a3->b0070 * 0x04];
		if (a4_18 < a5_14)
			a5_14 = a4_18;
	}
	a5Out = a5_14;
	return a5_14;
}

// 2308B894: Register Eq_2 mbedtls_ssl_handshake_step(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_507721) a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC4, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_507721) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handshake
Eq_2 mbedtls_ssl_handshake_step(Eq_2 ra, Eq_2 a0, struct Eq_507721 * a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg78, Eq_2 dwArgC4, ptr32 & s1Out, ptr32 & a0Out, struct Eq_507721 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x070000FF;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a0_109;
	if (a4 != null)
	{
		ui32 a5_16 = (word32) a4->w0074;
		a5 = a5_16 & 0x01;
		if ((a5_16 & 0x01) != 0x00)
		{
l2308B8AA:
			struct Eq_507721 * a4_72;
			Eq_2 a5_73;
			ptr32 s3_79;
			Eq_2 s5_81;
			ptr32 mstatus_94;
			ptr32 a0_93 = mbedtls_ssl_handshake_server_step(ra, a5, s5, mstatus, dwArg18, dwArgC4, out a4_72, out a5_73, out s3_79, out s5_81, out mstatus_94);
			s1Out = s1;
			a0Out = a0_93;
			a4Out = a4_72;
			a5Out = a5_73;
			s2Out = s2;
			s3Out = s3_79;
			s5Out = s5_81;
			mstatusOut = mstatus_94;
			return ra;
		}
		struct Eq_507756 * a5_34;
		ra = mbedtls_ssl_handshake_client_step(ra, a5_16 & 0x01, mstatus, dwArg78, out s1, out a0_109, out a4, out a5_34, out s2, out s3, out s5, out mstatus);
		ui32 a5_50 = (word32) a5_34->w0074;
		a5 = a5_50 & 0x01;
		if ((a5_50 & 0x01) != 0x00)
			goto l2308B8AA;
	}
	else
		a0_109 = ~0x070000FF;
	s1Out = s1;
	a0Out = a0_109;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 2308B8DC: Register Eq_2 mbedtls_ssl_handshake(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArgA4, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_491550) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_mbedtls_lower_recv
//      mbedtls_ssl_write
//      mbedtls_ssl_read
Eq_2 mbedtls_ssl_handshake(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArgA4, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_491550 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 s0_120;
	if (a0 != 0x00)
	{
		Eq_2 a0_16 = *a5;
		s1 = a0_16;
		if (a5 != 0x00)
		{
			word32 s9_272;
			word32 a3_266;
			word32 a7_267;
			word32 s4_268;
			word32 s7_270;
			word32 s6_269;
			word32 s8_271;
			word32 a2_265;
			word32 a1_264;
			word32 s10_273;
			word32 s11_274;
			word32 t4_275;
			struct Eq_507721 * a4_32;
			Eq_2 s5_37;
			Eq_2 a5_100;
			mbedtls_debug_print_msg(ra, a0_16, 0x02, &g_t230C71A0, a5, out a1_264, out a2_265, out a3_266, out a4_32, out a5_100, out a7_267, out s4_268, out s5_37, out s6_269, out s7_270, out s8_271, out s9_272, out s10_273, out s11_274, out t4_275);
			s2 = 0x230C8000;
			s3.u0 = 0x10;
			do
			{
				s1 = *((word32) a5_100 + 4);
				if (a5_100 == s3)
				{
					s0_120 = 0x00;
					break;
				}
				ptr32 a0_57;
				ra = mbedtls_ssl_handshake_step(ra, s1, a4_32, s5_37, mstatus, dwLoc08, dwArg58, dwArgA4, out s1, out a0_57, out a4_32, out a5_100, out s2, out s3, out s5_37, out mstatus);
				s0_120 = a0_57;
			} while (a0_57 == 0x00);
			word32 a2_276;
			word32 a7_277;
			word32 s4_278;
			word32 s8_279;
			word32 s9_280;
			word32 s10_281;
			word32 s11_282;
			word32 t4_283;
			mbedtls_debug_print_msg(ra, s1, 0x02, &g_t230C71B0, a5_100, out a1, out a2_276, out a3, out a4, out a5, out a7_277, out s4_278, out s5, out s6, out s7, out s8_279, out s9_280, out s10_281, out s11_282, out t4_283);
l2308B93C:
			s1Out = s1;
			a0Out = s0_120;
			a1Out = a1;
			a2Out = dwArg48;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s0_120 = ~0x070000FF;
	goto l2308B93C;
}

// 2308B954: Register Eq_2 mbedtls_ssl_transform_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
Eq_2 mbedtls_ssl_transform_free(Eq_2 ra, Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a2Out = a2;
		a5Out = a5;
		return a0;
	}
	else
	{
		Eq_2 a5_14;
		mbedtls_cipher_free(ra, (word32) a0 + 80, a5, out a5_14);
		Eq_2 a5_18;
		Eq_2 a5_24;
		Eq_2 a5_28;
		mbedtls_md_free(ra, (word32) a0 + 0x0044, mbedtls_md_free(ra, (word32) a0 + 56, mbedtls_cipher_free(ra, (word32) a0 + 144, a5_14, out a5_18), a4, a5_18, mstatus, out a5_24), a4, a5_24, mstatus, out a5_28);
		ptr32 a1_35;
		Eq_2 a0_34 = mbedtls_zeroize(a0, 0x00D0, out a1_35);
		a1Out = a1_35;
		a2Out = dwArg10;
		a5Out = a5_28;
		return a0_34;
	}
}

// 2308B990: Register Eq_2 mbedtls_ssl_handshake_free(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
Eq_2 mbedtls_ssl_handshake_free(Eq_2 s1, Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, Eq_2 dwArg0188, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a5_14;
		Eq_2 a0_13 = mbedtls_sha256_free((word32) a0 + 80, out a5_14);
		while (a0_13 != 0x00)
		{
			word32 s0_144;
			word32 a0_145;
			word32 a1_146;
			word32 a3_147;
			word32 a4_148;
			word32 a6_149;
			word32 s4_150;
			word32 t3_151;
			vPortFree(*((word32) s1 + 8), a2, a5_14, mstatus, dwArg0148, dwArg0188, out s0_144, out s1, out a0_145, out a1_146, out a2, out a3_147, out a4_148, out a5_14, out a6_149, out s4_150, out t3_151);
			a0_13 = s1;
		}
		Eq_2 a2_23;
		Eq_2 a5_26;
		Eq_2 a0_29;
		word32 s0_128;
		word32 s1_129;
		word32 a1_130;
		word32 a3_131;
		word32 a4_132;
		word32 a6_133;
		word32 s4_134;
		word32 t3_135;
		vPortFree(a0_13, a2, a5_14, mstatus, dwArg0148, dwArg0188, out s0_128, out s1_129, out a0_29, out a1_130, out a2_23, out a3_131, out a4_132, out a5_26, out a6_133, out s4_134, out t3_135);
		Eq_2 a2_36;
		Eq_2 a5_39;
		Eq_2 a0_42;
		word32 s0_136;
		word32 s1_137;
		word32 a1_138;
		word32 a3_139;
		word32 a4_140;
		word32 a6_141;
		word32 s4_142;
		word32 t3_143;
		vPortFree(a0_29, a2_23, a5_26, mstatus, dwArg0148, dwArg0188, out s0_136, out s1_137, out a0_42, out a1_138, out a2_36, out a3_139, out a4_140, out a5_39, out a6_141, out s4_142, out t3_143);
		Eq_2 s0_48 = *((word32) a0_42 + 56);
		ptr32 a3_52;
		ptr32 a4_53;
		ptr32 a5_54;
		ptr32 s4_57;
		Eq_2 s1_56 = ssl_flight_free(a0_42, a2_36, a5_39, mstatus, dwArg0138, dwArg0178, out a3_52, out a4_53, out a5_54, out s4_57);
		word32 a1_152;
		a0Out = mbedtls_zeroize(s0_48, 348, out a1_152);
		a2Out = dwArg10;
		a3Out = a3_52;
		a4Out = a4_53;
		a5Out = a5_54;
		s4Out = s4_57;
		return s1_56;
	}
}

// 2308B9D8: Register Eq_2 ssl_handshake_wrapup_free_hs_transform(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
// Called from:
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_read_record_layer
Eq_2 ssl_handshake_wrapup_free_hs_transform(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	Eq_2 a2_23;
	Eq_2 a0_41;
	Eq_2 a2_43;
	Eq_2 a5_46;
	word32 a3_138;
	word32 a1_137;
	word32 a4_139;
	word32 a5_140;
	word32 a7_141;
	word32 s4_142;
	word32 s5_143;
	word32 s6_144;
	word32 s7_145;
	word32 s8_146;
	word32 s9_147;
	word32 s10_148;
	word32 s11_149;
	word32 t4_150;
	word32 a3_151;
	word32 a4_152;
	word32 s4_153;
	mbedtls_ssl_handshake_free(0x230C8000, mbedtls_debug_print_msg(ra, a0, 0x03, &g_t230C81EC, a5, out a1_137, out a2_23, out a3_138, out a4_139, out a5_140, out a7_141, out s4_142, out s5_143, out s6_144, out s7_145, out s8_146, out s9_147, out s10_148, out s11_149, out t4_150), a2_23, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_41, out a2_43, out a3_151, out a4_152, out a5_46, out s4_153);
	Eq_2 a4_55;
	Eq_2 a0_59;
	word32 s0_154;
	word32 s1_155;
	word32 a1_156;
	word32 a2_157;
	word32 a3_158;
	word32 a6_159;
	word32 s4_160;
	word32 t3_161;
	Eq_2 a5_56;
	vPortFree(a0_41, a2_43, a5_46, mstatus, dwArg0148, dwArg0188, out s0_154, out s1_155, out a0_59, out a1_156, out a2_157, out a3_158, out a4_55, out a5_56, out a6_159, out s4_160, out t3_161);
	*((word32) *((word32) a0_59 + 60) + 48) = 0x00;
	if (a0_59 != 0x00)
	{
		Eq_2 a2_69;
		Eq_2 a5_70;
		word32 a1_162;
		word32 s0_163;
		word32 s1_164;
		word32 a0_165;
		word32 a1_166;
		word32 a2_167;
		word32 a3_168;
		word32 a4_169;
		word32 a6_170;
		word32 s4_171;
		word32 t3_172;
		vPortFree(mbedtls_ssl_transform_free(ra, a0_59, a4_55, a5_56, mstatus, out a1_162, out a2_69, out a5_70), a2_69, a5_70, mstatus, dwArg0148, dwArg0188, out s0_163, out s1_164, out a0_165, out a1_166, out a2_167, out a3_168, out a4_169, out a5_56, out a6_170, out s4_171, out t3_172);
	}
	Eq_2 s0_86 = *((word32) a5_56 + 64);
	*((word32) s0_86 + 64) = 0x00;
	*((word32) a5_56 + 60) = s0_86;
	Eq_2 a5_104;
	word32 a1_173;
	word32 a2_174;
	word32 a3_175;
	word32 a4_176;
	word32 a7_177;
	word32 s4_178;
	word32 s5_179;
	word32 s6_180;
	word32 s7_181;
	word32 s8_182;
	word32 s9_183;
	word32 s10_184;
	word32 s11_185;
	word32 t4_186;
	mbedtls_debug_print_msg(ra, s0_86, 0x03, &g_t230C820C, a5_56, out a1_173, out a2_174, out a3_175, out a4_176, out a5_104, out a7_177, out s4_178, out s5_179, out s6_180, out s7_181, out s8_182, out s9_183, out s10_184, out s11_185, out t4_186);
	return a5_104;
}

// 2308BA46: Register word32 mbedtls_ssl_session_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_ssl_session_free(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a0_10 = *((word32) a0 + 92);
		if (a0_10 != 0x00)
		{
			Eq_2 a0_14;
			Eq_2 a2_16;
			Eq_2 a5_19;
			word32 s0_123;
			word32 s1_124;
			word32 a1_125;
			word32 s2_126;
			word32 s3_127;
			word32 s4_128;
			word32 s8_129;
			mbedtls_x509_crt_free(ra, a0_10, a1, a5, mstatus, dwArg0128, dwArg0168, out s0_123, out s1_124, out a0_14, out a1_125, out a2_16, out a5_19, out s2_126, out s3_127, out s4_128, out s8_129);
			word32 s0_130;
			word32 s1_131;
			word32 a1_132;
			word32 a3_133;
			word32 a4_134;
			word32 a6_135;
			word32 s4_136;
			word32 t3_137;
			vPortFree(a0_14, a2_16, a5_19, mstatus, dwArg0148, dwArg0188, out s0_130, out s1_131, out a0_10, out a1_132, out a2, out a3_133, out a4_134, out a5, out a6_135, out s4_136, out t3_137);
		}
		ptr32 a3_52;
		ptr32 a4_53;
		Eq_2 a5_54;
		word32 s1_55;
		Eq_2 s0_60;
		ptr32 s4_61;
		word32 a0_118;
		word32 a1_119;
		word32 a2_120;
		word32 a6_121;
		word32 t3_122;
		vPortFree(a0_10, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_60, out s1_55, out a0_118, out a1_119, out a2_120, out a3_52, out a4_53, out a5_54, out a6_121, out s4_61, out t3_122);
		word32 a1_138;
		a0Out = mbedtls_zeroize(s0_60, 116, out a1_138);
		a2Out = dwArg10;
		a3Out = a3_52;
		a4Out = a4_53;
		a5Out = a5_54;
		s4Out = s4_61;
		return s1_55;
	}
}

// 2308BA76: void mbedtls_ssl_handshake_wrapup(Register Eq_2 ra, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg38, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
void mbedtls_ssl_handshake_wrapup(Eq_2 ra, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, word32 dwArg38, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	Eq_2 s2_22 = *((word32) a5 + 328);
	word32 s1_16 = 0x230C8000;
	Eq_2 a2_26;
	word32 s11_340;
	word32 t4_341;
	word32 s7_336;
	word32 s9_338;
	word32 s10_339;
	word32 s8_337;
	word32 a7_332;
	word32 s5_334;
	word32 s6_335;
	word32 s4_333;
	Eq_2 a1_25;
	struct Eq_508421 ** a4_28;
	word32 a3_27;
	Eq_2 a5_121;
	Eq_2 a0_23 = mbedtls_debug_print_msg(ra, *((word32) a5 + 48), 0x03, &g_t230C71C0, a5, out a1_25, out a2_26, out a3_27, out a4_28, out a5_121, out a7_332, out s4_333, out s5_334, out s6_335, out s7_336, out s8_337, out s9_338, out s10_339, out s11_340, out t4_341);
	if (a0_23 != 0x00)
	{
		Eq_2 a0_44;
		Eq_2 a2_46;
		Eq_2 a5_49;
		word32 s4_344;
		word32 a3_342;
		word32 a4_343;
		mbedtls_ssl_session_free(ra, a0_23, a1_25, a2_26, a5_121, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_44, out a2_46, out a3_342, out a4_343, out a5_49, out s4_344);
		word32 s4_348;
		word32 t3_349;
		word32 a2_346;
		word32 a6_347;
		word32 s0_345;
		vPortFree(a0_44, a2_46, a5_49, mstatus, dwArg0148, dwArg0188, out s0_345, out s1_16, out a0_23, out a1_25, out a2_346, out a3_27, out a4_28, out a5_121, out a6_347, out s4_348, out t3_349);
	}
	struct Eq_508421 * s0_72 = *a4_28;
	s0_72->dw002C = 0x00;
	*((word32) a1_25 + 40) = s0_72;
	if (a5_121 != 0x00 && (a3_27 != 0x00 && s2_22 == 0x00))
	{
		Eq_2 s0_87;
		word32 a0_91;
		word32 a6_112;
		a5_121();
		if (a0_91 != 0x00)
		{
			word32 t4_363;
			word32 s9_360;
			word32 s10_361;
			word32 s11_362;
			word32 s7_358;
			word32 s8_359;
			word32 s5_356;
			word32 s6_357;
			word32 a7_354;
			word32 s4_355;
			word32 a3_352;
			word32 a4_353;
			word32 a1_350;
			word32 a2_351;
			mbedtls_debug_print_msg(ra, s0_87, 0x01, &g_t230C71D4, a5_121, out a1_350, out a2_351, out a3_352, out a4_353, out a5_121, out a7_354, out s4_355, out s5_356, out s6_357, out s7_358, out s8_359, out s9_360, out s10_361, out s11_362, out t4_363);
		}
	}
	struct Eq_508467 * a5_161;
	ui32 a5_142 = (word32) *((word32) a5_121 + 116);
	Eq_2 s0_141 = *a5_121;
	Eq_2 a5_143 = a5_142 & 0x02;
	if ((a5_142 & 0x02) != 0x00)
	{
		s0_141 = (a5_142 & 0x02)->t0030;
		a5_143 = (a5_142 & 0x02)->t0038;
		if (a5_143 != 0x00)
		{
			word32 a1_365;
			Eq_2 a5_185;
			Eq_2 s0_188;
			word32 s1_364;
			word32 a3_366;
			word32 a4_367;
			word32 s4_368;
			word32 s5_369;
			word32 s6_370;
			word32 s7_371;
			word32 s9_372;
			word32 s10_373;
			word32 s11_374;
			ra = ssl_set_timer(ra, s0_141, 0x00, a5_143, dwArg00, dwArg04, out s0_188, out s1_364, out a1_365, out a3_366, out a4_367, out a5_185, out s4_368, out s5_369, out s6_370, out s7_371, out s9_372, out s10_373, out s11_374);
			word32 a1_375;
			word32 a2_376;
			word32 a3_377;
			word32 a4_378;
			word32 a7_379;
			word32 s4_380;
			word32 s5_381;
			word32 s6_382;
			word32 s7_383;
			word32 s8_384;
			word32 s9_385;
			word32 s10_386;
			word32 s11_387;
			word32 t4_388;
			mbedtls_debug_print_msg(ra, s0_188, 0x03, &g_t230C71F0, a5_185, out a1_375, out a2_376, out a3_377, out a4_378, out a5_161, out a7_379, out s4_380, out s5_381, out s6_382, out s7_383, out s8_384, out s9_385, out s10_386, out s11_387, out t4_388);
l2308BB1A:
			Eq_2 s0_231 = a5_161->t0004;
			Eq_2 a5_235 = (char *) a5_161 + 1;
			*((word32) a5_235 + 4) = s0_231;
			0x00 = dwArg38;
			word32 a1_389;
			word32 a2_390;
			word32 a3_391;
			word32 a4_392;
			word32 a5_393;
			word32 a7_394;
			word32 s4_395;
			word32 s5_396;
			word32 s6_397;
			word32 s7_398;
			word32 s8_399;
			word32 s9_400;
			word32 s10_401;
			word32 s11_402;
			word32 t4_403;
			mbedtls_debug_print_msg(ra, s0_231, 0x03, &g_t230C7218, a5_235, out a1_389, out a2_390, out a3_391, out a4_392, out a5_393, out a7_394, out s4_395, out s5_396, out s6_397, out s7_398, out s8_399, out s9_400, out s10_401, out s11_402, out t4_403);
			return;
		}
	}
	a5_161 = ssl_handshake_wrapup_free_hs_transform(ra, s0_141, a5_143, mstatus, dwArg0118, dwArg0128, dwArg0138, dwArg0158, dwArg0168, dwArg0178);
	goto l2308BB1A;
}

