pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308BB4C: Register Eq_2 ssl_handshake_init(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_508647) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack word32 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_508671) a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out)
// Called from:
//      mbedtls_ssl_setup
Eq_2 ssl_handshake_init(Eq_2 ra, Eq_2 s1, struct Eq_508647 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, word32 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, struct Eq_508671 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out)
{
	Eq_2 a0_103 = a0->t0040;
	if (a0_103 != 0x00)
		a0_103 = mbedtls_ssl_transform_free(ra, a0_103, a4, a5, mstatus, out a1, out a2, out a5);
	if (a0_103 != 0x00)
		s1 = mbedtls_ssl_session_free(ra, a0_103, a1, a2, a5, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_103, out a2, out a3, out a4, out a5, out s4);
	if (a0_103 != 0x00)
	{
		word32 a2_624;
		s1 = mbedtls_ssl_handshake_free(s1, a0_103, a2, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_103, out a2_624, out a3, out a4, out a5, out s4);
	}
	if (a5 == 0x00)
	{
		Eq_2 s0_88;
		word32 s8_627;
		word32 a1_625;
		word32 a2_626;
		ra = mycalloc(ra, s1, 0x01, 0x00D0, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_88, out s1, out a1_625, out a2_626, out a3, out a4, out a5, out s2, out s3, out s4, out s8_627);
		*(union Eq_2 *) 0x41 = s0_88;
		a0_103.u0 = 0x01;
	}
	if (a5 == 0x00)
	{
		Eq_2 s0_117;
		word32 s8_630;
		word32 a1_628;
		word32 a2_629;
		ra = mycalloc(ra, s1, 0x01, 116, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_117, out s1, out a1_628, out a2_629, out a3, out a4, out a5, out s2, out s3, out s4, out s8_630);
		*(union Eq_2 *) 0x2D = s0_117;
		a0_103.u0 = 0x01;
	}
	struct Eq_508671 * a4_248;
	ptr32 a3_259;
	ptr32 a0_264;
	Eq_2 s0_146;
	if (a5 == 0x00)
	{
		word32 a1_693;
		word32 a2_694;
		word32 a3_695;
		word32 a4_696;
		word32 s8_697;
		ra = mycalloc(ra, s1, 0x01, 348, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_146, out s1, out a1_693, out a2_694, out a3_695, out a4_696, out a5, out s2, out s3, out s4, out s8_697);
		*(union Eq_2 *) 0x31 = s0_146;
		a0_103.u0 = 0x01;
		if (false)
		{
l2308BB98:
			word32 t3_648;
			word32 s1_642;
			word32 a1_643;
			word32 a3_644;
			word32 a6_646;
			word32 a4_645;
			word32 s4_647;
			word32 s5_636;
			word32 s8_637;
			word32 s10_638;
			Eq_2 a5_320;
			Eq_2 a2_322;
			Eq_2 a2_343;
			Eq_2 a5_346;
			Eq_2 a0_349;
			word32 s11_639;
			word32 t4_640;
			word32 s0_641;
			word32 a1_631;
			word32 a3_632;
			word32 a4_633;
			word32 a7_634;
			word32 s4_635;
			vPortFree(mbedtls_debug_print_msg(ra, s0_146, 0x01, &g_t230C81C8, a5, out a1_631, out a2_322, out a3_632, out a4_633, out a5_320, out a7_634, out s4_635, out s5_636, out s6, out s7, out s8_637, out s9, out s10_638, out s11_639, out t4_640), a2_322, a5_320, mstatus, dwArg0148, dwArg0188, out s0_641, out s1_642, out a0_349, out a1_643, out a2_343, out a3_644, out a4_645, out a5_346, out a6_646, out s4_647, out t3_648);
			Eq_2 a2_356;
			Eq_2 a5_359;
			Eq_2 a0_362;
			word32 s0_649;
			word32 a3_652;
			word32 a1_651;
			word32 s1_650;
			word32 a6_654;
			word32 s4_655;
			word32 t3_656;
			word32 a4_653;
			vPortFree(a0_349, a2_343, a5_346, mstatus, dwArg0148, dwArg0188, out s0_649, out s1_650, out a0_362, out a1_651, out a2_356, out a3_652, out a4_653, out a5_359, out a6_654, out s4_655, out t3_656);
			struct Eq_508854 * s0_378;
			word32 a2_659;
			word32 a5_660;
			word32 a6_661;
			word32 t3_662;
			word32 a0_657;
			word32 a1_658;
			vPortFree(a0_362, a2_356, a5_359, mstatus, dwArg0148, dwArg0188, out s0_378, out s1, out a0_657, out a1_658, out a2_659, out a3_259, out a4_248, out a5_660, out a6_661, out s4, out t3_662);
			s0_378->dw0030 = 0x00;
			s0_378->dw0040 = 0x00;
			s0_378->dw002C = 0x00;
			a0_264 = 0xF8000100;
			goto l2308BBDA;
		}
	}
	s0_146 = *((word32) a5 + 64);
	if (a5 != 0x00)
	{
		s0_146 = *((byte) a0_103.u0 + 44);
		if (a0_103 != 0x00)
		{
			s2 = (word32) s1 + 80;
			word32 t1_664;
			word32 a0_665;
			word32 a1_666;
			word32 a2_667;
			word32 a3_668;
			word32 a4_663;
			word32 a4_675;
			word32 a4_669;
			word32 a5_670;
			word32 a3_671;
			word32 a4_672;
			word32 a5_673;
			word32 a3_674;
			word32 a5_676;
			word32 t1_677;
			word32 a0_678;
			word32 a1_679;
			word32 a2_680;
			word32 a3_681;
			word32 a4_682;
			word32 a5_683;
			word32 t1_684;
			word32 a3_685;
			word32 a5_686;
			ra = mbedtls_sha256_init(memset(mbedtls_md_init(mbedtls_md_init(mbedtls_cipher_init(mbedtls_cipher_init(memset(mbedtls_ssl_session_init(ra, a0_103, out a4_663), s1, 0x00, 0x00D0, out t1_664, out a0_665, out a1_666, out a2_667, out a3_668, out a4_669, out a5_670), (word32) s1 + 80), (word32) s1 + 144), (word32) s1 + 56, out a3_671, out a4_672, out a5_673), (word32) s1 + 0x0044, out a3_674, out a4_675, out a5_676), s1, 0x00, 348, out t1_677, out a0_678, out a1_679, out a2_680, out a3_681, out a4_682, out a5_683), s2, out t1_684, out a3_685, out a4_248, out a5_686);
			mbedtls_sha256_starts(s2, null);
			((word32) s1 + 0x00C4)->u0 = 0x2308AD00;
			*(union Eq_2 *) 0x02 = s1;
			*(union Eq_2 *) 0x0F = s1;
			a3_259 = 0x02;
			a0_264 = 0x00;
			ui32 a5_265 = (word32) *(uint16 *) 0x77;
			if ((a5_265 & 0x02) != 0x00)
			{
				a4_248->dw0044 = a5_265 & 0x02;
				Eq_2 s0_271 = a4_248->t0030;
				ui32 a5_272 = (word32) (a5_265 & 0x02)->w0074;
				if ((a5_272 & 0x01) == 0x00)
					a4_248->b0034 = 0x00;
				else
					a4_248->b0034 = 0x02;
				word32 s0_687;
				word32 a1_688;
				word32 a5_689;
				word32 s5_690;
				word32 s10_691;
				word32 s11_692;
				ra = ssl_set_timer(ra, s0_271, 0x00, a5_272 & 0x01, dwArg00, dwArg04, out s0_687, out s1, out a1_688, out a3_259, out a4_248, out a5_689, out s4, out s5_690, out s6, out s7, out s9, out s10_691, out s11_692);
				a0_264 = 0x00;
			}
l2308BBDA:
			0x00 = dwArg38;
			s1Out = s1;
			a0Out = a0_264;
			a3Out = a3_259;
			a4Out = a4_248;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s6Out = s6;
			s7Out = s7;
			s9Out = s9;
			return ra;
		}
	}
	goto l2308BB98;
}

// 2308BC94: Register Eq_2 mbedtls_ssl_setup(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack word32 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out)
// Called from:
//      altcp_mbedtls_setup
Eq_2 mbedtls_ssl_setup(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, word32 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out)
{
	*a1 = a0;
	Eq_2 a3_26;
	Eq_2 a4_27;
	Eq_2 a5_28;
	Eq_2 s1_32;
	word32 a1_261;
	word32 a2_262;
	word32 s4_263;
	word32 s8_264;
	Eq_2 s0_31;
	ptr32 s3_238;
	ptr32 s2_236;
	Eq_2 ra_30 = mycalloc(ra, a1, 0x01, 0x0400013D, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_31, out s1_32, out a1_261, out a2_262, out a3_26, out a4_27, out a5_28, out s2_236, out s3_238, out s4_263, out s8_264);
	*(union Eq_2 *) 0x51 = s0_31;
	if (true)
	{
		struct Eq_509169 * a5_48;
		Eq_2 s1_52;
		word32 a1_281;
		word32 a2_282;
		word32 a3_283;
		word32 a4_284;
		word32 s4_285;
		word32 s8_286;
		ra_30 = mycalloc(ra_30, s1_32, 0x01, s2_236 + 317, a3_26, a4_27, a5_28, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_31, out s1_52, out a1_281, out a2_282, out a3_283, out a4_284, out a5_48, out s2_236, out s3_238, out s4_285, out s8_286);
		*((word32) s0_31 + 0x008C) = 0x01;
		if (true)
		{
			Eq_2 a5_126;
			struct Eq_508647 * s0_117 = a5_48->ptr0050;
			if (((word32) *((word32) s1_52 + 116) & 0x02) != 0x00)
			{
				s0_117->dw0094 = 0x01;
				a5_48->ptr0058 = s0_117;
				s0_117->dw0090 = 0x04;
				s0_117->dw0098 = 0x0C;
				s0_117->dw009C = 0x0E;
				s0_117->dw00A0 = 0x0E;
				a5_48->ptr0057 = s0_117;
				a5_126 = (char *) a5_48 + 3;
			}
			else
			{
				s0_117->dw0090 = 0x01;
				a5_48->ptr0054 = s0_117;
				s0_117->dw0094 = 0x09;
				s0_117->dw0098 = 0x0C;
				s0_117->dw009C = 0x0E;
				s0_117->dw00A0 = 0x0E;
				a5_48->ptr0060 = s0_117;
				a5_126 = (char *) a5_48 + 8;
			}
			a5_48->ptr0067 = s0_117;
			a5_48->ptr006D = s0_117;
			a5_48->ptr0071 = s0_117;
			0x00 = dwArg38;
			ptr32 a0_158;
			ptr32 a3_161;
			ptr32 a4_162;
			ptr32 s1_167;
			ptr32 s2_170;
			ptr32 s3_171;
			ptr32 s4_172;
			ptr32 s6_174;
			ptr32 s7_175;
			ptr32 s9_177;
			Eq_2 ra_166 = ssl_handshake_init(ra_30, s1_52, s0_117, (char *) a5_48 + 11, dwArg10, 0x0E, (char *) a5_48 + 0x0D, a5_126, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg38, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, dwArg0188, out s1_167, out a0_158, out a3_161, out a4_162, out s2_170, out s3_171, out s4_172, out s6_174, out s7_175, out s9_177);
			s1Out = s1_167;
			a0Out = a0_158;
			a3Out = a3_161;
			a4Out = a4_162;
			s2Out = s2_170;
			s3Out = s3_171;
			s4Out = s4_172;
			s6Out = s6_174;
			s7Out = s7_175;
			s9Out = s9_177;
			return ra_166;
		}
	}
	Eq_2 a5_75;
	Eq_2 a2_77;
	ptr32 s6_85;
	ptr32 s7_86;
	ptr32 s9_88;
	ptr32 a3_98;
	ptr32 a4_99;
	ptr32 s1_101;
	struct Eq_509112 * s0_106;
	ptr32 s4_107;
	word32 a1_265;
	word32 a3_266;
	word32 a4_267;
	word32 a7_268;
	word32 s4_269;
	word32 s5_270;
	word32 s8_271;
	word32 s10_272;
	word32 s11_273;
	word32 t4_274;
	word32 a0_275;
	word32 a1_276;
	word32 a2_277;
	word32 a5_278;
	word32 a6_279;
	word32 t3_280;
	vPortFree(mbedtls_debug_print_msg(ra_30, s0_31, 0x01, &g_t230C7CB0, 0x0400013D, out a1_265, out a2_77, out a3_266, out a4_267, out a5_75, out a7_268, out s4_269, out s5_270, out s6_85, out s7_86, out s8_271, out s9_88, out s10_272, out s11_273, out t4_274), a2_77, a5_75, mstatus, dwArg0148, dwArg0188, out s0_106, out s1_101, out a0_275, out a1_276, out a2_277, out a3_98, out a4_99, out a5_278, out a6_279, out s4_107, out t3_280);
	s0_106->dw0050 = 0x00;
	0x00 = dwArg38;
	s1Out = s1_101;
	a0Out = 0xF8000100;
	a3Out = a3_98;
	a4Out = a4_99;
	s2Out = s2_236;
	s3Out = s3_238;
	s4Out = s4_107;
	s6Out = s6_85;
	s7Out = s7_86;
	s9Out = s9_88;
	return ra_30;
}

// 2308BD6E: Register word32 mbedtls_ssl_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s4Out)
// Called from:
//      altcp_mbedtls_dealloc
word32 mbedtls_ssl_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a4Out = a4;
		s2Out = s2;
		s4Out = s4;
		return a3;
	}
	else
	{
		word32 a3_424;
		word32 a7_425;
		word32 s4_426;
		word32 s5_427;
		word32 s6_428;
		word32 s7_429;
		word32 s8_430;
		word32 s9_431;
		word32 s10_432;
		word32 s11_433;
		word32 t4_434;
		Eq_2 a4_27;
		Eq_2 a1_106;
		Eq_2 a2_118;
		Eq_2 a5_102;
		mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C7118, a5, out a1_106, out a2_118, out a3_424, out a4_27, out a5_102, out a7_425, out s4_426, out s5_427, out s6_428, out s7_429, out s8_430, out s9_431, out s10_432, out s11_433, out t4_434);
		Eq_2 s1_103 = 0x230C8000;
		Eq_2 a0_105 = *((word32) a0 + 0x008C);
		if (a0_105 != 0x00)
		{
			word32 a1_435;
			mbedtls_zeroize(a0_105, 0x0400013D, out a1_435);
			word32 s0_436;
			word32 a3_437;
			word32 a6_438;
			word32 s4_439;
			word32 t3_440;
			vPortFree(*((word32) a0 + 0x008C), a2_118, a5_102, mstatus, dwArg0148, dwArg0188, out s0_436, out s1_103, out a0_105, out a1_106, out a2_118, out a3_437, out a4_27, out a5_102, out a6_438, out s4_439, out t3_440);
		}
		if (a0_105 != 0x00)
		{
			word32 a1_441;
			word32 s0_442;
			word32 a3_443;
			word32 a6_444;
			word32 s4_445;
			word32 t3_446;
			vPortFree(mbedtls_zeroize(a0_105, 0x0400013D, out a1_441), a2_118, a5_102, mstatus, dwArg0148, dwArg0188, out s0_442, out s1_103, out a0_105, out a1_106, out a2_118, out a3_443, out a4_27, out a5_102, out a6_444, out s4_445, out t3_446);
		}
		if (a0_105 != 0x00)
		{
			Eq_2 a2_95;
			Eq_2 a5_96;
			word32 a1_447;
			word32 s0_448;
			word32 a3_449;
			word32 a4_450;
			word32 a6_451;
			word32 s4_452;
			word32 t3_453;
			vPortFree(mbedtls_ssl_transform_free(ra, a0_105, a4_27, a5_102, mstatus, out a1_447, out a2_95, out a5_96), a2_95, a5_96, mstatus, dwArg0148, dwArg0188, out s0_448, out s1_103, out a0_105, out a1_106, out a2_118, out a3_449, out a4_450, out a5_102, out a6_451, out s4_452, out t3_453);
		}
		if (a0_105 != 0x00)
		{
			Eq_2 a0_121;
			Eq_2 a4_125;
			Eq_2 a5_126;
			word32 a2_454;
			word32 a3_455;
			word32 s4_456;
			mbedtls_ssl_handshake_free(s1_103, a0_105, a2_118, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_121, out a2_454, out a3_455, out a4_125, out a5_126, out s4_456);
			Eq_2 a1_135;
			Eq_2 a2_136;
			Eq_2 a5_137;
			Eq_2 a0_139;
			Eq_2 a2_141;
			Eq_2 a5_144;
			word32 a3_457;
			word32 a4_458;
			word32 s4_459;
			mbedtls_ssl_session_free(ra, mbedtls_ssl_transform_free(ra, a0_121, a4_125, a5_126, mstatus, out a1_135, out a2_136, out a5_137), a1_135, a2_136, a5_137, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_139, out a2_141, out a3_457, out a4_458, out a5_144, out s4_459);
			Eq_2 a2_151;
			Eq_2 a5_154;
			Eq_2 a0_157;
			word32 s0_460;
			word32 s1_461;
			word32 a1_462;
			word32 a3_463;
			word32 a4_464;
			word32 a6_465;
			word32 s4_466;
			word32 t3_467;
			vPortFree(a0_139, a2_141, a5_144, mstatus, dwArg0148, dwArg0188, out s0_460, out s1_461, out a0_157, out a1_462, out a2_151, out a3_463, out a4_464, out a5_154, out a6_465, out s4_466, out t3_467);
			Eq_2 a2_164;
			Eq_2 a5_167;
			Eq_2 a0_170;
			word32 s0_468;
			word32 s1_469;
			word32 a1_470;
			word32 a3_471;
			word32 a4_472;
			word32 a6_473;
			word32 s4_474;
			word32 t3_475;
			vPortFree(a0_157, a2_151, a5_154, mstatus, dwArg0148, dwArg0188, out s0_468, out s1_469, out a0_170, out a1_470, out a2_164, out a3_471, out a4_472, out a5_167, out a6_473, out s4_474, out t3_475);
			word32 s0_476;
			word32 s1_477;
			word32 a3_478;
			word32 a4_479;
			word32 a6_480;
			word32 s4_481;
			word32 t3_482;
			vPortFree(a0_170, a2_164, a5_167, mstatus, dwArg0148, dwArg0188, out s0_476, out s1_477, out a0_105, out a1_106, out a2_118, out a3_478, out a4_479, out a5_102, out a6_480, out s4_481, out t3_482);
		}
		Eq_2 s0_191 = *((word32) a0_105 + 40);
		if (a0_105 != 0x00)
		{
			Eq_2 a0_202;
			Eq_2 a2_204;
			Eq_2 a5_207;
			word32 a3_483;
			word32 a4_484;
			word32 s4_485;
			mbedtls_ssl_session_free(ra, a0_105, a1_106, a2_118, a5_102, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_202, out a2_204, out a3_483, out a4_484, out a5_207, out s4_485);
			word32 s1_486;
			word32 a0_487;
			word32 a1_488;
			word32 a2_489;
			word32 a3_490;
			word32 a4_491;
			word32 a6_492;
			word32 s4_493;
			word32 t3_494;
			vPortFree(a0_202, a2_204, a5_207, mstatus, dwArg0148, dwArg0188, out s0_191, out s1_486, out a0_487, out a1_488, out a2_489, out a3_490, out a4_491, out a5_102, out a6_492, out s4_493, out t3_494);
		}
		Eq_2 s2_228 = *((word32) s0_191 + 0x00B4);
		if (s2_228 != 0x00)
		{
			Eq_2 a5_233;
			Eq_2 a2_235;
			word32 a1_507;
			word32 a3_508;
			word32 a4_509;
			word32 a1_510;
			mbedtls_zeroize(s2_228, strlen(s2_228, out a1_507, out a2_235, out a3_508, out a4_509, out a5_233), out a1_510);
			word32 s1_511;
			word32 a0_512;
			word32 a1_513;
			word32 a2_514;
			word32 a3_515;
			word32 a4_516;
			word32 a6_517;
			word32 s4_518;
			word32 t3_519;
			vPortFree(*((word32) s0_191 + 0x00B4), a2_235, a5_233, mstatus, dwArg0148, dwArg0188, out s0_191, out s1_511, out a0_512, out a1_513, out a2_514, out a3_515, out a4_516, out a5_102, out a6_517, out s4_518, out t3_519);
		}
		word32 a3_274;
		ptr32 a4_275;
		ptr32 s4_279;
		word32 a1_495;
		word32 a2_496;
		word32 a5_497;
		word32 a7_498;
		word32 s5_499;
		word32 s6_500;
		word32 s7_501;
		word32 s8_502;
		word32 s9_503;
		word32 s10_504;
		word32 s11_505;
		word32 t4_506;
		mbedtls_debug_print_msg(ra, s0_191, 0x02, &g_t230C7120, a5_102, out a1_495, out a2_496, out a3_274, out a4_275, out a5_497, out a7_498, out s4_279, out s5_499, out s6_500, out s7_501, out s8_502, out s9_503, out s10_504, out s11_505, out t4_506);
		0x00 = dwArg38;
		word32 a1_520;
		mbedtls_zeroize(s0_191, 0x00C0, out a1_520);
		a4Out = a4_275;
		s2Out = s2_228;
		s4Out = s4_279;
		return a3_274;
	}
}

// 2308BE56: Register Eq_2 mbedtls_ssl_config_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      altcp_tls_create_config
Eq_2 mbedtls_ssl_config_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 0x0078, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 2308BE60: Register word32 mbedtls_ssl_config_defaults(Register Eq_2 a0, Register ui32 a1, Register Eq_490014 a2, Register ptr32 a3, Register out Eq_2 a0Out, Register out Eq_490014 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      altcp_tls_create_config
word32 mbedtls_ssl_config_defaults(Eq_2 a0, ui32 a1, Eq_490014 a2, ptr32 a3, union Eq_2 & a0Out, union Eq_490014 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	ui32 a5_14 = ((word32) *((word32) a0 + 116) & ~0x01 | a1 & 1) & ~0x02 | (a2 & 1) << 1;
	((word32) a0 + 116)->u2 = (word16) a5_14;
	if (a1 == 0x00)
		((word32) a0 + 116)->u2 = (word16) (a5_14 & -525 | 520);
	*(union Eq_2 *) 0x0450 = a0;
	*(union Eq_2 *) 0x0EFFFACC = a0;
	if (a3 != 0x02)
	{
		*(union Eq_2 *) 0x03030373 = a0;
		if (a2 == 0x01)
			*((word32) a0 + 115) = 0x02;
		struct Eq_509751 * a0_44;
		word32 s1_50;
		ptr32 s2_51;
		ptr32 s3_52;
		ptr32 s4_53;
		ptr32 s5_54;
		word32 s0_49 = mbedtls_ssl_list_ciphersuites(out s1_50, out a0_44, out s2_51, out s3_52, out s4_53, out s5_54);
		g_dw230C85D0 = s0_49;
		a0_44->dw000C = s0_49;
		a0_44->dw0008 = s0_49;
		a0_44->dw0004 = s0_49;
		a0_44->dw0000 = s0_49;
		g_dw4200E17C = s0_49;
		ptr32 a3_71;
		ptr32 a4_72;
		ptr32 a5_73;
		mbedtls_ecp_grp_id_list(out a3_71, out a4_72, out a5_73)->dw005C = s0_49;
		a0Out.u0 = <invalid>;
		a2Out = dwArg10;
		a3Out = a3_71;
		a4Out = a4_72;
		a5Out = a5_73;
		s2Out = s2_51;
		s3Out = s3_52;
		s4Out = s4_53;
		s5Out = s5_54;
		return s1_50;
	}
	else
	{
		*(union Eq_2 *) 0x03030373 = a0;
		g_t4200E140 = a0;
		g_t4200E13C = a0;
		g_t4200E138 = a0;
		g_t4200E134 = a0;
		g_t230C85E0 = a0;
		g_t4200E198 = a0;
		g_t4200ED3C = a0;
		a0Out.u0 = <invalid>;
		a2Out = a2;
		a3Out = a3;
		a4Out = 0x02;
		a5Out = 0x4200ECE0;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		return s1;
	}
}

