pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
					Mem917[s0_1058 + 0x00A8:word32] = Mem879[s0_1058 + 0x00A8:int32] + s3_1074;
					word32 a0_1932;
					word32 a1_1933;
					word32 a2_1934;
					word32 a3_1935;
					word32 a4_1936;
					word32 a5_1937;
					word32 a7_1938;
					mbedtls_debug_print_buf(ra, 0x04, s6_904, out a0_1932, out a1_1933, out a2_1934, out a3_1935, out a4_1936, out a5_1937, out a7_1938);
					s5_702 = s5_903 + 0x01;
				}
				else
				{
					a5_1160.u0 = 0x02;
					if (s1_372 != 0x02)
						goto l2308C2F2;
					Eq_2 s0_515 = *(union Eq_2 *) 0x3A;
					sp_173->dw0018 = 0x00;
					Eq_2 a5_519 = *(union Eq_2 *) 0x0E;
					Eq_2 s3_1376 = a5_519 - ((word32) (*((word32) s0_515 + 0x00A8)) + 1 & a5_519);
					if (a5_519 == s3_1376)
						s3_1376.u0 = 0x00;
					Eq_2 a4_524 = 0x00;
					do
					{
						Mem533[Mem526[s0_515 + 0x00A0:int32] + a4_524 + Mem526[s0_515 + 0x00A8:int32]:byte] = SLICE(s3_1376, byte, 0);
						a4_524 = (word32) a4_524 + 1;
					} while (s3_1376 >= a4_524);
					Eq_2 s1_631;
					Eq_2 s0_536 = *((word32) a4_524 + 0x0C);
					int32 s4_539 = (byte) s3_1376.u0 + ((word32) (*((word32) s0_515 + 0x00A8)) + 1);
					*((word32) s0_536 + 0x00A8) = s4_539;
					struct Eq_511595 * a5_537 = (struct Eq_511595 *) 0x01;
					if (a4_524 <= 0x01)
						s1_631 = *((word32) s0_536 + 0x00A0);
					else
					{
						Eq_2 a2_592;
						struct Eq_511600 * a1_593;
						Eq_2 a0_594;
						word32 a6_600;
						word32 t5_607;
						word32 t6_608;
						word32 tp_610;
						word32 t2_1388;
						a4_524();
						s1_1075 = a0_594;
						if (a0_594 != 0x00)
							goto l2308C538;
						struct Eq_511703 * a5_617;
						word32 a1_1967;
						word32 a2_1968;
						word32 a3_1969;
						word32 a4_1970;
						word32 a6_1971;
						word32 a7_1972;
						memcpy(a1_593->ptr0038->t009C, (word32) *((word32) a2_592 + 0x0C) + 24, a2_592, out a1_1967, out a2_1968, out a3_1969, out a4_1970, out a5_617, out a6_1971, out a7_1972);
						struct Eq_511730 * s0_629 = a5_617->ptr0038;
						s1_631 = s0_629->t00A0;
						a5_537 = s0_629->ptr00A8 + a5_617->dw000C / 60;
						s0_629->ptr00A8 = a5_537;
					}
					Eq_2 s0_638 = a5_537->t0038;
					Eq_2 a2_654;
					Eq_2 s4_660;
					Eq_2 s5_661;
					Eq_2 s7_663;
					word32 a1_1973;
					word32 a3_1974;
					word32 a4_1975;
					word32 a5_1976;
					word32 a7_1977;
					word32 s6_1978;
					word32 s8_1979;
					word32 s9_1980;
					word32 s10_1981;
					word32 s11_1982;
					word32 t4_1983;
					mbedtls_debug_print_msg(ra, s0_638, 0x03, &g_t230C7FD0, *((word32) s0_638 + 0x00A8), out a1_1973, out a2_654, out a3_1974, out a4_1975, out a5_1976, out a7_1977, out s4_660, out s5_661, out s6_1978, out s7_663, out s8_1979, out s9_1980, out s10_1981, out s11_1982, out t4_1983);
					word32 a0_674 = *((word32) a2_654 + 0x0C);
					Eq_2 a0_680;
					Eq_2 s4_692;
					word32 s1_1984;
					word32 a1_1985;
					word32 a2_1986;
					word32 a3_1987;
					ra = mbedtls_cipher_crypt(ra, a0_674 + 80, a0_674 + 24, a2_654, s1_631, s4_660, s1_631, (char *) &sp_173->t0024 + 0x0C, s5_661, s7_663, sp_173->t0008, sp_173->t0048, sp_173->t0068, sp_173->t0088, sp_173->t00B4, sp_173->t00D0, sp_173->t00D4, sp_173->t00F8, sp_173->t0128, out s0_1058, out s1_1984, out a0_680, out a1_1985, out a2_1986, out a3_1987, out a5_1160, out s2_1062, out s3_1074, out s4_692, out s5_702);
					s1_1075 = a0_680;
					if (a0_680 != 0x00)
					{
						a5_1112 = a0_680;
						a3_1114.u0 = 1515;
l2308C52C:
						word32 a1_1939;
						word32 a2_1940;
						word32 a3_1941;
						word32 a4_1942;
						word32 a5_1943;
						word32 s4_1944;
						word32 s5_1945;
						word32 s6_1946;
						word32 s7_1947;
						word32 s8_1948;
						word32 s9_1949;
						word32 s10_1950;
						word32 s11_1951;
						mbedtls_debug_print_ret(ra, 0x01, a3_1114, a5_1112, out a1_1939, out a2_1940, out a3_1941, out a4_1942, out a5_1943, out s4_1944, out s5_1945, out s6_1946, out s7_1947, out s8_1948, out s9_1949, out s10_1950, out s11_1951);
l2308C538:
						a5_1102 = s1_1075;
						a3_1104.u0 = 0x00FFFB22;
						goto l2308C548;
					}
					if (s4_692 != a5_1160)
						goto l2308C2F2;
				}
				a5_1160.u0 = 0x01;
				if (s5_702 != 0x01)
					goto l2308C2F2;
				word32 a1_1952;
				word32 a2_1953;
				word32 a3_1954;
				word32 a4_1955;
				word32 a5_1956;
				word32 a7_1957;
				word32 s4_1958;
				word32 s5_1959;
				word32 s6_1960;
				word32 s7_1961;
				word32 s8_1962;
				word32 s9_1963;
				word32 s10_1964;
				word32 s11_1965;
				word32 t4_1966;
				a0_327 = mbedtls_debug_print_msg(ra, s0_1058, 0x02, &g_t230C8038, 0x01, out a1_1952, out a2_1953, out a3_1954, out a4_1955, out a5_1956, out a7_1957, out s4_1958, out s5_1959, out s6_1960, out s7_1961, out s8_1962, out s9_1963, out s10_1964, out s11_1965, out t4_1966);
				Eq_2 a5_967 = *((word32) s0_1058 + 0x00A8);
				**((word32) s0_1058 + 0x0098) = (byte) (a5_967 >> 0x08);
				*((word32) *((word32) s0_1058 + 0x0098) + 1) = (byte) a5_967;
				goto l2308C6D2;
			}
		}
	}
	Eq_2 a4_58 = *((word32) s0_1058 + 0x00A4);
	a5_129 = (struct Eq_510058 *) 22;
	if (a4_58 == 22)
	{
		Eq_2 a5_60 = *((word32) s0_1058 + 0x00A0);
		s1 = (word32) *a5_60;
		if (s1 != 0x00)
		{
			s0_1058 = *((word32) a4_58 + 48);
			if (a4_58 == 0x00)
			{
				word32 a7_1722;
				word32 s5_1723;
				word32 s7_1725;
				word32 s9_1727;
				word32 s10_1728;
				word32 t4_1729;
				word32 s8_1726;
				word32 s6_1724;
				word32 a3_1721;
				mbedtls_debug_print_msg(ra, s0_1058, 0x01, &g_t230C6E20, a5_60, out a1_1084, out a2_1085, out a3_1721, out a4_1087, out a5_1083, out a7_1722, out s4_1091, out s5_1723, out s6_1724, out s7_1725, out s8_1726, out s9_1727, out s10_1728, out s11_1090, out t4_1729);
				s1_1075.u0 = 0xF9000400;
				goto l2308C104;
			}
		}
		*((word32) a5_60 + 1) = (byte) ((word32) s3_1074 - 4 >> 0x10);
		*((word32) *((word32) s0_1058 + 0x00A0) + 2) = (byte) ((word32) s3_1074 - 4 >> 0x08);
		Eq_2 a5_73 = *((word32) s0_1058 + 0x00A0);
		*((word32) a5_73 + 3) = (byte) ((word32) s3_1074 - 4);
		ui32 a5_76 = (word32) *((word32) a5_73 + 116);
		a2_132 = (word32) s3_1074 - 4;
		struct Eq_510195 * s0_102 = *a5_73;
		a5_129 = a5_76 & 0x02;
		if ((a5_76 & 0x02) != 0x00)
		{
			struct Eq_510441 * a0_78 = s0_102->ptr00A0;
			word32 a5_1759;
			word32 a3_1757;
			word32 a4_1758;
			memmove(&a0_78->b0005 + 7, &a0_78->b0004, (word32) s3_1074 - 4, out a3_1757, out a4_1758, out a5_1759);
			struct Eq_510458 * a5_86 = s0_102->ptr00A8;
			struct Eq_510441 * a4_87 = s0_102->ptr00A0;
			s0_102->ptr00A8 = (struct Eq_510458 *) ((char *) a5_86 + 8);
			s3_1074 = (word32) s3_1074 + 8;
			if (s1 != 0x00)
			{
				a4_87->b0004 = (byte) (a5_86->dw0024 >> 8);
				struct Eq_510495 * a5_99 = a4_87->ptr0030->ptr00A0;
				struct Eq_510502 * a4_100 = a4_87->ptr001C;
				a5_99->b0005 = (byte) a4_100;
				s0_102 = a4_100->ptr0030;
				a5_99->dw001D = a5_99->dw001C;
			}
			else
			{
				a4_87->b0004 = 0x00;
				s0_102->ptr00A0->b0005 = 0x00;
			}
			word32 t1_1794;
			word32 a1_1796;
			word32 a2_1797;
			word32 a3_1798;
			word32 a4_1799;
			word32 a5_1800;
			word32 a0_1795;
			ra = memset(ra, &s0_102->ptr00A0->b0005 + 1, 0x00, 0x03, out t1_1794, out a0_1795, out a1_1796, out a2_1797, out a3_1798, out a4_1799, out a5_1800);
			struct Eq_510441 * a0_124 = s0_102->ptr00A0;
			word32 a7_1803;
			word32 a4_1801;
			word32 a6_1802;
			memcpy(&a0_124->b0005 + 4, (char *) a0_124 + 1, 0x03, out a1_131, out a2_132, out a3_133, out a4_1801, out a5_129, out a6_1802, out a7_1803);
			a0_127 = &a0_124->b0005 + 4;
		}
		if (s1 != 0x00)
		{
			word32 s0_145 = a5_129->dw0030;
			<anonymous> * a5_150 = a5_129->ptr00C4;
			word32 a6_192;
			word32 t5_199;
			word32 t6_200;
			word32 t2_1387;
			word32 tp_1386;
			a5_150();
		}
	}
	goto l2308C1B2;
}

// 2308C786: Register Eq_2 mbedtls_ssl_resend(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 (ptr32 (ptr32 Eq_538791))) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_511888) a4Out, Register out Eq_511889 a5Out, Register out ptr32 s2Out, Register out Eq_511891 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out (ptr32 Eq_511897) s10Out, Register out (ptr32 Eq_511898) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_resend(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_538791 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_511888 & a4Out, union Eq_511889 & a5Out, ptr32 & s2Out, union Eq_511891 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, struct Eq_511897 & s10Out, struct Eq_511898 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_511900 * a5_33;
	word32 s4_480;
	word32 s5_481;
	word32 a7_479;
	word32 s6_482;
	word32 s7_483;
	word32 s8_484;
	word32 s9_485;
	word32 s10_486;
	word32 s11_487;
	word32 t4_488;
	struct Eq_511911 * a3_208;
	Eq_2 a4_125;
	Eq_2 a2_128;
	Eq_2 a1_127;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C7BD4, a5, out a1_127, out a2_128, out a3_208, out a4_125, out a5_33, out a7_479, out s4_480, out s5_481, out s6_482, out s7_483, out s8_484, out s9_485, out s10_486, out s11_487, out t4_488);
	ptr32 s2_10 = 0x230C8000;
	Eq_2 s0_51 = a5_33->t0030;
	Eq_2 s1_116 = 0x01;
	Eq_2 a5_113 = (word32) a5_33->b0034;
	if (a5_113 != 0x01)
	{
		Eq_2 a4_65;
		word32 a1_489;
		word32 a2_490;
		word32 a3_491;
		word32 a5_492;
		word32 a7_493;
		word32 s4_494;
		word32 s5_495;
		word32 s6_496;
		word32 s7_497;
		word32 s8_498;
		word32 s9_499;
		word32 s10_500;
		word32 s11_501;
		word32 t4_502;
		mbedtls_debug_print_msg(ra, s0_51, 0x02, &g_t230C7BEC, a5_113, out a1_489, out a2_490, out a3_491, out a4_65, out a5_492, out a7_493, out s4_494, out s5_495, out s6_496, out s7_497, out s8_498, out s9_499, out s10_500, out s11_501, out t4_502);
		Eq_2 a5_81 = *((word32) a4_65 + 56);
		*((word32) a4_65 + 60) = a5_81;
		ssl_swap_epochs(ra, a4_65, a5_81, out a1_127, out a2_128, out a3_208, out a4_125, out a5_113);
		((word32) a5_113 + 52)->u0 = 0x01;
	}
	Eq_511891 s3_108 = 0x01000000;
	byte * s4_109 = (byte *) 22;
	Eq_2 s5_110 = 0x14;
	do
	{
		Eq_511889 a5_249;
		struct Eq_511888 * a4_248;
		ptr32 a3_245;
		ptr32 a1_246;
		struct Eq_511897 * s10_252;
		struct Eq_511898 * s11_253;
		ptr32 s5_255;
		ptr32 s9_259;
		ptr32 s7_257;
		ptr32 s6_256;
		struct Eq_512003 * s0_115 = *((word32) a5_113 + 48);
		Eq_2 a5_117 = *((byte) s1_116.u0 + 60);
		if (s1_116 == 0x00)
		{
			Eq_2 s0_266 = a3_208->t0004;
			if (a3_208 == (struct Eq_511911 *) 0x10)
				((word32) a5_117 + 52)->u0 = 0x03;
			else
			{
				((word32) a5_117 + 52)->u0 = 0x02;
				word32 s1_503;
				word32 a1_504;
				word32 a3_505;
				word32 a4_506;
				word32 s4_507;
				word32 s5_508;
				word32 s6_509;
				word32 s7_510;
				word32 s9_511;
				word32 s10_512;
				word32 s11_513;
				ra = ssl_set_timer(ra, *((word32) a5_117 + 48), a1_127, *((word32) a1_127 + 48), s2, s0, out s0_266, out s1_503, out a1_504, out a3_505, out a4_506, out a5_117, out s4_507, out s5_508, out s6_509, out s7_510, out s9_511, out s10_512, out s11_513);
			}
			word32 a2_531;
			word32 a7_532;
			word32 s4_533;
			word32 s8_534;
			word32 t4_535;
			mbedtls_debug_print_msg(ra, s0_266, 0x02, &g_t230C7C40, a5_117, out a1_246, out a2_531, out a3_245, out a4_248, out a5_249, out a7_532, out s4_533, out s5_255, out s6_256, out s7_257, out s8_534, out s9_259, out s10_252, out s11_253, out t4_535);
			s1_116.u0 = 0x00;
			goto l2308C8A2;
		}
		byte * a5_118 = (word32) *((word32) s1_116 + 8);
		if (a5_118 == s4_109)
		{
			Eq_2 a5_121 = (word32) *a5_118;
			if (a5_121 == s5_110)
			{
				word32 a3_528;
				word32 a4_529;
				word32 a5_530;
				s0_115 = ssl_swap_epochs(ra, a4_125, a5_121, out a1_127, out a2_128, out a3_528, out a4_529, out a5_530);
			}
		}
		struct Eq_512075 * a4_158;
		struct Eq_512076 * a5_159;
		word32 a1_514;
		word32 a2_515;
		word32 a3_516;
		word32 a6_517;
		word32 a7_518;
		memcpy(s0_115->t00A0, a1_127, a2_128, out a1_514, out a2_515, out a3_516, out a4_158, out a5_159, out a6_517, out a7_518);
		struct Eq_512095 * s1_171 = a5_159->ptr0004;
		s0_115->ptr00A8 = a5_159;
		struct Eq_512102 * a5_177 = (word32) s1_171->b0008;
		s0_115->ptr00A4 = a5_177;
		Eq_2 s1_183 = a4_158->t000C;
		Eq_2 s0_184 = a5_177->t0030;
		a4_158->ptr003C = a5_177;
		Eq_2 a5_193;
		word32 a0_519;
		word32 a1_520;
		word32 a2_521;
		word32 a3_522;
		word32 a4_523;
		word32 a7_524;
		mbedtls_debug_print_buf(ra, 0x03, *((word32) s0_184 + 0x00A0), out a0_519, out a1_520, out a2_521, out a3_522, out a4_523, out a5_193, out a7_524);
		Eq_2 a0_231;
		word32 s0_525;
		word32 s1_526;
		word32 s11_527;
		ra = mbedtls_ssl_write_record(ra, s1_183, s0_184, a5_193, mstatus, out s0_525, out s1_526, out a0_231, out a1_127, out a2_128, out a3_208, out a4_125, out a5_113, out s2_10, out s3_108, out s4_109, out s5_110, out s11_527, out mstatus);
		s1_116 = a0_231;
	} while (a0_231 == 0x00);
	word32 a2_536;
	word32 s4_537;
	word32 s8_538;
	mbedtls_debug_print_ret(ra, 0x01, (word32) s3_108 - 1443, a0_231, out a1_246, out a2_536, out a3_245, out a4_248, out a5_249, out s4_537, out s5_255, out s6_256, out s7_257, out s8_538, out s9_259, out s10_252, out s11_253);
l2308C8A2:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_116;
	a0Out = s1_116;
	a1Out = a1_246;
	a2Out = dwArgB8;
	a3Out = a3_245;
	a4Out = a4_248;
	a5Out = a5_249;
	s2Out = s2_10;
	s3Out = s3_108;
	s4Out = dwArg78;
	s5Out = s5_255;
	s6Out = s6_256;
	s7Out = s7_257;
	s9Out = s9_259;
	s10Out = s10_252;
	s11Out = s11_253;
	mstatusOut = mstatus;
	return ra;
}

