pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308CC36: Register Eq_2 mbedtls_ssl_prepare_handshake_record(Register Eq_2 ra, Register (ptr32 Eq_512986) a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handle_message_type
Eq_2 mbedtls_ssl_prepare_handshake_record(Eq_2 ra, struct Eq_512986 * a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a0_23 = a4->t0000;
	ui32 a4_27 = (word32) a4->w0074;
	Eq_2 a3_28 = 0x0C;
	if ((a4_27 & 0x02) == 0x00)
		a3_28.u0 = 0x04;
	ptr32 a1_1283;
	Eq_2 a4_112;
	ptr32 s11_1002;
	Eq_2 s1_1013;
	ptr32 s2_1321 = 0x230C8000;
	if (a5 < a3_28)
	{
		word32 t4_1469;
		word32 s6_1464;
		word32 a7_1461;
		word32 s4_1462;
		word32 a3_1459;
		word32 a5_1460;
		word32 s5_1463;
		word32 a2_1458;
		word32 s9_1467;
		word32 s8_1466;
		word32 s7_1465;
		word32 s10_1468;
		mbedtls_debug_print_msg(ra, a0_23, 0x01, &g_t230C742C, a5, out a1_1283, out a2_1458, out a3_1459, out a4_112, out a5_1460, out a7_1461, out s4_1462, out s5_1463, out s6_1464, out s7_1465, out s8_1466, out s9_1467, out s10_1468, out s11_1002, out t4_1469);
		s1_1013.u0 = ~0x070001FF;
		goto l2308CC84;
	}
	Eq_2 s0_36 = (a4_27 & 0x02)->t0064;
	*((word32) s0_36 + 0x0080) = (byte) a3_28.u0 + (((word32) (a4_27 & 0x02)->b0001 << 16 | (word32) (a4_27 & 0x02)->b0002 << 8) | (word32) (a4_27 & 0x02)->b0003);
	struct Eq_513055 * a5_56;
	word32 a3_59;
	word32 s9_1455;
	word32 s10_1456;
	word32 t4_1457;
	word32 s8_1454;
	word32 s4_1450;
	word32 s6_1452;
	word32 s5_1451;
	word32 a2_1448;
	word32 a7_1449;
	word32 s7_1453;
	Eq_2 a0_55 = mbedtls_debug_print_msg(ra, s0_36, 0x03, &g_t230C744C, a5, out a1_1283, out a2_1448, out a3_59, out a4_112, out a5_56, out a7_1449, out s4_1450, out s5_1451, out s6_1452, out s7_1453, out s8_1454, out s9_1455, out s10_1456, out s11_1002, out t4_1457);
	s3.u0 = 0x01000000;
	if (((word32) a5_56->w0074 & 0x02) == 0x00)
	{
		Eq_2 s0_77 = *((word32) a4_112 + 112);
		Eq_2 a5_78 = *((word32) s0_77 + 0x0080);
		if (a4_112 < a5_78)
		{
			word32 s9_1516;
			word32 s10_1517;
			word32 t4_1518;
			word32 a7_1510;
			word32 a2_1507;
			word32 a3_1508;
			word32 a5_1509;
			word32 s5_1512;
			word32 s7_1514;
			word32 s6_1513;
			word32 s8_1515;
			word32 s4_1511;
			mbedtls_debug_print_msg(ra, s0_77, 0x01, &g_t230C76F8, a5_78, out a1_1283, out a2_1507, out a3_1508, out a4_112, out a5_1509, out a7_1510, out s4_1511, out s5_1512, out s6_1513, out s7_1514, out s8_1515, out s9_1516, out s10_1517, out s11_1002, out t4_1518);
			s1_1013.u0 = ~0x0700007F;
			goto l2308CC84;
		}
		goto l2308CE0A;
	}
	Eq_2 a5_848;
	Eq_2 a3_850;
	Eq_2 s0_107 = *((word32) a0_55 + 100);
	if (a3_59 != 0x00)
	{
		uint32 a5_111 = (word32) *((word32) a0_55 + 5) << 8 | (word32) (*((word32) a0_55 + 4));
		a4_112 = a5_111 << 0x08;
		struct Eq_513169 * a3_115 = ((Eq_583162[]) 32)[a5_111].ptr0000;
		Eq_2 a5_117 = (word32) (word16) (a5_111 >> 8 | a5_111 << 0x08);
		if (a5_111 << 0x08 != a5_117)
		{
			int32 a6_851 = a3_115->dw0040;
			if (a6_851 + -1 == a5_117 && (word32) (*a0_55) != 0x03)
			{
				Eq_2 a5_895;
				word32 a1_1482;
				word32 s6_1489;
				word32 s4_1487;
				word32 a7_1486;
				word32 a4_1485;
				word32 a3_1484;
				word32 a2_1483;
				word32 s5_1488;
				word32 s9_1492;
				word32 s8_1491;
				word32 s7_1490;
				word32 s10_1493;
				word32 t4_1495;
				word32 s11_1494;
				mbedtls_debug_print_msg(ra, s0_107, 0x02, &g_t230C7484, a6_851 + -1, out a1_1482, out a2_1483, out a3_1484, out a4_1485, out a5_895, out a7_1486, out s4_1487, out s5_1488, out s6_1489, out s7_1490, out s8_1491, out s9_1492, out s10_1493, out s11_1494, out t4_1495);
				Eq_2 a0_943;
				word32 a5_1500;
				word32 a2_1498;
				word32 s1_1497;
				word32 s0_1496;
				word32 s4_1501;
				word32 s6_1503;
				word32 a3_1499;
				word32 s5_1502;
				word32 s7_1504;
				word32 s9_1505;
				word32 s10_1506;
				ra = mbedtls_ssl_resend(ra, s0_107, s0_107, a5_895, 0x230C8000, mstatus, dwArgE8, out s0_1496, out s1_1497, out a0_943, out a1_1283, out a2_1498, out a3_1499, out a4_112, out a5_1500, out s2_1321, out s3, out s4_1501, out s5_1502, out s6_1503, out s7_1504, out s9_1505, out s10_1506, out s11_1002, out mstatus);
				s1_1013 = a0_943;
				if (a0_943 != 0x00)
				{
					a5_848 = a0_943;
					a3_850 = (byte) s3.u0 - 956;
					goto l2308CD52;
				}
			}
			else
			{
				word32 a5_1472;
				word32 s7_1477;
				word32 s8_1478;
				word32 a3_1471;
				word32 t4_1481;
				word32 s9_1479;
				word32 s10_1480;
				word32 s6_1476;
				word32 s4_1474;
				word32 s5_1475;
				word32 a7_1473;
				word32 a2_1470;
				mbedtls_debug_print_msg(ra, s0_107, 0x02, &g_t230C74D0, a5_117, out a1_1283, out a2_1470, out a3_1471, out a4_112, out a5_1472, out a7_1473, out s4_1474, out s5_1475, out s6_1476, out s7_1477, out s8_1478, out s9_1479, out s10_1480, out s11_1002, out t4_1481);
			}
			s1_1013.u0 = 0xF9000700;
			goto l2308CC84;
		}
	}
	Eq_2 s0_120 = *((word32) a4_112 + 112);
	Eq_2 a5_121 = *((word32) s0_120 + 0x0080);
	if (a4_112 >= a5_121)
	{
		word32 a4_1522;
		word32 a1_1519;
		word32 a2_1520;
		word32 a3_1521;
		Eq_2 a0_127 = memcmp((word32) a0_55 + 6, 588017072, 0x03, out a1_1519, out a2_1520, out a3_1521, out a4_1522, out a5_121);
		if (a0_127 == 0x00)
		{
			s0_120 = *((word32) a0_127 + 100);
			word32 a2_1583;
			word32 a3_1584;
			if (memcmp((word32) a0_127 + 9, (word32) a0_127 + 1, 0x03, out a1_1283, out a2_1583, out a3_1584, out a4_112, out a5_121) == 0x00)
			{
				s0_120 = *((word32) a5_121 + 48);
				if (a5_121 == 0x00)
					goto l2308CE0A;
				a5_121 = *((word32) a5_121 + 44);
				if (a5_121 == 0x00)
				{
l2308CE0A:
					s1_1013.u0 = 0x00;
					goto l2308CC84;
				}
			}
		}
	}
	struct Eq_274 * a4_723;
	Eq_2 a1_160;
	word32 a3_1524;
	word32 a2_1523;
	word32 s4_1527;
	word32 a7_1526;
	word32 a4_1525;
	word32 s5_1528;
	word32 s6_1529;
	word32 s8_1531;
	word32 s7_1530;
	word32 s11_1534;
	word32 t4_1535;
	word32 s10_1533;
	word32 s9_1532;
	Eq_2 a5_159;
	Eq_2 a0_158 = mbedtls_debug_print_msg(ra, s0_120, 0x02, &g_t230C7514, a5_121, out a1_160, out a2_1523, out a3_1524, out a4_1525, out a5_159, out a7_1526, out s4_1527, out s5_1528, out s6_1529, out s7_1530, out s8_1531, out s9_1532, out s10_1533, out s11_1534, out t4_1535);
	Eq_2 s0_178 = *((word32) a5_159 + 48);
	Eq_2 s4_179 = *((word32) s0_178 + 0x0080);
	Eq_513396 s5_180 = (word32) s4_179 - 0x0C;
	if (a5_159 == 0x00)
	{
		a4_723 = (struct Eq_274 *) &g_t230C753C;
		goto l2308CDC0;
	}
	Eq_2 a5_185;
	if (a0_158 == 0x00)
	{
		Eq_2 a3_226;
		word32 s4_231;
		word32 s9_1558;
		word32 t4_1561;
		word32 a2_1551;
		word32 a5_1553;
		word32 a7_1554;
		word32 a4_1552;
		word32 a1_1550;
		word32 s8_1557;
		word32 s6_1555;
		word32 s7_1556;
		word32 s10_1559;
		word32 s11_1560;
		mbedtls_debug_print_msg(ra, s0_178, 0x02, &g_t230C7568, (word32) s4_179 - 0x0C, out a1_1550, out a2_1551, out a3_226, out a4_1552, out a5_1553, out a7_1554, out s4_231, out s5_180, out s6_1555, out s7_1556, out s8_1557, out s9_1558, out s10_1559, out s11_1560, out t4_1561);
		a5_159.u0 = 0x04000000;
		if (*((word32) s0_178 + 0x0080) > 0x04000000)
		{
			a4_723 = (struct Eq_274 *) &g_t230C7594;
			goto l2308CDC0;
		}
		Eq_2 a4_245 = (s5_180 >> 0x03) + s4_231;
		Eq_2 a5_247 = (word32) a4_245 + (word32) ((s5_180 & 7) != 0x00);
		Eq_2 a1_259;
		struct Eq_513501 * a4_262;
		Eq_2 a5_263;
		word32 s1_1563;
		word32 s0_1562;
		word32 s4_1566;
		word32 s8_1567;
		word32 a2_1564;
		word32 a3_1565;
		ra = mycalloc(ra, 0x01000000, 0x01, a5_247, a3_226, a4_245, a5_247, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_1562, out s1_1563, out a1_259, out a2_1564, out a3_1565, out a4_262, out a5_263, out s2_1321, out s3, out s4_1566, out s8_1567);
		((byte) s3.u0 + 44)->u0 = 0x01;
		Eq_2 s0_277 = a4_262->t0030;
		if (false)
		{
			word32 a1_1604;
			word32 a2_1605;
			word32 a3_1606;
			word32 a4_1607;
			word32 a5_1608;
			word32 a7_1609;
			word32 s4_1610;
			word32 s5_1611;
			word32 s6_1612;
			word32 s7_1613;
			word32 s8_1614;
			word32 s9_1615;
			word32 s10_1616;
			word32 s11_1617;
			word32 t4_1618;
			mbedtls_debug_print_msg(ra, s0_277, 0x01, &g_t230C75B0, a5_263, out a1_1604, out a2_1605, out a3_1606, out a4_1607, out a5_1608, out a7_1609, out s4_1610, out s5_1611, out s6_1612, out s7_1613, out s8_1614, out s9_1615, out s10_1616, out s11_1617, out t4_1618);
			s1_1013.u0 = 0xF8000100;
			goto l2308CDD2;
		}
		word32 a1_1585;
		word32 a2_1586;
		word32 a3_1587;
		word32 a4_1588;
		word32 a5_1589;
		word32 a6_1590;
		word32 a7_1591;
		memcpy(0x01, a1_259, 0x06, out a1_1585, out a2_1586, out a3_1587, out a4_1588, out a5_1589, out a6_1590, out a7_1591);
		word32 a0_300;
		word32 t1_1592;
		word32 a1_1593;
		word32 a2_1594;
		word32 a3_1595;
		word32 a4_1596;
		word32 a5_1597;
		ra = memset(ra, 0x07, 0x00, 0x03, out t1_1592, out a0_300, out a1_1593, out a2_1594, out a3_1595, out a4_1596, out a5_1597);
		word32 a1_1598;
		word32 a2_1599;
		word32 a3_1600;
		word32 a4_1601;
		word32 a6_1602;
		word32 a7_1603;
		memcpy(a0_300 + 0x09, a0_300 + 1, 0x03, out a1_1598, out a2_1599, out a3_1600, out a4_1601, out a5_185, out a6_1602, out a7_1603);
	}
	else
	{
		Eq_2 s0_182 = *((word32) a1_160 + 100);
		word32 a4_1549;
		word32 a3_1548;
		word32 a2_1547;
		word32 a1_1546;
		if (memcmp(a0_158, a1_160, 0x04, out a1_1546, out a2_1547, out a3_1548, out a4_1549, out a5_185) != 0x00)
		{
			word32 a1_1619;
			word32 a2_1620;
			word32 a3_1621;
			word32 a4_1622;
			word32 a5_1623;
			word32 a7_1624;
			word32 s4_1625;
			word32 s5_1626;
			word32 s6_1627;
			word32 s7_1628;
			word32 s8_1629;
			word32 s9_1630;
			word32 s10_1631;
			word32 s11_1632;
			word32 t4_1633;
			mbedtls_debug_print_msg(ra, s0_182, 0x01, &g_t230C75C8, a5_185, out a1_1619, out a2_1620, out a3_1621, out a4_1622, out a5_1623, out a7_1624, out s4_1625, out s5_1626, out s6_1627, out s7_1628, out s8_1629, out s9_1630, out s10_1631, out s11_1632, out t4_1633);
			goto l2308CF3E;
		}
	}
	s3 = (word32) *((word32) a5_185 + 6) << 16 | (word32) (*((word32) a5_185 + 7)) << 8 | (word32) (*((word32) a5_185 + 8));
	Eq_2 s1_347 = (word32) *((word32) a5_185 + 9) << 16 | (word32) (*((word32) a5_185 + 0x0A)) << 8 | (word32) (*((word32) a5_185 + 11));
	Eq_2 s0_331 = *((word32) a5_185 + 100);
	if (s5_180 <u s3 + s1_347)
	{
		word32 a1_1634;
		word32 a2_1635;
		word32 a3_1636;
		word32 a4_1637;
		word32 a5_1638;
		word32 a7_1639;
		word32 s4_1640;
		word32 s5_1641;
		word32 s6_1642;
		word32 s7_1643;
		word32 s8_1644;
		word32 s9_1645;
		word32 s10_1646;
		word32 s11_1647;
		word32 t4_1648;
		mbedtls_debug_print_msg(ra, s0_331, 0x01, &g_t230C75E4, s3, out a1_1634, out a2_1635, out a3_1636, out a4_1637, out a5_1638, out a7_1639, out s4_1640, out s5_1641, out s6_1642, out s7_1643, out s8_1644, out s9_1645, out s10_1646, out s11_1647, out t4_1648);
		goto l2308CF3E;
	}
	if (*((word32) s0_331 + 112) < (word32) s1_347 + 0x0C)
	{
		word32 a1_1667;
		word32 a2_1668;
		word32 a3_1669;
		word32 a4_1670;
		word32 a5_1671;
		word32 a7_1672;
		word32 s4_1673;
		word32 s5_1674;
		word32 s6_1675;
		word32 s7_1676;
		word32 s8_1677;
		word32 s9_1678;
		word32 s10_1679;
		word32 s11_1680;
		word32 t4_1681;
		mbedtls_debug_print_msg(ra, s0_331, 0x01, &g_t230C7610, s1_347, out a1_1667, out a2_1668, out a3_1669, out a4_1670, out a5_1671, out a7_1672, out s4_1673, out s5_1674, out s6_1675, out s7_1676, out s8_1677, out s9_1678, out s10_1679, out s11_1680, out t4_1681);
l2308CF3E:
		s1_1013.u0 = ~0x070001FF;
		goto l2308CDD2;
	}
	struct Eq_513810 * a1_365;
	ptr32 s4_372;
	uint32 s5_373;
	int32 s7_375;
	word32 a2_1649;
	word32 a3_1650;
	word32 a4_1651;
	word32 a5_1652;
	word32 a7_1653;
	word32 s6_1654;
	word32 s8_1655;
	word32 s9_1656;
	word32 s10_1657;
	word32 s11_1658;
	word32 t4_1659;
	mbedtls_debug_print_msg(ra, s0_331, 0x02, &g_t230C7638, s3, out a1_365, out a2_1649, out a3_1650, out a4_1651, out a5_1652, out a7_1653, out s4_372, out s5_373, out s6_1654, out s7_375, out s8_1655, out s9_1656, out s10_1657, out s11_1658, out t4_1659);
	Eq_2 s0_382 = a1_365->t0064;
	word32 a1_1660;
	word32 a2_1661;
	word32 a3_1662;
	word32 a4_1663;
	word32 a5_1664;
	word32 a6_1665;
	word32 a7_1666;
	memcpy((byte) s3.u0 + 0x0C + s7_375, (char *) a1_365 + 0x0C, s1_347, out a1_1660, out a2_1661, out a3_1662, out a4_1663, out a5_1664, out a6_1665, out a7_1666);
	Eq_2 a5_402 = 0x08 - (s3 & 7);
	if (a5_402 != 0x08)
	{
		if (a5_402 >= s1_347)
		{
			Eq_2 s1_469 = a5_402 - s1_347;
			byte * a4_470 = (s3 >> 0x03) + s4_372;
			while (s1_469 != a5_402)
			{
				*a4_470 = (byte) (0x01 << s1_469 | (word32) (*a4_470));
				s1_469 = (word32) s1_469 + 1;
			}
			goto l2308CFC0;
		}
		byte * a4_405 = (s3 >> 0x03) + s4_372;
		s1_347 = (word32) (s3 & 7) + ((word32) s1_347 - 8);
		ui32 a3_407 = (word32) *a4_405;
		s3 += a5_402;
		do
		{
			a5_402 = (word32) a5_402 - 1;
			ui32 a3_415 = a3_407 | 0x01 << a5_402;
			a3_407 = a3_415 & 0x00FF;
		} while (a5_402 != 0x00);
		*a4_405 = (byte) (a3_415 & 0x00FF);
	}
	struct Eq_513910 * a2_421 = s1_347 & 7;
	if (a2_421 != null)
	{
		word32 a5_428 = (s1_347 + s3 >>u 3) + s4_372;
		ui32 a3_430 = (word32) *a5_428;
		s1_347 -= a2_421;
		word32 a4_433 = 0x08 - a2_421;
		do
		{
			ui32 a3_440 = a3_430 | 0x01 << a4_433;
			++a4_433;
			a3_430 = a3_440 & 0x00FF;
		} while (a4_433 != 0x08);
		*a5_428 = (byte) (a3_440 & 0x00FF);
	}
	word32 t1_1691;
	word32 a0_1692;
	word32 a1_1693;
	word32 a2_1694;
	word32 a3_1695;
	word32 a4_1696;
	word32 a5_1697;
	ra = memset(ra, (s3 >> 0x03) + s4_372, 0x00FF, s1_347 >> 0x03, out t1_1691, out a0_1692, out a1_1693, out a2_1694, out a3_1695, out a4_1696, out a5_1697);
l2308CFC0:
	Eq_2 a5_489 = 0x00;
	while (a5_489 != s5_373 >> 0x03)
	{
		if ((word32) *((word32) a5_489 + s4_372) != 0x00FF)
		{
l2308D164:
			word32 a1_1698;
			word32 a2_1699;
			word32 a3_1700;
			word32 a4_1701;
			word32 a5_1702;
			word32 a7_1703;
			word32 s4_1704;
			word32 s5_1705;
			word32 s6_1706;
			word32 s7_1707;
			word32 s8_1708;
			word32 s9_1709;
			word32 s10_1710;
			word32 s11_1711;
			word32 t4_1712;
			mbedtls_debug_print_msg(ra, s0_382, 0x02, &g_t230C7724, a5_489, out a1_1698, out a2_1699, out a3_1700, out a4_1701, out a5_1702, out a7_1703, out s4_1704, out s5_1705, out s6_1706, out s7_1707, out s8_1708, out s9_1709, out s10_1710, out s11_1711, out t4_1712);
			s1_1013.u0 = 0xF9000700;
			goto l2308CDD2;
		}
		a5_489 = (word32) a5_489 + 1;
	}
	uint32 a4_499;
	byte * s4_502 = (word32) a5_489 + s4_372;
	for (a4_499 = 0x00; a4_499 < (s5_373 & 7); ++a4_499)
	{
		int32 a5_511 = (word32) *s4_502 >> 0x07 - a4_499;
		a5_489 = a5_511 & 0x01;
		if ((a5_511 & 0x01) == 0x00)
			goto l2308D164;
	}
	struct Eq_513972 * a2_577;
	struct Eq_513972 * a4_579;
	Eq_2 s6_585;
	word32 a3_1682;
	word32 a7_1683;
	word32 s4_1684;
	word32 s5_1685;
	word32 s7_1686;
	word32 s8_1687;
	word32 s9_1688;
	word32 s10_1689;
	word32 t4_1690;
	Eq_2 a1_576;
	Eq_2 a0_574 = mbedtls_debug_print_msg(ra, s0_382, 0x02, &g_t230C7740, a5_489, out a1_576, out a2_577, out a3_1682, out a4_579, out a5_159, out a7_1683, out s4_1684, out s5_1685, out s6_585, out s7_1686, out s8_1687, out s9_1688, out s10_1689, out s11_1002, out t4_1690);
	s0_178 = *((byte) a5_159.u0 + 112);
	if (s6_585 < a5_159)
	{
		a4_723 = (struct Eq_274 *) &g_t230C7664;
l2308CDC0:
		word32 a2_1569;
		word32 a1_1568;
		word32 a3_1570;
		word32 a4_1571;
		word32 a5_1572;
		word32 a7_1573;
		word32 s4_1574;
		word32 s5_1575;
		word32 s6_1576;
		word32 s7_1577;
		word32 s8_1578;
		word32 s9_1579;
		word32 s10_1580;
		word32 s11_1581;
		word32 t4_1582;
		mbedtls_debug_print_msg(ra, s0_178, 0x01, a4_723, a5_159, out a1_1568, out a2_1569, out a3_1570, out a4_1571, out a5_1572, out a7_1573, out s4_1574, out s5_1575, out s6_1576, out s7_1577, out s8_1578, out s9_1579, out s10_1580, out s11_1581, out t4_1582);
		s1_1013.u0 = ~0x0700007F;
		goto l2308CDD2;
	}
	struct Eq_514009 * s0_595 = a4_579->ptr007C;
	if (a4_579 < a2_577)
	{
		struct Eq_514189 * a3_596 = s0_595->ptr0080;
		a0_574 += a3_596;
		Eq_2 s0_601 = a3_596->t0050;
		struct Eq_514198 * a4_603 = a0_574 - a5_159;
		a4_603->t007C = s0_601;
		Eq_2 a2_599 = a2_577 - a4_579;
		word32 a4_608 = a4_603 + a2_599;
		*((word32) a4_608 + 116) = s0_601;
		word32 a1_602 = a5_159 + a4_579;
		Eq_2 a5_610 = 0x0400013D - (a5_159 - a3_596);
		if (a5_610 < a4_608)
		{
			word32 a1_1736;
			word32 a2_1737;
			word32 a3_1738;
			word32 a4_1739;
			word32 a5_1740;
			word32 a7_1741;
			word32 s4_1742;
			word32 s5_1743;
			word32 s6_1744;
			word32 s7_1745;
			word32 s8_1746;
			word32 s9_1747;
			word32 s10_1748;
			word32 s11_1749;
			word32 t4_1750;
			mbedtls_debug_print_msg(ra, s0_601, 0x01, &g_t230C768C, a5_610, out a1_1736, out a2_1737, out a3_1738, out a4_1739, out a5_1740, out a7_1741, out s4_1742, out s5_1743, out s6_1744, out s7_1745, out s8_1746, out s9_1747, out s10_1748, out s11_1749, out t4_1750);
			s1_1013.u0 = 0xF9000600;
l2308CDD2:
			a5_848 = s1_1013;
			a3_850.u0 = 0x00FFFC5F;
l2308CD52:
			word32 a5_1538;
			word32 a2_1536;
			word32 a3_1537;
			word32 s4_1539;
			word32 s7_1542;
			word32 s9_1544;
			word32 s5_1540;
			word32 s8_1543;
			word32 s6_1541;
			word32 s10_1545;
			mbedtls_debug_print_ret(ra, 0x01, a3_850, a5_848, out a1_1283, out a2_1536, out a3_1537, out a4_112, out a5_1538, out s4_1539, out s5_1540, out s6_1541, out s7_1542, out s8_1543, out s9_1544, out s10_1545, out s11_1002);
l2308CC84:
			0x00 = dwArg0198;
			s1Out = s1_1013;
			a0Out = s1_1013;
			a1Out = a1_1283;
			a4Out = a4_112;
			s2Out = s2_1321;
			s3Out = s3;
			s11Out = s11_1002;
			mstatusOut = mstatus;
			return ra;
		}
		word32 a3_1734;
		word32 a4_1735;
		a1_576 = memmove(a0_574, a1_602, a2_599, out a3_1734, out a4_1735, out a5_159);
	}
	Eq_2 a2_627;
	word32 a1_1713;
	word32 a3_1714;
	word32 a4_1715;
	word32 a5_1716;
	word32 a6_1717;
	word32 a7_1718;
	memcpy(a0_574, a1_576, *((word32) *((byte) a5_159.u0 + 48) + 0x0080), out a1_1713, out a2_627, out a3_1714, out a4_1715, out a5_1716, out a6_1717, out a7_1718);
	Eq_2 a5_661;
	word32 s0_1719;
	word32 s1_1720;
	word32 a0_1721;
	word32 a1_1722;
	word32 a2_1723;
	word32 a3_1724;
	word32 a4_1725;
	word32 a6_1726;
	word32 s4_1727;
	word32 t3_1728;
	vPortFree(a0_574, a2_627, *((word32) a0_574 + 44), mstatus, dwArg0118, dwArg0158, out s0_1719, out s1_1720, out a0_1721, out a1_1722, out a2_1723, out a3_1724, out a4_1725, out a5_661, out a6_1726, out s4_1727, out t3_1728);
	((word32) a5_661 + 44)->u0 = 0x00;
	word32 a0_1729;
	word32 a2_1730;
	word32 a3_1731;
	word32 a5_1732;
	word32 a7_1733;
	mbedtls_debug_print_buf(ra, 0x03, a5_661, out a0_1729, out a1_1283, out a2_1730, out a3_1731, out a4_112, out a5_1732, out a7_1733);
	goto l2308CE0A;
}

// 2308D186: Register Eq_2 mbedtls_ssl_handle_message_type(Register Eq_2 ra, Register (ptr32 Eq_512986) a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack word32 dwArg0188, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_512986) a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_read_record
Eq_2 mbedtls_ssl_handle_message_type(Eq_2 ra, struct Eq_512986 * a4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148, word32 dwArg0188, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, struct Eq_512986 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_141;
	if (a4 == (struct Eq_512986 *) 22)
	{
		ra = mbedtls_ssl_prepare_handshake_record(ra, a4, 22, mstatus, dwArgC8, dwArgD8, dwArg0108, dwArg0148, dwArg0188, out s1, out a0_141, out a1, out a4, out s2, out s3, out s11, out mstatus);
		if (a0_141 != 0x00)
			goto l2308D1AC;
	}
	if (a4 != (struct Eq_512986 *) 0x15)
	{
l2308D1A2:
		a0_141 = 0x00;
		goto l2308D1AC;
	}
	struct Eq_514307 * a5_64;
	word32 t4_352;
	word32 s10_351;
	word32 s9_350;
	word32 s8_349;
	word32 s7_348;
	word32 s6_347;
	word32 s5_346;
	word32 s4_345;
	word32 a7_344;
	word32 a4_343;
	word32 a3_342;
	word32 a2_341;
	mbedtls_debug_print_msg(ra, *(union Eq_2 *) 121, 0x02, &g_t230C7128, (word32) *(union Eq_2 *) 0x15, out a1, out a2_341, out a3_342, out a4_343, out a5_64, out a7_344, out s4_345, out s5_346, out s6_347, out s7_348, out s8_349, out s9_350, out s10_351, out s11, out t4_352);
	s2 = 0x01000000;
	s1 = 0x230C8000;
	Eq_2 s0_82 = a5_64->t0064;
	a4 = (word32) a5_64->b0000;
	if (a4 == (struct Eq_512986 *) 0x02)
	{
		word32 s7_360;
		word32 s8_361;
		word32 s6_359;
		word32 s5_358;
		word32 s4_357;
		word32 a7_356;
		word32 a5_355;
		word32 a3_354;
		word32 a2_353;
		word32 s9_362;
		word32 s10_363;
		word32 t4_364;
		mbedtls_debug_print_msg(ra, s0_82, 0x01, &g_t230C714C, (word32) a5_64->b0001, out a1, out a2_353, out a3_354, out a4, out a5_355, out a7_356, out s4_357, out s5_358, out s6_359, out s7_360, out s8_361, out s9_362, out s10_363, out s11, out t4_364);
		a0_141 = ~0x0700077F;
		goto l2308D1AC;
	}
	if (a4 == (struct Eq_512986 *) 0x01)
	{
		Eq_2 a5_86 = (word32) a5_64->b0001;
		if (a5_86 == 0x00)
		{
			word32 a2_365;
			word32 a3_366;
			word32 a5_367;
			word32 a7_368;
			word32 s4_369;
			word32 s5_370;
			word32 s6_371;
			word32 s7_372;
			word32 s8_373;
			word32 s9_374;
			word32 s10_375;
			word32 t4_376;
			mbedtls_debug_print_msg(ra, s0_82, 0x02, &g_t230C7170, a5_86, out a1, out a2_365, out a3_366, out a4, out a5_367, out a7_368, out s4_369, out s5_370, out s6_371, out s7_372, out s8_373, out s9_374, out s10_375, out s11, out t4_376);
			a0_141 = 0xF8000780;
l2308D1AC:
			0x00 = (int8) dwArg38;
			s1Out = s1;
			a0Out = a0_141;
			a1Out = a1;
			a2Out = dwArg10;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
		a4 = (struct Eq_512986 *) 100;
		if (a5_86 == 100)
		{
			word32 a2_377;
			word32 a3_378;
			word32 a5_379;
			word32 a7_380;
			word32 s4_381;
			word32 s5_382;
			word32 s6_383;
			word32 s7_384;
			word32 s8_385;
			word32 s9_386;
			word32 s10_387;
			word32 t4_388;
			mbedtls_debug_print_msg(ra, s0_82, 0x02, &g_t230C718C, a5_86, out a1, out a2_377, out a3_378, out a4, out a5_379, out a7_380, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11, out t4_388);
			goto l2308D1A2;
		}
	}
	a0_141 = ~0x0600067F;
	goto l2308D1AC;
}

