pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308D750: Register word32 mbedtls_ssl_write(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack word32 dwArgA8, Stack Eq_2 dwArg0108, Register out Eq_2 a0Out, Register out ptr32 a5Out, Register out Eq_2 s2Out)
// Called from:
//      altcp_mbedtls_write
word32 mbedtls_ssl_write(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg84, word32 dwArgA8, Eq_2 dwArg0108, union Eq_2 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 s0_169;
	struct Eq_515822 * a4_39;
	word32 s5_537;
	word32 a7_535;
	word32 s4_536;
	word32 s7_538;
	word32 s10_541;
	word32 s8_539;
	word32 s9_540;
	word32 s11_542;
	word32 t4_543;
	word32 a1_533;
	word32 a2_534;
	struct Eq_490466 * a3_38;
	Eq_2 s6_118;
	ptr32 a5_297;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C7CC8, a5, out a1_533, out a2_534, out a3_38, out a4_39, out a5_297, out a7_535, out s4_536, out s5_537, out s6_118, out s7_538, out s8_539, out s9_540, out s10_541, out s11_542, out t4_543);
	Eq_2 s2_101 = a2;
	if (a0 == 0x00 || a5_297 == 0x00)
	{
		s0_169.u0 = ~0x070000FF;
		goto l2308D7BC;
	}
	Eq_2 s1_103 = a4_39->t0004;
	struct Eq_490493 * a5_57 = (struct Eq_490493 *) 0x10;
	if (a4_39 != (struct Eq_515822 *) 0x10)
	{
		Eq_2 a0_61;
		word32 s5_81;
		word32 a2_545;
		word32 a1_544;
		word32 s4_548;
		word32 a4_546;
		word32 s3_547;
		word32 s7_549;
		ra = mbedtls_ssl_handshake(ra, s1_103, 0x10, mstatus, dwArg38, dwArg84, out s1_103, out a0_61, out a1_544, out a2_545, out a3_38, out a4_546, out a5_57, out s2_101, out s3_547, out s4_548, out s5_81, out s6_118, out s7_549, out mstatus);
		s0_169 = a0_61;
		if (a0_61 != 0x00)
		{
			word32 a1_550;
			word32 s7_557;
			word32 s5_555;
			word32 a3_552;
			word32 a2_551;
			word32 s4_554;
			word32 s9_559;
			word32 s6_556;
			word32 a4_553;
			word32 s8_558;
			word32 s10_560;
			word32 s11_561;
			mbedtls_debug_print_ret(ra, 0x01, s5_81 + -1202, a0_61, out a1_550, out a2_551, out a3_552, out a4_553, out a5_297, out s4_554, out s5_555, out s6_556, out s7_557, out s8_558, out s9_559, out s10_560, out s11_561);
			goto l2308D7BC;
		}
	}
	Eq_2 a5_143;
	struct Eq_274 * a4_178;
	Eq_2 a5_177;
	struct Eq_515873 * a5_99;
	Eq_2 a0_97 = mbedtls_ssl_get_max_frag_len(a3_38, a5_57, out a5_99);
	if (a0_97 < s2_101)
	{
		s1_103 = a5_99->t0000;
		if (((word32) a5_99->w0074 & 0x02) != 0x00)
		{
			a5_177 = s2_101;
			a4_178 = (struct Eq_274 *) &g_t230C7CEC;
			goto l2308D7F8;
		}
		s2_101 = a0_97;
	}
	Eq_2 a5_172;
	Eq_2 a3_174;
	Eq_2 a5_109 = *((word32) s1_103 + 0x00AC);
	if (a5_109 != 0x00)
	{
		Eq_2 a0_183;
		word32 a2_563;
		word32 a1_562;
		word32 a3_564;
		word32 a4_565;
		word32 s3_566;
		word32 s4_567;
		word32 s5_568;
		word32 s7_569;
		word32 s9_570;
		word32 s10_571;
		word32 s11_572;
		mbedtls_ssl_flush_output(ra, s1_103, a5_109, dwArg0108, out s1_103, out a0_183, out a1_562, out a2_563, out a3_564, out a4_565, out a5_143, out s2_101, out s3_566, out s4_567, out s5_568, out s7_569, out s9_570, out s10_571, out s11_572);
		s0_169 = a0_183;
		if (a0_183 != 0x00)
		{
			a5_172 = a0_183;
			a3_174.u0 = 0x01FFFAF4;
			goto l2308D848;
		}
	}
	else
	{
		if (s2_101 > 0x04000130)
		{
			a5_177 = s2_101;
			a4_178 = (struct Eq_274 *) &g_t230C7D34;
l2308D7F8:
			word32 a1_603;
			word32 a2_604;
			word32 a3_605;
			word32 a4_606;
			word32 a7_607;
			word32 s4_608;
			word32 s5_609;
			word32 s6_610;
			word32 s7_611;
			word32 s8_612;
			word32 s9_613;
			word32 s10_614;
			word32 s11_615;
			word32 t4_616;
			mbedtls_debug_print_msg(ra, s1_103, 0x01, a4_178, a5_177, out a1_603, out a2_604, out a3_605, out a4_606, out a5_143, out a7_607, out s4_608, out s5_609, out s6_610, out s7_611, out s8_612, out s9_613, out s10_614, out s11_615, out t4_616);
			s0_169.u0 = ~0x070000FF;
			goto l2308D80A;
		}
		Eq_2 a0_113 = *((word32) s1_103 + 0x00A0);
		((word32) s1_103 + 0x00A4)->u0 = 0x17;
		*((word32) s1_103 + 0x00A8) = s2_101;
		Eq_2 a5_122;
		word32 a1_587;
		word32 a2_588;
		word32 a3_589;
		word32 a4_590;
		word32 a6_591;
		word32 a7_592;
		memcpy(a0_113, s6_118, s2_101, out a1_587, out a2_588, out a3_589, out a4_590, out a5_122, out a6_591, out a7_592);
		Eq_2 a0_164;
		word32 s0_593;
		word32 a1_594;
		word32 a2_595;
		word32 a3_596;
		word32 a4_597;
		word32 s3_598;
		word32 s4_599;
		word32 s5_600;
		word32 s11_601;
		word32 mstatus_602;
		ra = mbedtls_ssl_write_record(ra, s1_103, s1_103, a5_122, mstatus, out s0_593, out s1_103, out a0_164, out a1_594, out a2_595, out a3_596, out a4_597, out a5_143, out s2_101, out s3_598, out s4_599, out s5_600, out s11_601, out mstatus_602);
		s0_169 = a0_164;
		if (a0_164 != 0x00)
		{
			a5_172 = a0_164;
			a3_174.u0 = 0x01FFFB08;
l2308D848:
			word32 a1_617;
			word32 a2_618;
			word32 a3_619;
			word32 a4_620;
			word32 s4_621;
			word32 s5_622;
			word32 s6_623;
			word32 s7_624;
			word32 s8_625;
			word32 s9_626;
			word32 s10_627;
			word32 s11_628;
			mbedtls_debug_print_ret(ra, 0x01, a3_174, a5_172, out a1_617, out a2_618, out a3_619, out a4_620, out a5_143, out s4_621, out s5_622, out s6_623, out s7_624, out s8_625, out s9_626, out s10_627, out s11_628);
l2308D80A:
			word32 a1_573;
			word32 a2_574;
			word32 a3_575;
			word32 a4_576;
			word32 a7_577;
			word32 s4_578;
			word32 s5_579;
			word32 s6_580;
			word32 s7_581;
			word32 s8_582;
			word32 s9_583;
			word32 s10_584;
			word32 s11_585;
			word32 t4_586;
			mbedtls_debug_print_msg(ra, s1_103, 0x02, &g_t230C7D70, a5_143, out a1_573, out a2_574, out a3_575, out a4_576, out a5_297, out a7_577, out s4_578, out s5_579, out s6_580, out s7_581, out s8_582, out s9_583, out s10_584, out s11_585, out t4_586);
l2308D7BC:
			0x00 = dwArgA8;
			a0Out = s0_169;
			a5Out = a5_297;
			s2Out = s2_101;
			return s1;
		}
	}
	s0_169 = s2_101;
	goto l2308D80A;
}

// 2308D8B0: Register (ptr32 ptr32) mbedtls_ssl_read_version(Register ptr32 a0, Register ptr32 a1, Register (ptr32 ptr32) a2, Register Eq_2 a3, Register out (ptr32 ptr32) a5Out)
// Called from:
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_server_step
ptr32 * mbedtls_ssl_read_version(ptr32 a0, ptr32 a1, ptr32 * a2, Eq_2 a3, ptr32 & a5Out)
{
	ptr32 * a5_10;
	ptr32 * a4_14 = (word32) *a3;
	if (a2 == (ptr32 *) 0x01)
	{
		0x0101 - a4_14 = a0;
		a4_14 = (word32) *((word32) a3 + 1);
		a5_10 = 0x0100 - a4_14;
		if (a5_10 == a2)
			a5_10 = (ptr32 *) 0x02;
	}
	else
	{
		*a4_14 = a0;
		a5_10 = (word32) *((word32) a3 + 1);
	}
	*a5_10 = a1;
	a5Out = a5_10;
	return a4_14;
}

