pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
					word32 a4_3459;
					word32 a7_3461;
					word32 a5_3460;
					mbedtls_debug_print_buf(ra, 0x04, a5_914 + a4_918, out a0_935, out a1_937, out a2_938, out a3_1854, out a4_3459, out a5_3460, out a7_3461);
					ui32 a4_950 = 0x00;
					for (a5_761 = null; a2_938 != a5_761; ++a5_761)
					{
						a3_1854 = (word32) (a5_761 + a0_935)[a1_937] ^ (word32) a5_761[(word32) fp - 112];
						a4_950 |= a3_1854;
					}
					if (a4_950 == 0x00 && s2_1043 != 0x00)
						goto l2308DF78;
					goto l2308DE20;
				}
l2308DF78:
				Eq_2 s0_972 = a5_761[112];
				if (a5_761 == null)
				{
					Eq_2 a5_974 = *((word32) s0_972 + 0x0084);
					*((word32) s0_972 + 0x0084) = (word32) a5_974 + 1;
					a5_761 = (word32) a5_974 + 1;
					if (a5_974 <= ~0x01)
						goto l2308E1B6;
					word32 a7_3467;
					word32 s11_3475;
					word32 t4_3476;
					word32 s10_3474;
					word32 s5_3469;
					word32 s6_3470;
					word32 s7_3471;
					word32 s8_3472;
					word32 s9_3473;
					word32 s4_3468;
					word32 a4_3465;
					word32 a5_3466;
					word32 a1_3462;
					word32 a2_3463;
					word32 a3_3464;
					mbedtls_debug_print_msg(ra, s0_972, 0x01, &g_t230C7AF0, (word32) a5_974 + 1, out a1_3462, out a2_3463, out a3_3464, out a4_3465, out a5_3466, out a7_3467, out s4_3468, out s5_3469, out s6_3470, out s7_3471, out s8_3472, out s9_3473, out s10_3474, out s11_3475, out t4_3476);
					goto l2308DE20;
				}
				((word32) s0_972 + 0x0084)->u0 = 0x00;
l2308E1B6:
				ui32 a5_982 = (word32) a5_761[116];
				Eq_2 s0_1001 = a5_761->dw0000;
				uint32 a4_981 = 0x08;
				Eq_2 a5_1003 = a5_982 & 0x02;
				if ((a5_982 & 0x02) != 0x00)
				{
l2308E1C2:
					word32 s6_3483;
					Eq_2 a5_1055;
					Eq_2 s4_1063;
					word32 s7_3484;
					word32 s8_3485;
					word32 s10_3487;
					word32 s11_3488;
					word32 t4_3489;
					word32 s9_3486;
					word32 s5_3482;
					word32 a1_3477;
					word32 a4_3480;
					word32 a7_3481;
					word32 a2_3478;
					word32 a3_3479;
					mbedtls_debug_print_msg(ra, s0_1001, 0x02, &g_t230C7B54, a5_1003, out a1_3477, out a2_3478, out a3_3479, out a4_3480, out a5_1055, out a7_3481, out s4_1063, out s5_3482, out s6_3483, out s7_3484, out s8_3485, out s9_3486, out s10_3487, out s11_3488, out t4_3489);
					word32 a3_3493;
					word32 a7_3494;
					word32 a1_3491;
					word32 a2_3492;
					word32 a0_3490;
					mbedtls_debug_print_buf(ra, 0x04, a5_1055, out a0_3490, out a1_3491, out a2_3492, out a3_3493, out a4_1087, out a5_1083, out a7_3494);
					s2_1043.u0 = 0x01000000;
					Eq_2 s0_1093 = *((word32) a5_1083 + 112);
					if (s4_1063 >= a5_1083)
						goto l2308E274;
					word32 s10_3506;
					word32 s11_3507;
					word32 t4_3508;
					word32 s7_3503;
					word32 s8_3504;
					word32 s9_3505;
					word32 s6_3502;
					word32 a1_3495;
					word32 a2_3496;
					word32 a3_3497;
					word32 a4_3498;
					word32 a7_3499;
					word32 s4_3500;
					word32 s5_3501;
					mbedtls_debug_print_msg(ra, s0_1093, 0x01, &g_t230C78DC, a5_1083, out a1_3495, out a2_3496, out a3_3497, out a4_3498, out a5_1233, out a7_3499, out s4_3500, out s5_3501, out s6_3502, out s7_3503, out s8_3504, out s9_3505, out s10_3506, out s11_3507, out t4_3508);
					s6_1252 = ~0x070001FF;
					goto l2308E06E;
				}
				while (true)
				{
					ui32 a5_987 = (word32) *((word32) a5_1003 + 116);
					a5_1003 = a5_987 & 0x02;
					if ((a5_987 & 0x02) >= a4_981)
						break;
					uint32 a2_992 = a4_981 + -1;
					a3_1854 += a2_992 / 0x0700;
					a5_1003 = (word32) a3_1854->b0000 + 0x01 & 0x00FF;
					a3_1854->b0000 = (byte) a5_1003;
					if (a5_1003 != 0x00)
						break;
					a4_981 = a2_992;
				}
				ui32 a5_1002 = (word32) *((word32) a5_1003 + 116);
				s0_1001 = *a5_1003;
				a5_1003 = a5_1002 & 0x02;
				if (a4_981 != (a5_1002 & 0x02))
					goto l2308E1C2;
				word32 s7_3518;
				word32 s8_3519;
				word32 s9_3520;
				word32 s10_3521;
				word32 s11_3522;
				word32 t4_3523;
				word32 s6_3517;
				word32 a2_3510;
				word32 s4_3515;
				word32 s5_3516;
				word32 a3_3511;
				word32 a5_3513;
				word32 a7_3514;
				word32 a4_3512;
				word32 a1_3509;
				mbedtls_debug_print_msg(ra, s0_1001, 0x01, &g_t230C7B30, a5_1002 & 0x02, out a1_3509, out a2_3510, out a3_3511, out a4_3512, out a5_3513, out a7_3514, out s4_3515, out s5_3516, out s6_3517, out s7_3518, out s8_3519, out s9_3520, out s10_3521, out s11_3522, out t4_3523);
				s6_1042.u0 = 0xF9000480;
			}
			else
			{
l2308DFD8:
				a4_1313 = (struct Eq_274 *) &g_t230C7A64;
l2308DD08:
				word32 a5_3403;
				word32 a7_3404;
				word32 s4_3405;
				word32 s6_3407;
				word32 t4_3413;
				word32 s10_3411;
				word32 s11_3412;
				word32 s7_3408;
				word32 s8_3409;
				word32 s9_3410;
				word32 s5_3406;
				word32 a4_3402;
				word32 a2_3400;
				word32 a3_3401;
				word32 a1_3399;
				mbedtls_debug_print_msg(ra, s0_1320, 0x01, a4_1313, s2_1043, out a1_3399, out a2_3400, out a3_3401, out a4_3402, out a5_3403, out a7_3404, out s4_3405, out s5_3406, out s6_3407, out s7_3408, out s8_3409, out s9_3410, out s10_3411, out s11_3412, out t4_3413);
l2308DE20:
				s6_1042.u0 = ~0x0700017F;
			}
		}
		else
		{
l2308DC76:
l2308DC82:
			word32 s11_3397;
			word32 t4_3398;
			word32 a3_3386;
			word32 s10_3396;
			word32 s8_3394;
			word32 s9_3395;
			word32 s7_3393;
			word32 a5_3388;
			word32 a7_3389;
			word32 s4_3390;
			word32 s5_3391;
			word32 s6_3392;
			word32 a4_3387;
			word32 a1_3384;
			word32 a2_3385;
			mbedtls_debug_print_msg(ra, s0_1320, 0x01, &g_t230C6E20, a5_1393, out a1_3384, out a2_3385, out a3_3386, out a4_3387, out a5_3388, out a7_3389, out s4_3390, out s5_3391, out s6_3392, out s7_3393, out s8_3394, out s9_3395, out s10_3396, out s11_3397, out t4_3398);
			s6_1042.u0 = 0xF9000400;
		}
l2308E052:
		word32 s10_3309;
		word32 s11_3310;
		word32 s7_3306;
		word32 s8_3307;
		word32 s9_3308;
		word32 s5_3305;
		word32 a1_3300;
		word32 a2_3301;
		word32 a3_3302;
		word32 a4_3303;
		word32 s4_3304;
		mbedtls_debug_print_ret(ra, 0x01, 0x00FFFE79, s6_1042, out a1_3300, out a2_3301, out a3_3302, out a4_3303, out a5_1233, out s4_3304, out s5_3305, out s6_1252, out s7_3306, out s8_3307, out s9_3308, out s10_3309, out s11_3310);
l2308E06E:
		if (((word32) a5_1233->w0074 & 0x02) == 0x00 || (s6_1252 & -0x0081) != ~0x070001FF)
			goto l2308D93C;
		s0_1469 = *(union Eq_2 *) ~0x070001FB;
		a5_1471.u0 = ~0x0700020A;
		if (false)
			goto l2308D93C;
		a4_1474 = (struct Eq_274 *) &g_t230C7B90;
l2308DA88:
		word32 s8_3237;
		word32 a1_3227;
		word32 s9_3238;
		word32 a2_3228;
		word32 s5_3234;
		word32 a5_3231;
		word32 a3_3229;
		word32 a7_3232;
		word32 s4_3233;
		word32 a4_3230;
		word32 t4_3241;
		word32 s6_3235;
		word32 s7_3236;
		word32 s10_3239;
		word32 s11_3240;
		a0_1699 = mbedtls_debug_print_msg(ra, s0_1469, 0x01, a4_1474, a5_1471, out a1_3227, out a2_3228, out a3_3229, out a4_3230, out a5_3231, out a7_3232, out s4_3233, out s5_3234, out s6_3235, out s7_3236, out s8_3237, out s9_3238, out s10_3239, out s11_3240, out t4_3241);
	}
	a5_1223 = a0_55;
	a3_1225.u0 = 0x00FFFEE7;
l2308D996:
	word32 s10_3286;
	word32 s11_3287;
	word32 s9_3285;
	word32 s4_3280;
	word32 s7_3283;
	word32 s8_3284;
	word32 s5_3281;
	word32 s6_3282;
	word32 a3_3277;
	word32 a4_3278;
	word32 a5_3279;
	word32 a2_3276;
	word32 a1_3275;
	mbedtls_debug_print_ret(ra, 0x01, a3_1225, a5_1223, out a1_3275, out a2_3276, out a3_3277, out a4_3278, out a5_3279, out s4_3280, out s5_3281, out s6_3282, out s7_3283, out s8_3284, out s9_3285, out s10_3286, out s11_3287);
l2308D93C:
	a0Out = dwLoc18;
	a4Out = dwLoc38;
	s3Out = s3;
	mstatusOut = mstatus;
	return ra;
}

