pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308E2EC: Register Eq_2 mbedtls_ssl_read_record(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack ptr32 dwArg40, Stack word32 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack word32 dwArg0168, Register out Eq_2 a0Out, Register out (ptr32 Eq_518116) a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_518118) a4Out, Register out (ptr32 Eq_518119) a5Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_read
Eq_2 mbedtls_ssl_read_record(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, ptr32 dwArg40, word32 dwArg44, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, word32 dwArg0168, union Eq_2 & a0Out, struct Eq_518116 & a1Out, ptr32 & a3Out, struct Eq_518118 & a4Out, struct Eq_518119 & a5Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a1_316;
	word32 a3_317;
	word32 a4_318;
	word32 a5_319;
	word32 a7_320;
	word32 s4_321;
	word32 s5_322;
	word32 s6_323;
	word32 s7_324;
	word32 s8_325;
	word32 s9_326;
	word32 s10_327;
	word32 t4_328;
	Eq_2 s11_34;
	Eq_2 a2_29;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C77B4, a5, out a1_316, out a2_29, out a3_317, out a4_318, out a5_319, out a7_320, out s4_321, out s5_322, out s6_323, out s7_324, out s8_325, out s9_326, out s10_327, out s11_34, out t4_328);
	Eq_2 s2_48 = 0x230C8000;
	Eq_2 s1_23 = a0;
	do
	{
		ptr32 s9_147;
		ptr32 s7_145;
		ptr32 s5_143;
		struct Eq_518116 * a1_135;
		ptr32 a3_137;
		struct Eq_518118 * a4_138;
		struct Eq_518119 * a5_134;
		Eq_2 a5_154;
		Eq_2 a3_156;
		ptr32 s11_141;
		ptr32 s10_140;
		Eq_2 a0_54;
		struct Eq_512986 * a4_58;
		Eq_2 s3_281;
		ra = mbedtls_ssl_read_record_layer(ra, s1_23, s1_23, a2_29, s2_48, s11_34, mstatus, dwArg10, dwArg14, dwArg38, dwArg40, dwArg44, s1, dwArg78, dwArg88, dwArg94, dwArgA8, dwArgB8, dwArgC8, out a0_54, out a4_58, out s3_281, out mstatus);
		Eq_2 s0_114 = a0_54;
		if (a0_54 != 0x00)
		{
			a5_154 = a0_54;
			a3_156.u0 = 0x00FFFEB0;
			goto l2308E336;
		}
		Eq_2 a0_85;
		word32 a1_86;
		struct Eq_507292 * a4_89;
		ra = mbedtls_ssl_handle_message_type(ra, a4_58, mstatus, dwArg18, dwArgA8, dwArgB8, dwArgE8, dwArg0128, dwArg0168, out s1_23, out a0_85, out a1_86, out a2_29, out a4_89, out s2_48, out s3_281, out s11_34, out mstatus);
		s0_114 = a0_85;
	} while (a0_85 == s3_281);
	if (a0_85 != 0x00)
	{
		a5_154 = a0_85;
		a3_156.u0 = 0x00FFFEBA;
l2308E336:
		word32 a2_329;
		word32 s4_330;
		word32 s6_331;
		word32 s8_332;
		mbedtls_debug_print_ret(ra, 0x01, a3_156, a5_154, out a1_135, out a2_329, out a3_137, out a4_138, out a5_134, out s4_330, out s5_143, out s6_331, out s7_145, out s8_332, out s9_147, out s10_140, out s11_141);
	}
	else
	{
		Eq_2 s1_115 = a4_89->t006C;
		Eq_2 a5_116 = 22;
		if (a4_89 == (struct Eq_507292 *) 22)
			a5_116 = mbedtls_ssl_update_handshake_status(ra, a1_86, a4_89);
		word32 a2_333;
		word32 a7_334;
		word32 s4_335;
		word32 s6_336;
		word32 s8_337;
		word32 t4_338;
		mbedtls_debug_print_msg(ra, s1_115, 0x02, &g_t230C7804, a5_116, out a1_135, out a2_333, out a3_137, out a4_138, out a5_134, out a7_334, out s4_335, out s5_143, out s6_336, out s7_145, out s8_337, out s9_147, out s10_140, out s11_141, out t4_338);
	}
	a0Out = s0_114;
	a1Out = a1_135;
	a3Out = a3_137;
	a4Out = a4_138;
	a5Out = a5_134;
	s3Out = s3_281;
	s4Out = dwArg04;
	s5Out = s5_143;
	s7Out = s7_145;
	s9Out = s9_147;
	s10Out = s10_140;
	s11Out = s11_141;
	mstatusOut = mstatus;
	return ra;
}

// 2308E39C: void mbedtls_ssl_parse_certificate(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_518268) s1, Register (ptr32 Eq_2) a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack ptr32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0114, Stack Eq_2 dwArg0128, Stack word32 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void mbedtls_ssl_parse_certificate(Eq_2 ra, Eq_2 s0, struct Eq_518268 * s1, union Eq_2 * a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, ptr32 dwArg10, word32 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0114, Eq_2 dwArg0128, word32 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_27 = *a5;
	struct Eq_518301 * s5_45;
	word32 a3_1543;
	word32 a5_1545;
	word32 a4_1544;
	word32 a1_1541;
	word32 a2_1542;
	word32 s4_1547;
	word32 s7_1549;
	word32 s6_1548;
	word32 a7_1546;
	word32 s11_1553;
	word32 t4_1554;
	word32 s8_1550;
	word32 s9_1551;
	word32 s10_1552;
	mbedtls_debug_print_msg(ra, a0_27, 0x02, &g_t230C722C, s1->t0074, out a1_1541, out a2_1542, out a3_1543, out a4_1544, out a5_1545, out a7_1546, out s4_1547, out s5_45, out s6_1548, out s7_1549, out s8_1550, out s9_1551, out s10_1552, out s11_1553, out t4_1554);
	word32 a3_54 = (word32) s5_45->b000A;
	Eq_2 s0_34 = a0_27;
	Eq_2 s1_56 = s1 >> 2 & 0x03;
	struct Eq_518349 * a4_58 = a3_54 + -5 & 0x00FF;
	Eq_2 a5_59 = 0x06;
	if (a4_58 <= (struct Eq_518349 *) 0x06)
	{
		uint32 a5_62 = 75 >> a4_58;
		a5_59 = a5_62 & 0x01;
		if ((a5_62 & 0x01) != 0x00)
			goto l2308E40C;
	}
	ui32 a5_67 = (word32) *((word32) a5_59 + 116);
	s0_34 = *a5_59;
	a5_59 = a5_67 & 0x01;
	if ((a5_67 & 0x01) != 0x00)
	{
		a4_58 = (struct Eq_518349 *) 0x07;
		if (a3_54 == 0x07)
			goto l2308E452;
	}
	Eq_2 s0_74 = a4_58->t0030;
	Eq_2 s4_75 = a4_58->t000C;
	if (s4_75 == 0x03)
		s4_75 = s1_56;
	if ((a5_67 & 0x01) != 0x00 && s4_75 == 0x00)
	{
		s0_34 = (a5_67 & 0x01)->t002C;
		*(struct Eq_62008 **) 0xE0 = a5_67 & 0x01;
l2308E40C:
		struct Eq_518392 * a5_864;
		word32 s9_1565;
		word32 a3_1557;
		word32 a2_1556;
		word32 a1_1555;
		word32 s7_1563;
		word32 s6_1562;
		word32 s5_1561;
		word32 a4_1558;
		word32 a7_1559;
		word32 s4_1560;
		word32 s11_1567;
		word32 s8_1564;
		word32 s10_1566;
		word32 t4_1568;
		mbedtls_debug_print_msg(ra, s0_34, 0x02, &g_t230C7244, a5_59, out a1_1555, out a2_1556, out a3_1557, out a4_1558, out a5_864, out a7_1559, out s4_1560, out s5_1561, out s6_1562, out s7_1563, out s8_1564, out s9_1565, out s10_1566, out s11_1567, out t4_1568);
		a5_864->dw0005 = a5_864->dw0004;
		goto l2308E41C;
	}
	Eq_2 a5_352;
	Eq_2 a3_354;
	struct Eq_518437 * a5_108;
	word32 s3_1571;
	word32 a4_1570;
	word32 s9_1574;
	word32 s4_1572;
	word32 s7_1573;
	word32 a3_1569;
	Eq_2 a0_133;
	Eq_2 a1_104;
	Eq_2 s5_120;
	ptr32 mstatus_111;
	Eq_2 s10_115;
	Eq_2 s11_116;
	Eq_2 ra_112 = mbedtls_ssl_read_record(ra, s1_56, s0_74, a5_67 & 0x01, mstatus, s2, s0, dwLoc18, dwArg08, dwArg10, dwArg14, dwArg48, s5, ra, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgF8, dwArg0138, out a0_133, out a1_104, out a3_1569, out a4_1570, out a5_108, out s3_1571, out s4_1572, out s5_120, out s7_1573, out s9_1574, out s10_115, out s11_116, out mstatus_111);
	Eq_2 s1_134 = a0_133;
	if (a0_133 != 0x00)
	{
		a5_352 = a0_133;
		a3_354.u0 = 0x010000BF;
		goto l2308E49E;
	}
	Eq_2 s0_150;
	a5_108->dw0005 = a5_108->dw0004;
	ui32 a5_139 = (word32) a5_108->w0075;
	struct Eq_518493 * a4_140 = a5_139 & 1;
	if ((a5_139 & 1) != 0x00)
	{
		struct Eq_518506 * s0_141 = (a5_139 & 1)->ptr000C;
		if ((a5_139 & 1) != 0x00)
		{
			struct Eq_518514 * a3_143 = s0_141->ptr0080;
			a4_140 = (struct Eq_518493 *) 0x04;
			if ((a5_139 & 0x02) != 0x00)
				a4_140 = (struct Eq_518493 *) 0x0C;
			if (a3_143 == &a4_140->b0000 + 3)
			{
				s0_150 = a3_143->t006C;
				if (a3_143 != (struct Eq_518514 *) 22)
				{
l2308E4DE:
					word32 a7_1580;
					word32 s11_1588;
					word32 s4_1581;
					word32 s9_1586;
					word32 a1_1575;
					word32 a2_1576;
					word32 a3_1577;
					word32 a4_1578;
					word32 a5_1579;
					word32 s10_1587;
					word32 s8_1585;
					word32 s6_1583;
					word32 s7_1584;
					word32 s5_1582;
					word32 t4_1589;
					mbedtls_debug_print_msg(ra_112, s0_150, 0x01, &g_t230C7278, 22, out a1_1575, out a2_1576, out a3_1577, out a4_1578, out a5_1579, out a7_1580, out s4_1581, out s5_1582, out s6_1583, out s7_1584, out s8_1585, out s9_1586, out s10_1587, out s11_1588, out t4_1589);
					goto l2308E41C;
				}
				Eq_2 s0_153 = *((word32) a0_133 + 100);
				if ((word32) *a0_133 != 11)
				{
l2308E558:
					Eq_2 s0_173 = a4_140->t0064;
					Eq_2 a5_174 = 11;
					if ((word32) a4_140->b0000 == 11)
					{
						s0_173 = *(union Eq_2 *) 11;
						Eq_2 a3_177 = *((word32) s0_173 + 0x0080);
						int32 s3_178 = 0x04;
						if (((word32) *(uint16 *) 0x7F & 0x02) != 0x00)
							s3_178 = 0x0C;
						a5_174 = s3_178 + 6;
						if (a3_177 >= a5_174)
						{
							struct Eq_518608 * a4_186 = a4_140 + s3_178 / 112;
							Eq_2 a4_190 = (word32) a4_186->b0000;
							a5_174 = (word32) a4_186->b0001 << 8 | (word32) a4_186->b0002;
							if (a4_190 == 0x00)
							{
								a5_174 = (word32) a5_174 + (s3_178 + 0x03);
								if (a3_177 == a5_174)
								{
									Eq_2 a5_199 = *((word32) a0_133 + 92);
									if (a0_133 != 0x00)
									{
										Eq_2 a0_216;
										Eq_2 a2_218;
										word32 a5_1630;
										word32 s3_1632;
										word32 s4_1633;
										word32 s2_1631;
										word32 s1_1628;
										word32 a1_1629;
										word32 s0_1627;
										word32 s8_1634;
										ra_112 = mbedtls_x509_crt_free(ra_112, a0_133, a1_104, a5_199, mstatus_111, dwArg0108, dwArg0148, out s0_1627, out s1_1628, out a0_216, out a1_1629, out a2_218, out a5_1630, out s2_1631, out s3_1632, out s4_1633, out s8_1634);
										word32 t3_1641;
										word32 s4_1640;
										word32 a6_1639;
										word32 s0_1635;
										word32 a0_1636;
										word32 a1_1637;
										word32 a2_1638;
										vPortFree(a0_216, a2_218, *((word32) a0_216 + 92), mstatus_111, dwArg0128, dwArg0168, out s0_1635, out s1_134, out a0_1636, out a1_1637, out a2_1638, out a3_177, out a4_190, out a5_199, out a6_1639, out s4_1640, out t3_1641);
									}
									struct Eq_518725 * a5_265;
									Eq_2 s0_268;
									word32 s1_269;
									word32 s8_1626;
									word32 a1_1620;
									word32 a3_1622;
									word32 a4_1623;
									word32 s2_1624;
									word32 s4_1625;
									word32 a2_1621;
									struct Eq_518735 * s3_271;
									Eq_2 ra_267 = mycalloc(ra_112, s1_134, 0x01, 308, a3_177, a4_190, a5_199, mstatus_111, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out s0_268, out s1_269, out a1_1620, out a2_1621, out a3_1622, out a4_1623, out a5_265, out s2_1624, out s3_271, out s4_1625, out s8_1626);
									*(word32 *) 0x5D = s1_269;
									if (false)
									{
										word32 s11_1657;
										word32 t4_1658;
										word32 s10_1656;
										word32 s9_1655;
										word32 s8_1654;
										word32 s4_1650;
										word32 s5_1651;
										word32 s6_1652;
										word32 s7_1653;
										word32 a5_1648;
										word32 a7_1649;
										word32 a2_1645;
										word32 a3_1646;
										word32 a4_1647;
										word32 a1_1644;
										mbedtls_debug_print_msg(ra_267, s0_268, 0x01, &g_t230C7CB0, 308, out a1_1644, out a2_1645, out a3_1646, out a4_1647, out a5_1648, out a7_1649, out s4_1650, out s5_1651, out s6_1652, out s7_1653, out s8_1654, out s9_1655, out s10_1656, out s11_1657, out t4_1658);
										goto l2308E41C;
									}
									struct Eq_518802 * s0_279 = a5_265->ptr002C;
									Eq_2 s7_283 = 0x007F;
									Eq_2 s6_284 = ~0x0200062D;
									word32 a3_1642;
									word32 a4_1643;
									struct Eq_518812 * a1_286;
									Eq_2 a0_285;
									struct Eq_518814 * a5_290;
									ra_112 = mbedtls_x509_crt_init(ra_267, 0x01, out a0_285, out a1_286, out a3_1642, out a4_1643, out a5_290);
									do
									{
										struct Eq_518735 * a4_296 = s0_279->dw0080;
										if (s3_271 >= a4_296)
										{
											struct Eq_518869 * a0_374;
											Eq_2 s1_378;
											Eq_2 s9_380;
											Eq_2 a1_386;
											struct Eq_518873 * a2_387;
											Eq_2 s10_391;
											Eq_2 s11_392;
											Eq_518876 s3_393;
											word32 s4_394;
											Eq_2 s7_395;
											struct Eq_518879 * a3_375;
											Eq_2 s0_390;
											Eq_2 a5_384;
											Eq_2 ra_377 = mbedtls_debug_print_crt(ra_112, 0x03, 588018380, a5_290->dw005C, out s0_390, out s1_378, out a0_374, out a1_386, out a2_387, out a3_375, out a5_384, out s3_393, out s4_394, out s7_395, out s9_380, out s10_391, out s11_392);
											if (s4_394 != 0x00)
											{
												Eq_2 s0_402 = a3_375->t0000;
												Eq_2 a5_403 = *((word32) a1_386 + 20);
												if (a1_386 == 0x00)
												{
													a3_375 = a2_387->ptr0054;
													if (a1_386 == 0x00)
													{
														word32 s6_1740;
														word32 t4_1746;
														word32 s7_1741;
														word32 s8_1742;
														word32 s9_1743;
														word32 s10_1744;
														word32 s11_1745;
														word32 a4_1735;
														word32 a5_1736;
														word32 s5_1739;
														word32 a7_1737;
														word32 s4_1738;
														word32 a1_1732;
														word32 a3_1734;
														word32 a2_1733;
														mbedtls_debug_print_msg(ra_377, s0_402, 0x01, &g_t230C72E0, a5_403, out a1_1732, out a2_1733, out a3_1734, out a4_1735, out a5_1736, out a7_1737, out s4_1738, out s5_1739, out s6_1740, out s7_1741, out s8_1742, out s9_1743, out s10_1744, out s11_1745, out t4_1746);
														goto l2308E41C;
													}
												}
												Eq_2 a0_454;
												Eq_2 a5_459;
												struct Eq_518990 * a4_458;
												struct Eq_509899 * s5_471;
												ra_377 = mbedtls_x509_crt_verify_with_profile(ra_377, s1_378, a0_374->t005C, a1_386, a3_375->t0048, a0_374->ptr002C->t00B4, (char *) &a0_374->t005C + 4, a3_375->t0034, a3_375->t0038, s3_393, s7_395, s9_380, s10_391, s11_392, mstatus_111, dwLoc2C, dwLoc08, dwArg28, dwArg78, dwArg88, dwArg98, out a0_454, out a4_458, out a5_459, out s5_471);
												if (a0_454 != 0x00)
												{
													word32 s7_1680;
													word32 s8_1681;
													word32 s9_1682;
													word32 s10_1683;
													word32 s11_1684;
													word32 s4_1678;
													word32 s6_1679;
													word32 a1_1675;
													word32 a2_1676;
													word32 a3_1677;
													mbedtls_debug_print_ret(ra_377, 0x01, 0x01000180, a0_454, out a1_1675, out a2_1676, out a3_1677, out a4_458, out a5_459, out s4_1678, out s5_471, out s6_1679, out s7_1680, out s8_1681, out s9_1682, out s10_1683, out s11_1684);
												}
												Eq_2 s0_514 = *((word32) a5_459 + 44);
												Eq_2 s3_516 = *((word32) a5_459 + 92);
												word32 a5_1674;
												Eq_2 a0_518 = mbedtls_pk_can_do((word32) s3_516 + 188, 0x02, a5_459, out a5_1674);
												if (a0_518 != 0x00)
												{
													Eq_39823 a5_522 = *((word32) s3_516 + 0x00C0);
													Eq_2 a5_527;
													a0_518 = mbedtls_ssl_check_curve((word32) *a5_522, a5_522, out a4_458, out a5_527);
													if (a0_518 != 0x00)
													{
														word32 t4_1704;
														word32 s11_1703;
														word32 s10_1702;
														word32 s9_1701;
														word32 a7_1696;
														word32 s4_1697;
														word32 s6_1698;
														word32 s7_1699;
														word32 s8_1700;
														word32 a3_1694;
														word32 a5_1695;
														word32 a1_1692;
														word32 a2_1693;
														a0_518 = mbedtls_debug_print_msg(ra_377, s0_514, 0x01, &g_t230C7304, a5_527, out a1_1692, out a2_1693, out a3_1694, out a4_458, out a5_1695, out a7_1696, out s4_1697, out s5_471, out s6_1698, out s7_1699, out s8_1700, out s9_1701, out s10_1702, out s11_1703, out t4_1704);
													}
												}
												word32 a0_574;
												Eq_2 a5_579;
												word32 s1_582;
												word32 s8_1691;
												word32 s3_1690;
												word32 s4_585;
												s0_390 = mbedtls_ssl_check_cert_usage(a0_518, s5_471, ~(word32) a4_458->w0074 & 0x01, out s1_582, out a0_574, out a5_579, out s3_1690, out s4_585, out s8_1691);
												if (a0_574 != 0x00)
												{
													word32 t4_1731;
													word32 a7_1723;
													word32 s9_1728;
													word32 s11_1730;
													word32 s10_1729;
													word32 s8_1727;
													word32 s6_1725;
													word32 s7_1726;
													word32 s5_1724;
													word32 a5_1722;
													word32 a1_1718;
													word32 a2_1719;
													word32 a3_1720;
													word32 a4_1721;
													mbedtls_debug_print_msg(ra_377, s0_390, 0x01, &g_t230C7324, a5_579, out a1_1718, out a2_1719, out a3_1720, out a4_1721, out a5_1722, out a7_1723, out s4_585, out s5_1724, out s6_1725, out s7_1726, out s8_1727, out s9_1728, out s10_1729, out s11_1730, out t4_1731);
												}
												a5_384.u0 = 0x01;
											}
											word32 s11_1672;
											word32 t4_1673;
											word32 s10_1671;
											word32 s9_1670;
											word32 s8_1669;
											word32 s4_1665;
											word32 s5_1666;
											word32 s6_1667;
											word32 s7_1668;
											word32 a5_1663;
											word32 a7_1664;
											word32 a2_1660;
											word32 a3_1661;
											word32 a4_1662;
											word32 a1_1659;
											mbedtls_debug_print_msg(ra_377, s0_390, 0x02, &g_t230C7348, a5_384, out a1_1659, out a2_1660, out a3_1661, out a4_1662, out a5_1663, out a7_1664, out s4_1665, out s5_1666, out s6_1667, out s7_1668, out s8_1669, out s9_1670, out s10_1671, out s11_1672, out t4_1673);
											goto l2308E41C;
										}
										a5_174 = a1_286 + s3_271;
										s0_173 = a1_286->dw0064;
										Eq_2 a3_301 = (word32) *a5_174;
										if (a3_301 != 0x00)
											goto l2308E58C;
										Eq_2 a2_305 = (word32) *((word32) a5_174 + 1) << 8 | (word32) (*((word32) a5_174 + 2));
										a5_174 = (char *) s3_271 + 3;
										if (s7_283 >= a2_305 || a4_296 <u a2_305 + a5_174)
											goto l2308E58C;
										word32 s8_1688;
										word32 s9_1689;
										word32 s2_1687;
										word32 a4_1686;
										word32 a2_1685;
										ra_112 = mbedtls_x509_crt_parse_der(ra_112, a4_296->t002C, a0_285, a1_286 + a5_174, a2_305, a3_301, Mem278[a0_285 + 92:word32], a5_174, s5_120, s6_284, s7_283, s10_115, s11_116, mstatus_111, dwLoc2C, s6, s0, dwLoc18, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg94, dwArg98, dwArgB8, dwArgD8, dwArg0114, out s0_279, out a0_285, out a1_286, out a2_1685, out a4_1686, out a5_290, out s2_1687, out s3_271, out s5_120, out s6_284, out s7_283, out s8_1688, out s9_1689, out s10_115, out s11_116, out mstatus_111);
									} while (a0_285 == 0x00 || a0_285 == s6_284);
									a5_352 = a0_285;
									a3_354.u0 = 0x01000138;
l2308E49E:
									word32 s10_1716;
									word32 s11_1717;
									word32 s5_1711;
									word32 s6_1712;
									word32 s9_1715;
									word32 s7_1713;
									word32 s8_1714;
									word32 a3_1707;
									word32 a4_1708;
									word32 s4_1710;
									word32 a5_1709;
									word32 a2_1706;
									word32 a1_1705;
									mbedtls_debug_print_ret(ra_112, 0x01, a3_354, a5_352, out a1_1705, out a2_1706, out a3_1707, out a4_1708, out a5_1709, out s4_1710, out s5_1711, out s6_1712, out s7_1713, out s8_1714, out s9_1715, out s10_1716, out s11_1717);
l2308E41C:
									0x00 = (int8) dwArg0128;
									return;
								}
							}
l2308E58C:
							word32 s6_1613;
							word32 s4_1611;
							word32 s5_1612;
							word32 s10_1617;
							word32 s11_1618;
							word32 t4_1619;
							word32 a2_1606;
							word32 a1_1605;
							word32 a4_1608;
							word32 a5_1609;
							word32 a7_1610;
							word32 a3_1607;
							word32 s8_1615;
							word32 s9_1616;
							word32 s7_1614;
							mbedtls_debug_print_msg(ra_112, s0_173, 0x01, &g_t230C7278, a5_174, out a1_1605, out a2_1606, out a3_1607, out a4_1608, out a5_1609, out a7_1610, out s4_1611, out s5_1612, out s6_1613, out s7_1614, out s8_1615, out s9_1616, out s10_1617, out s11_1618, out t4_1619);
							goto l2308E41C;
						}
					}
					goto l2308E58C;
				}
				Eq_2 a5_161;
				word32 a2_1590;
				word32 a3_1591;
				a0_133 = memcmp(a0_133 + a4_140, 588017072, 0x03, out a1_104, out a2_1590, out a3_1591, out a4_140, out a5_161);
				s1_134 = a0_133;
				if (a0_133 == 0x00)
				{
					word32 a5_744;
					word32 s4_752;
					word32 s6_1598;
					word32 s10_1602;
					word32 a1_1592;
					word32 a7_1596;
					word32 a3_1594;
					word32 a4_1595;
					word32 a2_1593;
					word32 s5_1597;
					word32 s11_1603;
					word32 t4_1604;
					word32 s8_1600;
					word32 s9_1601;
					word32 s7_1599;
					mbedtls_debug_print_msg(ra_112, s0_153, 0x01, &g_t230C7290, a5_161, out a1_1592, out a2_1593, out a3_1594, out a4_1595, out a5_744, out a7_1596, out s4_752, out s5_1597, out s6_1598, out s7_1599, out s8_1600, out s9_1601, out s10_1602, out s11_1603, out t4_1604);
					*(word32 *) 0xA0 = a5_744;
					goto l2308E41C;
				}
			}
		}
	}
	s0_150 = a4_140->t006C;
	if (a4_140 != (struct Eq_518493 *) 22)
		goto l2308E4DE;
	goto l2308E558;
}

