pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308E7D4: void mbedtls_ssl_parse_change_cipher_spec(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack ptr32 dwArg20, Stack word32 dwArg24, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg0148)
void mbedtls_ssl_parse_change_cipher_spec(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, ptr32 dwArg20, word32 dwArg24, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg0148)
{
	Eq_2 a5_27;
	word32 s11_414;
	word32 t4_415;
	word32 s7_410;
	word32 s10_413;
	word32 s8_411;
	word32 s9_412;
	word32 a7_406;
	word32 s6_409;
	word32 s4_407;
	word32 s5_408;
	word32 a1_402;
	word32 a4_405;
	word32 a2_403;
	word32 a3_404;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C7360, a5, out a1_402, out a2_403, out a3_404, out a4_405, out a5_27, out a7_406, out s4_407, out s5_408, out s6_409, out s7_410, out s8_411, out s9_412, out s10_413, out s11_414, out t4_415);
	struct Eq_519389 * a4_50;
	word32 s3_61;
	Eq_2 a0_76;
	word32 a5_418;
	word32 s5_420;
	word32 s7_421;
	word32 s4_419;
	word32 s9_422;
	word32 s11_424;
	word32 mstatus_425;
	word32 s10_423;
	word32 a3_417;
	word32 a1_416;
	Eq_2 ra_126 = mbedtls_ssl_read_record(ra, s1, a0, a5_27, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg20, dwArg24, dwArg58, s1, dwArg74, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArg0108, dwArg0148, out a0_76, out a1_416, out a3_417, out a4_50, out a5_418, out s3_61, out s4_419, out s5_420, out s7_421, out s9_422, out s10_423, out s11_424, out mstatus_425);
	if (a0_76 == 0x00)
	{
		Eq_2 s0_78 = a4_50->t006C;
		if (a4_50 == (struct Eq_519389 *) 0x14)
		{
			Eq_2 s0_215 = *(union Eq_2 *) 0x84;
			if (false)
			{
				s0_215 = *(union Eq_2 *) 101;
				if ((word32) *(union Eq_2 *) 0x01 == 0x14)
				{
					struct Eq_519541 * a5_125;
					struct Eq_519542 * a5_92;
					word32 a1_469;
					word32 a2_470;
					word32 a4_471;
					word32 a7_472;
					word32 s4_473;
					word32 s5_474;
					word32 s6_475;
					word32 s7_476;
					word32 s8_477;
					word32 s9_478;
					word32 s10_479;
					word32 s11_480;
					word32 t4_481;
					struct Eq_519556 * a3_123;
					Eq_2 a0_91 = mbedtls_debug_print_msg(ra_126, s0_215, 0x03, &g_t230C739C, 0x14, out a1_469, out a2_470, out a3_123, out a4_471, out a5_92, out a7_472, out s4_473, out s5_474, out s6_475, out s7_476, out s8_477, out s9_478, out s10_479, out s11_480, out t4_481);
					a5_92->dw0034 = a5_92->dw0040;
					a5_92->dw0020 = a5_92->dw002C;
					Eq_2 s0_114 = a5_92->t0000;
					if (((word32) a5_92->w0074 & 0x02) != 0x00)
					{
						uint32 a5_131 = (word32) *((word32) s0_114 + 0x0078) + 0x01 << 16;
						*((word32) s0_114 + 0x0078) = (word16) (a5_131 >> 16);
						a5_125 = a5_131 >> 16;
						if (a5_131 >> 16 == 0x00)
						{
							word32 a1_487;
							word32 a2_488;
							word32 a3_489;
							word32 a4_490;
							word32 a5_491;
							word32 a7_492;
							word32 s4_493;
							word32 s5_494;
							word32 s6_495;
							word32 s7_496;
							word32 s8_497;
							word32 s9_498;
							word32 s10_499;
							word32 s11_500;
							word32 t4_501;
							mbedtls_debug_print_msg(ra_126, s0_114, 0x01, &g_t230C7E94, a5_131 >> 16, out a1_487, out a2_488, out a3_489, out a4_490, out a5_491, out a7_492, out s4_493, out s5_494, out s6_495, out s7_496, out s8_497, out s9_498, out s10_499, out s11_500, out t4_501);
							return;
						}
					}
					else
					{
						word32 t1_482;
						word32 a0_483;
						word32 a1_484;
						word32 a2_485;
						word32 a4_486;
						ra_126 = memset(ra_126, a0_91, 0x00, 0x08, out t1_482, out a0_483, out a1_484, out a2_485, out a3_123, out a4_486, out a5_125);
					}
					word32 s0_139 = a5_125->dw0060;
					if (a3_123 > (struct Eq_519556 *) 0x01)
					{
						s0_139 = a3_123->dw0040;
						a5_125 += (0x01 - *((word32) (*((union Eq_2 *) 0x0D)) + 16)) / 0x0068;
					}
					a5_125->dw0064 = s0_139;
					Eq_2 s0_148 = a5_125->t0004;
					Eq_2 a5_151 = (char *) a5_125 + 1;
					*((word32) a5_151 + 4) = s0_148;
					word32 a1_502;
					word32 a2_503;
					word32 a3_504;
					word32 a4_505;
					word32 a5_506;
					word32 a7_507;
					word32 s4_508;
					word32 s5_509;
					word32 s6_510;
					word32 s7_511;
					word32 s8_512;
					word32 s9_513;
					word32 s10_514;
					word32 s11_515;
					word32 t4_516;
					mbedtls_debug_print_msg(ra_126, s0_148, 0x02, &g_t230C73D0, a5_151, out a1_502, out a2_503, out a3_504, out a4_505, out a5_506, out a7_507, out s4_508, out s5_509, out s6_510, out s7_511, out s8_512, out s9_513, out s10_514, out s11_515, out t4_516);
					return;
				}
			}
			word32 a1_454;
			word32 a2_455;
			word32 a3_456;
			word32 a4_457;
			word32 a5_458;
			word32 a7_459;
			word32 s4_460;
			word32 s5_461;
			word32 s6_462;
			word32 s7_463;
			word32 s8_464;
			word32 s9_465;
			word32 s10_466;
			word32 s11_467;
			word32 t4_468;
			mbedtls_debug_print_msg(ra_126, s0_215, 0x01, &g_t230C737C, 0x14, out a1_454, out a2_455, out a3_456, out a4_457, out a5_458, out a7_459, out s4_460, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
		}
		else
		{
			word32 a1_439;
			word32 a2_440;
			word32 a3_441;
			word32 a4_442;
			word32 a5_443;
			word32 a7_444;
			word32 s4_445;
			word32 s5_446;
			word32 s6_447;
			word32 s7_448;
			word32 s8_449;
			word32 s9_450;
			word32 s10_451;
			word32 s11_452;
			word32 t4_453;
			mbedtls_debug_print_msg(ra_126, s0_78, 0x01, &g_t230C737C, 0x14, out a1_439, out a2_440, out a3_441, out a4_442, out a5_443, out a7_444, out s4_445, out s5_446, out s6_447, out s7_448, out s8_449, out s9_450, out s10_451, out s11_452, out t4_453);
		}
	}
	else
	{
		word32 a3_428;
		word32 a2_427;
		word32 a1_426;
		word32 a4_429;
		word32 a5_430;
		word32 s4_431;
		word32 s5_432;
		word32 s6_433;
		word32 s7_434;
		word32 s8_435;
		word32 s9_436;
		word32 s10_437;
		word32 s11_438;
		mbedtls_debug_print_ret(ra_126, 0x01, s3_61 + 463, a0_76, out a1_426, out a2_427, out a3_428, out a4_429, out a5_430, out s4_431, out s5_432, out s6_433, out s7_434, out s8_435, out s9_436, out s10_437, out s11_438);
	}
}

