pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308E930: void mbedtls_ssl_parse_finished(Register Eq_2 ra, Register Eq_2 s0, Register word32 s1, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s2, Register word32 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack ptr32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack word32 dwArg0138, Stack Eq_2 dwArg0148)
void mbedtls_ssl_parse_finished(Eq_2 ra, Eq_2 s0, word32 s1, Eq_2 a0, Eq_2 a5, Eq_2 s2, word32 s3, ptr32 mstatus, Eq_2 dwArg08, ptr32 dwArg10, word32 dwArg14, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0128, word32 dwArg0138, Eq_2 dwArg0148)
{
	word32 a5_27;
	struct Eq_519759 * a2_29;
	word32 s4_35;
	word32 s10_548;
	word32 s11_549;
	word32 t4_550;
	word32 a1_539;
	word32 s6_544;
	word32 s8_546;
	word32 s9_547;
	word32 s7_545;
	word32 a3_540;
	word32 a4_541;
	word32 a7_542;
	word32 s5_543;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230C73EC, a5, out a1_539, out a2_29, out a3_540, out a4_541, out a5_27, out a7_542, out s4_35, out s5_543, out s6_544, out s7_545, out s8_546, out s9_547, out s10_548, out s11_549, out t4_550);
	struct Eq_519792 * a5_48 = a2_29->ptr0074;
	<anonymous> * a5_51 = a5_48->ptr00CC;
	Eq_2 ra_60;
	Eq_2 s0_61;
	Eq_2 s1_62;
	Eq_2 a5_65;
	a5_51();
	struct Eq_519804 * a3_84;
	struct Eq_519805 * a4_85;
	ptr32 mstatus_89;
	word32 s4_97;
	Eq_2 a0_111;
	word32 s10_557;
	word32 s11_558;
	word32 s3_553;
	word32 s7_555;
	word32 s9_556;
	word32 s5_554;
	word32 a1_551;
	word32 a5_552;
	Eq_2 ra_197 = mbedtls_ssl_read_record(ra_60, s1_62, s0_61, a5_65, mstatus, s2, s0, dwLoc18, dwArg08, dwArg10, dwArg14, dwArg48, dwArg58, ra, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgF8, dwArg0138, out a0_111, out a1_551, out a3_84, out a4_85, out a5_552, out s3_553, out s4_97, out s5_554, out s7_555, out s9_556, out s10_557, out s11_558, out mstatus_89);
	if (a0_111 != 0x00)
	{
		word32 s6_566;
		word32 s11_571;
		word32 s7_567;
		word32 s8_568;
		word32 s9_569;
		word32 s10_570;
		word32 a4_562;
		word32 s4_564;
		word32 s5_565;
		word32 a5_563;
		word32 a1_559;
		word32 a2_560;
		word32 a3_561;
		mbedtls_debug_print_ret(ra_197, 0x01, s4_97 + 1164, a0_111, out a1_559, out a2_560, out a3_561, out a4_562, out a5_563, out s4_564, out s5_565, out s6_566, out s7_567, out s8_568, out s9_569, out s10_570, out s11_571);
		goto l2308E996;
	}
	Eq_2 s0_113 = a4_85->t006C;
	if (a4_85 != (struct Eq_519805 *) 22)
	{
		word32 s10_584;
		word32 s11_585;
		word32 t4_586;
		word32 a4_575;
		word32 s6_580;
		word32 s8_582;
		word32 s9_583;
		word32 s7_581;
		word32 a5_576;
		word32 a7_577;
		word32 s4_578;
		word32 s5_579;
		word32 a2_573;
		word32 a3_574;
		word32 a1_572;
		mbedtls_debug_print_msg(ra_197, s0_113, 0x01, &g_t230C7400, 22, out a1_572, out a2_573, out a3_574, out a4_575, out a5_576, out a7_577, out s4_578, out s5_579, out s6_580, out s7_581, out s8_582, out s9_583, out s10_584, out s11_585, out t4_586);
		goto l2308E996;
	}
	Eq_2 a6_115 = *((word32) s0_113 + 100);
	Eq_2 a5_116 = 0x14;
	if ((word32) *a6_115 != 0x14)
	{
l2308EA02:
		goto l2308EA10;
	}
	s0_113 = a3_84->t0000;
	Eq_2 t1_120 = *((word32) s0_113 + 0x0080);
	word32 a0_121 = 0x04;
	ui32 a4_122 = (word32) a3_84->w0074;
	if ((a4_122 & 2) != 0x00)
		a0_121 = 0x0C;
	Eq_2 a2_127 = 0x00;
	a5_116.u0 = 0x00;
	if (t1_120 != a0_121 + 0x0C)
		goto l2308EA02;
	do
	{
		a5_116 = (byte) a5_116.u0 + 1;
		a2_127 |= (word32) *((word32) a6_115 + ((word32) a5_116 + a0_121)) ^ (word32) (*((word32) a5_116 + (fp - 44)));
	} while (a5_116 != 0x0C);
	if (a2_127 != 0x00)
	{
l2308EA10:
		word32 t4_601;
		word32 s9_598;
		word32 s11_600;
		word32 s4_593;
		word32 s8_597;
		word32 s10_599;
		word32 s5_594;
		word32 s7_596;
		word32 s6_595;
		word32 a7_592;
		word32 a3_589;
		word32 a5_591;
		word32 a4_590;
		word32 a1_587;
		word32 a2_588;
		mbedtls_debug_print_msg(ra_197, s0_113, 0x01, &g_t230C7400, a5_116, out a1_587, out a2_588, out a3_589, out a4_590, out a5_591, out a7_592, out s4_593, out s5_594, out s6_595, out s7_596, out s8_597, out s9_598, out s10_599, out s11_600, out t4_601);
		goto l2308E996;
	}
	struct Eq_519964 * a5_150;
	Eq_2 s0_147 = *((word32) a5_116 + 48);
	struct Eq_519969 * a5_148 = *((word32) a5_116 + 328);
	if (a5_148 != null)
	{
		if ((a4_122 & 0x01) == 0x00)
		{
			*(union Eq_2 *) 0x0E = s0_147;
			if (((word32) a3_84->w0074 & 0x01) == 0x00)
				goto l2308EA74;
		}
		a5_150 = (struct Eq_519964 *) 0x0F;
	}
	else
	{
		s0_147 = a5_148->t0004;
		a5_150 = (struct Eq_519964 *) ((char *) a5_148 + 1);
	}
	a5_150->t0004 = s0_147;
l2308EA74:
	ui32 a5_169 = (word32) a3_84->w0074;
	Eq_2 a5_170 = a5_169 & 0x02;
	if ((a5_169 & 0x02) != 0x00)
	{
		word32 s10_617;
		ra_197 = mbedtls_ssl_recv_flight_completed(ra_197, a2_127, a5_169 & 0x02, mstatus_89, dwLoc30, dwLoc2C, dwArg0108, dwArg0148, out a5_170, out s10_617);
	}
	word32 s7_611;
	word32 a7_607;
	word32 a5_606;
	word32 a4_605;
	word32 a2_603;
	word32 a3_604;
	word32 s6_610;
	word32 a1_602;
	word32 s5_609;
	word32 s8_612;
	word32 s4_608;
	word32 s9_613;
	word32 s10_614;
	word32 s11_615;
	word32 t4_616;
	mbedtls_debug_print_msg(ra_197, s0_147, 0x02, &g_t230C7418, a5_170, out a1_602, out a2_603, out a3_604, out a4_605, out a5_606, out a7_607, out s4_608, out s5_609, out s6_610, out s7_611, out s8_612, out s9_613, out s10_614, out s11_615, out t4_616);
l2308E996:
	0x00 = dwArg0128;
}

// 2308EAA4: Register Eq_2 mbedtls_ssl_read(Register Eq_2 ra, Register word32 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_490938) s0Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_490941) a4Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_mbedtls_handle_rx_appldata
Eq_2 mbedtls_ssl_read(Eq_2 ra, word32 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArg0108, struct Eq_490938 & s0Out, union Eq_2 & a0Out, ptr32 & a3Out, struct Eq_490941 & a4Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s0_117;
	struct Eq_520087 * sp_194 = fp + ~0x1F;
	if (a0 != 0x00)
	{
		Eq_2 a0_18 = *a5;
		if (a5 != 0x00)
		{
			struct Eq_520100 * a5_34;
			word32 s6_836;
			word32 t4_842;
			word32 s11_841;
			word32 s7_837;
			word32 s8_838;
			word32 s9_839;
			word32 s10_840;
			word32 s5_835;
			word32 a7_834;
			word32 a3_833;
			word32 a2_127;
			Eq_2 a1_134;
			Eq_2 s4_102;
			Eq_2 a0_116 = mbedtls_debug_print_msg(ra, a0_18, 0x02, &g_t230C775C, a5, out a1_134, out a2_127, out a3_833, out a4, out a5_34, out a7_834, out s4_102, out s5_835, out s6_836, out s7_837, out s8_838, out s9_839, out s10_840, out s11_841, out t4_842);
			Eq_2 s2_100 = 0x230C8000;
			s3 = a2;
			Eq_2 s1_52 = a5_34->t0000;
			ui32 a5_53 = (word32) a5_34->w0074;
			if ((a5_53 & 0x02) != 0x00)
			{
				struct Eq_520151 * a5_61;
				word32 s5_844;
				word32 s11_845;
				word32 s1_843;
				mbedtls_ssl_flush_output(ra, s1_52, a5_53 & 0x02, dwArg0108, out s1_843, out a0_116, out a1_134, out a2_127, out a3, out a4, out a5_61, out s2_100, out s3, out s4_102, out s5_844, out s7, out s9, out s10, out s11_845);
				s0_117 = a0_116;
				if (a0_116 != 0x00)
					goto l2308EB44;
				Eq_2 s1_82 = a5_61->t0030;
				if (a5_61 != null)
				{
					a4 = (word32) a5_61->b0034;
					if (a4 == (struct Eq_490941 *) 0x01)
					{
						word32 s5_855;
						word32 s11_857;
						word32 s6_856;
						word32 a5_854;
						word32 s0_852;
						word32 s1_853;
						ra = mbedtls_ssl_resend(ra, a0_116, s1_82, 0x01, s2_100, mstatus, dwArg0108, out s0_852, out s1_853, out a0_116, out a1_134, out a2_127, out a3, out a4, out a5_854, out s2_100, out s3, out s4_102, out s5_855, out s6_856, out s7, out s9, out s10, out s11_857, out mstatus);
						s0_117 = a0_116;
						if (a0_116 != 0x00)
							goto l2308EB44;
					}
				}
			}
			Eq_2 a5_514;
			Eq_2 a3_516;
			Eq_2 s1_120 = a4->t0004;
			Eq_2 a5_121 = 0x10;
			if (a4 != (struct Eq_490941 *) 0x10)
			{
				word32 s5_849;
				word32 s6_850;
				word32 s7_851;
				word32 a5_848;
				word32 a3_847;
				word32 s1_846;
				ra = mbedtls_ssl_handshake(ra, s1_120, 0x10, mstatus, dwArg38, dwArg84, out s1_846, out a0_116, out a1_134, out a2_127, out a3_847, out a4, out a5_848, out s2_100, out s3, out s4_102, out s5_849, out s6_850, out s7_851, out mstatus);
				a5_121.u0 = 0xF9000500;
				s0_117 = a0_116;
				if (a0_116 == 0xF9000500)
				{
					s0_117.u0 = 0x01;
l2308EB58:
					if (a5_121 == 0x00)
					{
						Eq_2 s1_167 = *((byte) a5_121.u0 + 76);
						if (a5_121 != 0x00)
						{
							word32 a0_201;
							word32 a3_204;
							word32 a7_210;
							word32 s10_211;
							word32 s11_212;
							word32 s5_213;
							word32 s6_214;
							word32 s7_215;
							word32 s9_216;
							word32 t0_217;
							word32 t1_218;
							word32 t4_219;
							word32 tp_220;
							word32 t2_222;
							word32 t5_223;
							word32 t6_224;
							word32 gp_225;
							a5_121();
							a5_121.u0 = ~0x00;
							if (a0_201 == ~0x00)
							{
								word32 s11_864;
								word32 s10_863;
								word32 s9_862;
								word32 s7_861;
								word32 a3_858;
								word32 s6_860;
								word32 s5_859;
								ra = ssl_set_timer(ra, s0_117, a1_134, *((word32) a1_134 + 100), sp_194->t0010, sp_194->t0014, out s0_117, out s1_167, out a1_134, out a3_858, out a4, out a5_121, out s4_102, out s5_859, out s6_860, out s7_861, out s9_862, out s10_863, out s11_864);
							}
						}
						if (s0_117 == 0x00)
						{
							Eq_2 a0_290;
							word32 s5_865;
							word32 s11_866;
							ra = mbedtls_ssl_read_record(ra, s1_167, s1_167, a5_121, mstatus, sp_194->t0010, sp_194->t0014, sp_194->t0018, sp_194->t0038, sp_194->ptr0040, sp_194->dw0044, sp_194->t0078, sp_194->t0088, sp_194->t0094, sp_194->t00A8, sp_194->t00B8, sp_194->t00C8, sp_194->t00E8, sp_194->t0128, sp_194->dw0168, out a0_290, out a1_134, out a3, out a4, out a5_121, out s3, out s4_102, out s5_865, out s7, out s9, out s10, out s11_866, out mstatus);
							s0_117 = a0_290;
							if (a0_290 != 0x00)
							{
								if (a0_290 == ~0x0700027F)
									goto l2308EB8A;
								a5_514 = a0_290;
								a3_516.u0 = 0x01FFFA17;
								goto l2308EB14;
							}
						}
						if (a5_121 == 0x00)
						{
							Eq_2 s1_299 = a4->t006C;
							a5_121.u0 = 0x17;
							if (a4 == (struct Eq_490941 *) 0x17)
							{
								Eq_2 a0_334;
								word32 s11_892;
								word32 s5_891;
								ra = mbedtls_ssl_read_record(ra, s1_299, s1_299, 0x17, mstatus, sp_194->t0010, sp_194->t0014, sp_194->t0018, sp_194->t0038, sp_194->ptr0040, sp_194->dw0044, sp_194->t0078, sp_194->t0088, sp_194->t0094, sp_194->t00A8, sp_194->t00B8, sp_194->t00C8, sp_194->t00E8, sp_194->t0128, sp_194->dw0168, out a0_334, out a1_134, out a3, out a4, out a5_121, out s3, out s4_102, out s5_891, out s7, out s9, out s10, out s11_892, out mstatus);
								s0_117 = a0_334;
								if (a0_334 != 0x00)
								{
									if (a0_334 == ~0x0700027F)
									{
l2308EB8A:
										s0_117.u0 = 0x00;
										goto l2308EB44;
									}
									a5_514 = a0_334;
									a3_516.u0 = 33552935;
l2308EB14:
									word32 a1_873;
									word32 a2_874;
									word32 s8_879;
									word32 s5_877;
									word32 s6_878;
									word32 s4_876;
									word32 s11_880;
									word32 a5_875;
									mbedtls_debug_print_ret(ra, 0x01, a3_516, a5_514, out a1_873, out a2_874, out a3, out a4, out a5_875, out s4_876, out s5_877, out s6_878, out s7, out s8_879, out s9, out s10, out s11_880);
									goto l2308EB44;
								}
							}
						}
						Eq_2 s1_338 = *((byte) a5_121.u0 + 0x006C);
						if (a5_121 == 0x15)
						{
							word32 a5_895;
							word32 a1_893;
							word32 s5_898;
							word32 s6_899;
							word32 s4_897;
							word32 a7_896;
							word32 a2_894;
							word32 s8_900;
							word32 s11_901;
							word32 t4_902;
							mbedtls_debug_print_msg(ra, s1_338, 0x02, &g_t230C7764, a5_121, out a1_893, out a2_894, out a3, out a4, out a5_895, out a7_896, out s4_897, out s5_898, out s6_899, out s7, out s8_900, out s9, out s10, out s11_901, out t4_902);
							s0_117.u0 = 0xF9000700;
							goto l2308EB44;
						}
						if (a5_121 != 0x17)
						{
							word32 a1_903;
							word32 a2_904;
							word32 a5_905;
							word32 a7_906;
							word32 s4_907;
							word32 s5_908;
							word32 s6_909;
							word32 s8_910;
							word32 s11_911;
							word32 t4_912;
							mbedtls_debug_print_msg(ra, s1_338, 0x01, &g_t230C778C, a5_121, out a1_903, out a2_904, out a3, out a4, out a5_905, out a7_906, out s4_907, out s5_908, out s6_909, out s7, out s8_910, out s9, out s10, out s11_911, out t4_912);
							s0_117.u0 = ~0x070006FF;
							goto l2308EB44;
						}
						*((byte) a5_121.u0 + 0x0068) = *(union Eq_2 *) 0x1B;
						if (false)
						{
							word32 s1_913;
							word32 a3_914;
							word32 a4_915;
							word32 a5_916;
							word32 s5_917;
							word32 s6_918;
							word32 s7_919;
							word32 s9_920;
							word32 s10_921;
							word32 s11_922;
							ra = ssl_set_timer(ra, s0_117, 0x00, 0x10, sp_194->t0010, sp_194->t0014, out s0_117, out s1_913, out a1_134, out a3_914, out a4_915, out a5_916, out s4_102, out s5_917, out s6_918, out s7_919, out s9_920, out s10_921, out s11_922);
						}
					}
					if (s3 < s0_117)
						s0_117 = s3;
					word32 a7_872;
					word32 a3_869;
					struct Eq_520398 * a4_397;
					word32 a1_867;
					word32 a2_868;
					word32 a6_871;
					word32 a5_870;
					memcpy(s4_102, a1_134, s0_117, out a1_867, out a2_868, out a3_869, out a4_397, out a5_870, out a6_871, out a7_872);
					Eq_2 s1_410 = a4_397->t0070;
					struct Eq_520416 * a4_412 = a4_397 - s0_117;
					a4_412->t0070 = s1_410;
					Eq_2 a5_411 = 0x00;
					if (a4_412 != null)
					{
						s1_410 = *(union Eq_2 *) 0x68;
						a5_411 = s0_117;
					}
					*((word32) a5_411 + 0x0068) = s1_410;
					word32 a2_882;
					word32 s4_885;
					word32 s5_886;
					word32 a5_883;
					word32 a7_884;
					word32 a1_881;
					word32 s6_887;
					word32 t4_890;
					word32 s11_889;
					word32 s8_888;
					mbedtls_debug_print_msg(ra, s1_410, 0x02, &g_t230C77AC, a5_411, out a1_881, out a2_882, out a3, out a4, out a5_883, out a7_884, out s4_885, out s5_886, out s6_887, out s7, out s8_888, out s9, out s10, out s11_889, out t4_890);
l2308EB44:
					s0Out = s1;
					a0Out = s0_117;
					a3Out = a3;
					a4Out = a4;
					s3Out = s3;
					s4Out = dwArg04;
					s7Out = s7;
					s9Out = s9;
					s10Out = s10;
					mstatusOut = mstatus;
					return ra;
				}
				if (a0_116 != 0x00)
				{
					a5_514 = a0_116;
					a3_516.u0 = 0x01FFFA02;
					goto l2308EB14;
				}
			}
			s0_117.u0 = 0x00;
			goto l2308EB58;
		}
	}
	s0_117.u0 = ~0x070000FF;
	goto l2308EB44;
}

// 2308EC82: void mbedtls_ssl_set_calc_verify_md(Register word32 a1, Register (ptr32 Eq_520667) a4)
void mbedtls_ssl_set_calc_verify_md(word32 a1, struct Eq_520667 * a4)
{
	if (a4 != (struct Eq_520667 *) 0x03 || a1 != 0x04)
		return;
	a4->dw00C8 = 587770886;
}

// 2308ECAA: Register Eq_2 mbedtls_zeroize(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out)
// Called from:
//      mbedtls_x509_crt_free
Eq_2 mbedtls_zeroize(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 != a1_5)
	{
		*a0 = 0x00;
		a0 = (word32) a0 + 1;
	}
	a1Out = a1_5;
	return a0;
}

// 2308ECBA: Register Eq_2 x509_memcasecmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out (ptr32 Eq_520691) a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_520691) a5Out, Register out Eq_2 a7Out)
// Called from:
//      x509_name_cmp
//      x509_check_wildcard
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_memcasecmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, struct Eq_520691 & a3Out, union Eq_2 & a4Out, struct Eq_520691 & a5Out, union Eq_2 & a7Out)
{
	Eq_2 a4_23 = 0x00;
	while (a4_23 != a2)
	{
		a5 = CONVERT(Mem0[a0 + a4_23:byte], byte, word32);
		a3 = CONVERT(Mem0[a1 + a4_23:byte], byte, word32);
		int32 t1_15 = a5 ^ a3;
		if (a5 != a3)
		{
			if (t1_15 == 32)
			{
				ui32 a5_18 = (a5 & -33) + -65;
				a5 = a5_18 & 0x00FF;
				if ((a5_18 & 0x00FF) <= 0x19)
					goto l2308ECF6;
			}
			a3Out = a3;
			a4Out.u0 = <invalid>;
			a5Out = a5;
			a7Out.u0 = <invalid>;
			return ~0x00;
		}
l2308ECF6:
		a4_23 = (word32) a4_23 + 1;
	}
	a3Out = a3;
	a4Out.u0 = <invalid>;
	a5Out = a5;
	a7Out.u0 = <invalid>;
	return 0x00;
}

