pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8450, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_839, out a0_830, out a1_2376, out a2_2377, out a3_2378, out a4_2379, out a5_2380, out a7_2381, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2382, out s7_1009, out s8_2383, out s9_2384, out s10_1002, out s11_2385);
									if (a0_830 < 0x00 || a0_830 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_830;
									s1_1017 = (word32) a0_830 + s1_839;
								}
								if ((s5_629 & 2) != 0x00)
								{
									Eq_2 a0_868;
									word32 s1_877;
									word32 s11_2405;
									word32 s9_2404;
									word32 s8_2403;
									word32 s6_2402;
									word32 a7_2401;
									word32 a5_2400;
									word32 a4_2399;
									word32 a3_2398;
									word32 a2_2397;
									word32 a1_2396;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C845C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_877, out a0_868, out a1_2396, out a2_2397, out a3_2398, out a4_2399, out a5_2400, out a7_2401, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2402, out s7_1009, out s8_2403, out s9_2404, out s10_1002, out s11_2405);
									if (a0_868 < 0x00 || a0_868 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_868;
									s1_1017 = (word32) a0_868 + s1_877;
								}
								if ((s5_629 & 1) != 0x00)
								{
									Eq_2 a0_906;
									word32 s1_915;
									word32 s11_2466;
									word32 s9_2465;
									word32 s8_2464;
									word32 s6_2463;
									word32 s5_2462;
									word32 a7_2461;
									word32 a5_2460;
									word32 a4_2459;
									word32 a3_2458;
									word32 a2_2457;
									word32 a1_2456;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8468, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_915, out a0_906, out a1_2456, out a2_2457, out a3_2458, out a4_2459, out a5_2460, out a7_2461, out s2_1004, out s3_1005, out s4_1006, out s5_2462, out s6_2463, out s7_1009, out s8_2464, out s9_2465, out s10_1002, out s11_2466);
									if (a0_906 < 0x00 || a0_906 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_906;
									s1_1017 = (word32) a0_906 + s1_915;
								}
							}
							if ((s2_1004->dw00F8 & 0x04) != 0x00)
							{
								Eq_2 a0_959;
								word32 s1_968;
								word32 a7_2300;
								word32 s5_2301;
								word32 s6_2302;
								word32 s8_2303;
								word32 s9_2304;
								word32 s11_2305;
								word32 a5_2299;
								word32 a4_2298;
								word32 a3_2297;
								word32 a2_2296;
								word32 a1_2295;
								ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C847C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_968, out a0_959, out a1_2295, out a2_2296, out a3_2297, out a4_2298, out a5_2299, out a7_2300, out s2_1004, out s3_1005, out s4_1006, out s5_2301, out s6_2302, out s7_1009, out s8_2303, out s9_2304, out s10_1002, out s11_2305);
								if (a0_959 < 0x00 || a0_959 >= s0_100)
									goto l2308EE96;
								int32 s5_1007 = s2_1004->dw0104;
								s0_100 -= a0_959;
								s1_1017 = (word32) a0_959 + s1_968;
								if ((s5_1007 & 0x0080) != 0x00)
								{
									Eq_2 a0_992;
									word32 s1_1001;
									word32 s9_2314;
									word32 s11_2315;
									word32 s8_2313;
									word32 s6_2312;
									word32 a4_2309;
									word32 a5_2310;
									word32 a7_2311;
									word32 a3_2308;
									word32 a2_2307;
									word32 a1_2306;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8498, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1001, out a0_992, out a1_2306, out a2_2307, out a3_2308, out a4_2309, out a5_2310, out a7_2311, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2312, out s7_1009, out s8_2313, out s9_2314, out s10_1002, out s11_2315);
									if (a0_992 < 0x00 || a0_992 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_992;
									s1_1017 = (word32) a0_992 + s1_1001;
								}
								if ((s5_1007 & 64) != 0x00)
								{
									Eq_2 a0_1030;
									word32 s1_1039;
									word32 s11_2335;
									word32 a3_2328;
									word32 a4_2329;
									word32 a5_2330;
									word32 a7_2331;
									word32 s6_2332;
									word32 s8_2333;
									word32 s9_2334;
									word32 a2_2327;
									word32 a1_2326;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C84AC, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1039, out a0_1030, out a1_2326, out a2_2327, out a3_2328, out a4_2329, out a5_2330, out a7_2331, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2332, out s7_1009, out s8_2333, out s9_2334, out s10_1002, out s11_2335);
									if (a0_1030 < 0x00 || a0_1030 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1030;
									s1_1017 = (word32) a0_1030 + s1_1039;
								}
								if ((s5_1007 & 32) != 0x00)
								{
									Eq_2 a0_1068;
									word32 s1_1077;
									word32 s11_2355;
									word32 s9_2354;
									word32 s8_2353;
									word32 s6_2352;
									word32 a7_2351;
									word32 a5_2350;
									word32 a4_2349;
									word32 a3_2348;
									word32 a2_2347;
									word32 a1_2346;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C84C0, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1077, out a0_1068, out a1_2346, out a2_2347, out a3_2348, out a4_2349, out a5_2350, out a7_2351, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2352, out s7_1009, out s8_2353, out s9_2354, out s10_1002, out s11_2355);
									if (a0_1068 < 0x00 || a0_1068 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1068;
									s1_1017 = (word32) a0_1068 + s1_1077;
								}
								if ((s5_1007 & 16) != 0x00)
								{
									Eq_2 a0_1106;
									word32 s1_1115;
									word32 s11_2375;
									word32 s9_2374;
									word32 s8_2373;
									word32 s6_2372;
									word32 a7_2371;
									word32 a5_2370;
									word32 a4_2369;
									word32 a3_2368;
									word32 a2_2367;
									word32 a1_2366;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C84D4, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1115, out a0_1106, out a1_2366, out a2_2367, out a3_2368, out a4_2369, out a5_2370, out a7_2371, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2372, out s7_1009, out s8_2373, out s9_2374, out s10_1002, out s11_2375);
									if (a0_1106 < 0x00 || a0_1106 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1106;
									s1_1017 = (word32) a0_1106 + s1_1115;
								}
								if ((s5_1007 & 8) != 0x00)
								{
									Eq_2 a0_1144;
									word32 s1_1153;
									word32 s11_2395;
									word32 s9_2394;
									word32 s8_2393;
									word32 s6_2392;
									word32 a7_2391;
									word32 a5_2390;
									word32 a4_2389;
									word32 a3_2388;
									word32 a2_2387;
									word32 a1_2386;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C84E8, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1153, out a0_1144, out a1_2386, out a2_2387, out a3_2388, out a4_2389, out a5_2390, out a7_2391, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2392, out s7_1009, out s8_2393, out s9_2394, out s10_1002, out s11_2395);
									if (a0_1144 < 0x00 || a0_1144 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1144;
									s1_1017 = (word32) a0_1144 + s1_1153;
								}
								if ((s5_1007 & 4) != 0x00)
								{
									Eq_2 a0_1182;
									word32 s1_1191;
									word32 s11_2445;
									word32 s9_2444;
									word32 s8_2443;
									word32 s6_2442;
									word32 a7_2441;
									word32 a5_2440;
									word32 a4_2439;
									word32 a3_2438;
									word32 a2_2437;
									word32 a1_2436;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C84F8, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1191, out a0_1182, out a1_2436, out a2_2437, out a3_2438, out a4_2439, out a5_2440, out a7_2441, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2442, out s7_1009, out s8_2443, out s9_2444, out s10_1002, out s11_2445);
									if (a0_1182 < 0x00 || a0_1182 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1182;
									s1_1017 = (word32) a0_1182 + s1_1191;
								}
								if ((s5_1007 & 2) != 0x00)
								{
									Eq_2 a0_1220;
									word32 s1_1229;
									word32 s11_2455;
									word32 s9_2454;
									word32 s8_2453;
									word32 s6_2452;
									word32 a7_2451;
									word32 a5_2450;
									word32 a4_2449;
									word32 a3_2448;
									word32 a2_2447;
									word32 a1_2446;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8508, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1229, out a0_1220, out a1_2446, out a2_2447, out a3_2448, out a4_2449, out a5_2450, out a7_2451, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2452, out s7_1009, out s8_2453, out s9_2454, out s10_1002, out s11_2455);
									if (a0_1220 < 0x00 || a0_1220 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1220;
									s1_1017 = (word32) a0_1220 + s1_1229;
								}
								if ((s5_1007 & 1) != 0x00)
								{
									word32 a7_2472;
									word32 a4_2470;
									word32 a3_2469;
									word32 s9_2475;
									word32 s11_2476;
									word32 s8_2474;
									word32 s6_2473;
									Eq_2 a0_1258;
									word32 s1_1267;
									word32 a5_2471;
									word32 a2_2468;
									word32 a1_2467;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8514, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1267, out a0_1258, out a1_2467, out a2_2468, out a3_2469, out a4_2470, out a5_2471, out a7_2472, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2473, out s7_1009, out s8_2474, out s9_2475, out s10_1002, out s11_2476);
									if (a0_1258 < 0x00 || a0_1258 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1258;
									s1_1017 = (word32) a0_1258 + s1_1267;
								}
								if (s5_1007 << 0x10 < 0x00)
								{
									word32 a3_2479;
									word32 a2_2478;
									word32 a4_2480;
									word32 s6_2484;
									word32 a1_2477;
									word32 s5_2483;
									word32 s11_2487;
									word32 a7_2482;
									word32 a5_2481;
									word32 s9_2486;
									word32 s8_2485;
									Eq_2 a0_1296;
									word32 s1_1305;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8524, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1305, out a0_1296, out a1_2477, out a2_2478, out a3_2479, out a4_2480, out a5_2481, out a7_2482, out s2_1004, out s3_1005, out s4_1006, out s5_2483, out s6_2484, out s7_1009, out s8_2485, out s9_2486, out s10_1002, out s11_2487);
									if (a0_1296 < 0x00 || a0_1296 >= s0_100)
										goto l2308EE96;
									s0_100 -= a0_1296;
									s1_1017 = (word32) a0_1296 + s1_1305;
								}
							}
							if (s2_1004->dw00F8 << 0x14 >= 0x00)
							{
l2308F4F6:
								Eq_2 a0_1451;
								word32 s11_2417;
								word32 s9_2416;
								word32 s8_2415;
								word32 s6_2414;
								word32 s5_2413;
								word32 a7_2412;
								word32 a5_2411;
								word32 a4_2410;
								word32 a3_2409;
								word32 a2_2408;
								word32 a1_2407;
								word32 s1_2406;
								snprintf(ra_1027, s1_1017, s0_100, &g_b230C6900, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_2406, out a0_1451, out a1_2407, out a2_2408, out a3_2409, out a4_2410, out a5_2411, out a7_2412, out s2_1004, out s3_1005, out s4_1006, out s5_2413, out s6_2414, out s7_1009, out s8_2415, out s9_2416, out s10_1002, out s11_2417);
								if (a0_1451 >= 0x00 && a0_1451 < s0_100)
									goto l2308EEA2;
								goto l2308EE96;
							}
							Eq_2 a0_1351;
							word32 s11_2427;
							word32 s9_2426;
							word32 s8_2425;
							word32 s6_2424;
							word32 s5_2423;
							word32 a7_2422;
							word32 a4_2421;
							word32 a3_2420;
							word32 a1_2419;
							word32 s1_2418;
							Eq_2 a5_1356;
							Eq_2 a2_1353;
							ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t230C8534, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_2418, out a0_1351, out a1_2419, out a2_1353, out a3_2420, out a4_2421, out a5_1356, out a7_2422, out s2_1004, out s3_1005, out s4_1006, out s5_2423, out s6_2424, out s7_1009, out s8_2425, out s9_2426, out s10_1002, out s11_2427);
							if (a0_1351 >= 0x00 && a0_1351 < s0_100)
							{
								Eq_2 s2_1379 = &s2_1004->dw0104 + 1;
								word32 s6_1382 = 0x230C0000;
								do
								{
									word32 a0_1392;
									Eq_2 s1_1398 = mbedtls_oid_get_extended_key_usage(s2_1379, fp + -56, a2_1353, a5_1356, dwLoc28, out a0_1392);
									Eq_2 a0_1415;
									word32 s1_1424;
									word32 s11_2435;
									word32 s9_2434;
									word32 s8_2433;
									word32 s5_2432;
									word32 a7_2431;
									word32 a4_2430;
									word32 a3_2429;
									word32 a1_2428;
									ra_1027 = snprintf(ra_1027, s1_1398, dwArg0174, s6_1382 + -0x06AC, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1424, out a0_1415, out a1_2428, out a2_1353, out a3_2429, out a4_2430, out a5_1356, out a7_2431, out s2_1004, out s3_1005, out s4_1006, out s5_2432, out s6_1382, out s7_1009, out s8_2433, out s9_2434, out s10_1002, out s11_2435);
									if (a0_1415 < 0x00 || a0_1415 >= s0_100)
										goto l2308EE96;
									s2_1379 = s2_1004->t000C;
									s0_100 -= a0_1415;
									s1_1017 = (word32) a0_1415 + s1_1424;
								} while (s2_1379 != 0x00);
								goto l2308F4F6;
							}
						}
					}
				}
			}
		}
	}
l2308EE96:
	goto l2308EEA2;
}

// 2308F534: Register Eq_2 mbedtls_x509_crt_check_key_usage(Register Eq_2 a0, Register int32 a1, Register out Eq_509918 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_check_cert_usage
//      x509_crt_check_parent
Eq_2 mbedtls_x509_crt_check_key_usage(Eq_2 a0, int32 a1, union Eq_509918 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_5 = *((word32) a0 + 0x00F8);
	Eq_2 a5_18 = a5_5 & 0x04;
	if ((a5_5 & 0x04) != 0x00)
	{
		a4 = *((word32) a0 + 260);
		a3 = a1 & ~0x08000001 & a4;
		if ((a1 & ~0x08000001) != a3)
		{
l2308F560:
			a5_18.u0 = ~0x020007FF;
			goto l2308F566;
		}
		a3 = a1 & 0x08000001;
		a5_18.u0 = 0x00;
		if ((a1 & 0x08000001) != ((a1 | a4) & 0x08000001))
			goto l2308F560;
	}
l2308F566:
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_18;
	return a5_18;
}

// 2308F56A: Register word32 x509_crt_check_parent(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_522767 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out (ptr32 Eq_522771) s2Out, Register out (ptr32 Eq_522772) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
word32 x509_crt_check_parent(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_522767 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, struct Eq_522771 & s2Out, struct Eq_522772 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 s0_44;
	ptr32 a0_26;
	Eq_2 a1_27;
	ptr32 a6_32;
	ptr32 a7_33;
	struct Eq_522771 * s2_36;
	ptr32 s4_38;
	ptr32 s8_39;
	word32 a2_175;
	Eq_2 a5_132;
	Eq_522767 a4_128;
	ptr32 a3_124;
	struct Eq_522772 * s3_148;
	Eq_2 s1_142 = x509_name_cmp((word32) a0 + 76, (word32) a1 + 0x006C, a2, a4, a5, out a0_26, out a1_27, out a2_175, out a3_124, out a4_128, out a5_132, out a6_32, out a7_33, out s2_36, out s3_148, out s4_38, out s8_39);
	if (a0_26 != 0x00)
	{
l2308F590:
		s0_44 = ~0x00;
		goto l2308F592;
	}
	if (a2 != 0x00)
	{
		s0_44 = a0_26;
		s3_148 = (struct Eq_522772 *) *((word32) s1_142 + 24);
		if (a3_124 != 0x00)
		{
			Eq_2 a2_46 = s2_36->t0004;
			s1_142 = *((word32) a5_132 + 4);
			if (a2_46 == a5_132)
			{
				s1_142 = *((word32) a1_27 + 8);
				word32 a1_176;
				word32 a2_177;
				if (memcmp(s2_36->t0008, a1_27, a2_46, out a1_176, out a2_177, out a3_124, out a4_128, out a5_132) == 0x00)
					goto l2308F592;
			}
		}
		a5_132.u0 = 0x02;
		if (s3_148 <= (struct Eq_522772 *) 0x02)
			goto l2308F592;
	}
	a5_132 = *((word32) s1_142 + 252);
	if (a5_132 == 0x00)
		goto l2308F590;
	s0_44 = 0x00 - (word32) (mbedtls_x509_crt_check_key_usage(s1_142, 0x04, out a3_124, out a4_128, out a5_132) != 0x00);
l2308F592:
	0x00 = (int8) dwArg0128;
	s1Out = s1_142;
	a0Out = s0_44;
	a2Out = dwArg0100;
	a3Out = a3_124;
	a4Out = a4_128;
	a5Out = a5_132;
	a6Out = a6_32;
	a7Out = a7_33;
	s2Out = s2_36;
	s3Out = s3_148;
	s4Out = s4_38;
	s8Out = s8_39;
	return dwArgE4;
}

// 2308F5E4: Register Eq_2 x509_crt_verify_top.isra.7(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_518876 a7, Register Eq_2 s3, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a6Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_518876 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_crt_verify_top.isra.7(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_518876 a7, Eq_2 s3, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & a6Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_518876 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_106 = a0;
	Eq_2 s2_129 = a1;
	Eq_2 s6_226 = a2;
	Eq_2 s4_151 = a3;
	Eq_2 s8_152 = a4;
	Eq_2 s5_225 = a6;
	Eq_518876 s7_227 = a7;
	if (mbedtls_x509_time_is_past() != 0x00)
	{
		*(a5 | 1) = (word32) *a5;
		a5 |= 1;
	}
	if (mbedtls_x509_time_is_future() != 0x00)
		*(a5 | 0x0200) = (word32) *a5;
	word32 * a5_69 = 0x01 << (word32) (*((word32) a0 + 296)) + -1 & *a2;
	if (a5_69 == null)
		*(a5_69 | 0x04000000) = *a5_69;
	Eq_2 a4_136 = *((word32) a2 + 4);
	union Eq_2 * a5_82 = 0x01 << (word32) (*((word32) a0 + 297)) + -1 & a4_136;
	if (a5_82 == null)
	{
		*(a5_82 | 0x08000000) = *a5_82;
		a4_136.u0 = 0x08000000;
		a5_82 |= 0x08000000;
	}
	ptr32 a0_441;
	Eq_2 s1_148 = *a5_82;
	*(a5_82 | 8) = (union Eq_2 *) s1_148;
	Eq_2 a5_118;
	Eq_2 a0_94 = mbedtls_md_info_from_type((word32) *((word32) a0 + 296), out a5_118);
	Eq_2 s9_451 = a0_94;
	if (a0_94 != 0x00)
	{
		s0_106 = *((word32) a1 + 20);
		s3.u0 = 0x00;
		word32 a1_1160;
		ra = mbedtls_md(ra, a0_94, a1, a2, fp + -96, out a1_1160, out a5_118);
		s10 = (word32) (a3 < 1);
		s11 = (word32) a3 + 1;
		while (s2_129 != 0x00)
		{
			Eq_2 a2_141;
			Eq_2 a3_142;
			Eq_2 a0_156;
			s0_106 = x509_crt_check_parent(s0_106, s2_129, 0x01, a4_136, a5_118, dwArgA8, out s1_148, out a0_156, out a2_141, out a3_142, out a4_136, out a5_118, out a6, out a7, out s2_129, out s3, out s4_151, out s8_152);
			if (a0_156 == 0x00)
			{
				s0_106 = *((word32) a3_142 + 0x0044);
				Eq_2 a5_160 = s11;
				if (a3_142 == *((word32) s2_129 + 0x0044))
				{
					s0_106 = *((word32) a0_156 + 72);
					word32 a1_1161;
					word32 a2_1162;
					word32 a3_1163;
					word32 a4_1164;
					if (memcmp(a0_156, *((word32) s2_129 + 72), a2_141, out a1_1161, out a2_1162, out a3_1163, out a4_1164, out a5_160) == 0x00)
						a5_160 = s4_151;
				}
				a4_136 = *((word32) s2_129 + 0x0100);
				if (a4_136 > 0x00)
				{
					a5_118 = a5_160 - s8_152;
					if (a4_136 >= a5_118)
						goto l2308F6E6;
				}
				else
				{
l2308F6E6:
					word32 a0_215;
					ra = mbedtls_pk_verify_ext(ra, (word32) *((word32) s0_106 + 297), *((word32) s0_106 + 300), (word32) s2_129 + 188, (word32) *((word32) s0_106 + 296), mbedtls_md_get_size(a0_94), *((word32) s0_106 + 292), *((word32) s0_106 + 288), s10, s11, mstatus, dwLoc80, dwLoc3C, s11, dwArg44, dwArgB8, dwArg0118, out s0_106, out s1_148, out a0_215, out a4_136, out a5_118, out a6, out a7, out s2_129, out s3, out s4_151, out s5_225, out s6_226, out s7_227, out s8_152, out s10, out s11, out mstatus);
					if (a0_215 == 0x00)
					{
						if (mbedtls_x509_time_is_past() == 0x00 && mbedtls_x509_time_is_future() == 0x00)
						{
							s3 = s2_129;
							goto l2308F73E;
						}
						if (s3 == 0x00)
							s3 = s2_129;
					}
				}
			}
			s2_129 = *((word32) s2_129 + 304);
		}
		if (s3 != 0x00)
		{
l2308F73E:
			s1_148 = *a5_118;
			*(a5_118 & ~0x08) = (union Eq_2 *) s1_148;
			Eq_2 a2_275;
			union Eq_2 * a5_277;
			Eq_2 a0_274 = x509_profile_check_key((word32) *((word32) s0_106 + 297), (byte) s3.u0 + 188, out a2_275, out a4_136, out a5_277);
			if (a0_274 != 0x00)
			{
				s1_148 = *a5_277;
				*(a5_277 | 0x10000000) = (union Eq_2 *) s1_148;
				a4_136.u0 = 0x10000000;
			}
			s0_106 = *((byte) a4_136.u0 + 0x0044);
			a5_118 = *((byte) s3.u0 + 0x0044);
			if (a4_136 == a5_118)
			{
				s0_106 = *((word32) a0_274 + 72);
				word32 a2_1166;
				word32 a3_1167;
				word32 a1_1165;
				if (memcmp(a0_274, *((byte) s3.u0 + 72), a2_275, out a1_1165, out a2_1166, out a3_1167, out a4_136, out a5_118) == 0x00)
					goto l2308F6A2;
			}
			if (mbedtls_x509_time_is_past() != 0x00)
				a5_118 |= 1;
			if (mbedtls_x509_time_is_future() != 0x00)
				a5_118 |= 0x0200;
			if (s5_225 == 0x00)
			{
l2308F79C:
				a5_118 |= a4_136;
				*a5_118 = *a5_118;
				a0_441 = 0x00;
				goto l2308F7A6;
			}
			word32 tp_461;
			word32 t1_465;
			word32 t5_467;
			word32 t6_468;
			s5_225();
			if (a0_441 != 0x00)
			{
l2308F7A6:
				s0Out = s0_106;
				s1Out = dwArg0118;
				a0Out = a0_441;
				a4Out = a4_136;
				a5Out = a5_118;
				a6Out = a6;
				a7Out = dwLoc34;
				s2Out = s2_129;
				s3Out = s3;
				s4Out = s4_151;
				s5Out = s8;
				s6Out = s6_226;
				s7Out = s7_227;
				s8Out = s8_152;
				s9Out = dwLoc74;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus;
				return dwArg0158;
			}
l2308F7D2:
			word32 tp_552;
			word32 t1_556;
			word32 t5_558;
			word32 t6_559;
			s5_225();
			if (a0_441 != 0x00)
				goto l2308F7A6;
			goto l2308F79C;
		}
	}
l2308F6A2:
	if (s5_225 == 0x00)
		goto l2308F79C;
	goto l2308F7D2;
}

