pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308F7E0: Register Eq_2 x509_crt_verify_child(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s7, Register Eq_518876 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_523265 a4Out, Register out (ptr32 Eq_2) a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_518876 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_crt_verify_child(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s2, Eq_2 s5, Eq_2 s7, Eq_518876 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_523265 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_518876 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_375;
	union Eq_2 * a5_393;
	ptr32 a6_394;
	Eq_2 a2_125;
	struct Eq_523284 * sp_3 = fp + -144;
	Eq_2 s1_32 = a0;
	Eq_2 s3_146 = a1;
	Eq_2 s10_235 = a3;
	Eq_2 s4_222 = a6;
	Eq_2 s2_220 = dwArg58;
	Eq_2 s6_224 = dwLoc84;
	a2_125 = a2;
	if (a5 != 0x00)
	{
		word32 a0_49;
		word32 a3_905;
		word32 a4_906;
		word32 a5_907;
		word32 a7_908;
		s1_32 = x509_name_cmp((word32) a0 + 76, (word32) a0 + 0x006C, a2, a4, a5, out a0_49, out a1, out a2_125, out a3_905, out a4_906, out a5_907, out a6_394, out a7_908, out s2_220, out s3_146, out s4_222, out s8);
		if (a0_49 == 0x00)
			s4_222 = (word32) s4_222 + 1;
		a5.u0 = 0x08;
		if (s2_220 == 0x08)
		{
			s0_375 = *(union Eq_2 *) 0x08;
			*(union Eq_2 *) 0x08 = s0_375;
			a5_393 = (union Eq_2 *) 0x08;
			goto l2308F838;
		}
	}
	if (mbedtls_x509_time_is_past() != 0x00)
	{
		a5 |= 1;
		*a5.u0 = *a5.u0;
	}
	if (mbedtls_x509_time_is_future() != 0x00)
		*(a5 | 0x0200) = (word32) *a5.u0;
	word32 * a5_97 = 0x01 << (word32) (*((word32) s1_32 + 296)) + -1 & *dwLoc84;
	if (a5_97 == null)
		*(a5_97 | 0x04000000) = *a5_97;
	Eq_2 a4_109 = *((word32) dwLoc84 + 4);
	word32 * a5_110 = 0x01 << (word32) (*((word32) s1_32 + 297)) + -1 & a4_109;
	if (a5_110 == null)
	{
		*(a5_110 | 0x08000000) = *a5_110;
		a4_109.u0 = 0x08000000;
	}
	Eq_2 ra_232;
	Eq_2 a5_119;
	Eq_2 a0_118 = mbedtls_md_info_from_type((word32) *((word32) s1_32 + 296), out a5_119);
	ra_232 = ra;
	if (a0_118 != 0x00)
	{
		struct Eq_523416 * s1_134 = *((word32) a1 + 20);
		word32 a5_910;
		word32 a1_909;
		Eq_2 ra_160 = mbedtls_md(ra, a0_118, a1, a2_125, fp + -96, out a1_909, out a5_910);
		Eq_2 s5_148 = (word32) s3_146 + 188;
		word32 * a5_168;
		word32 a2_911;
		word32 a4_912;
		if (x509_profile_check_key((word32) s1_134->b0129, s5_148, out a2_911, out a4_912, out a5_168) != 0x00)
			*(a5_168 | 0x10000000) = *a5_168;
		Eq_2 a1_178 = s1_134->t012C;
		dwLoc84 = a1_178;
		word32 a0_213;
		word32 s1_914;
		word32 a6_915;
		word32 a7_916;
		word32 s5_917;
		word32 s11_918;
		word32 s0_913;
		ra_232 = mbedtls_pk_verify_ext(ra_160, (word32) s1_134->b0129, a1_178, s5_148, (word32) s1_134->b0128, mbedtls_md_get_size(a0_118), s1_134->t0124, s1_134->t0120, a3, a0_118, mstatus, dwLoc90, s0, dwArg14, ra, dwArgA8, dwArg0108, out s0_913, out s1_914, out a0_213, out a4_109, out a5_119, out a6_915, out a7_916, out s2_220, out s3_146, out s4_222, out s5_917, out s6_224, out s7, out s8, out s10_235, out s11_918, out mstatus);
		if (a0_213 == 0x00)
		{
l2308F924:
			Eq_2 s5_255 = a2;
			Eq_2 s11_263 = (word32) (s2_220 < 1);
			while (true)
			{
				ui32 a4_392;
				word32 a7_395;
				word32 s5_386;
				word32 ra_385;
				word32 s9_383;
				word32 s1_376;
				word32 a0_388;
				Eq_518876 a7_292;
				Eq_2 a4_296;
				Eq_2 a3_297;
				Eq_2 a1_300;
				if (s5_255 == 0x00)
					break;
				word32 a0_291;
				word32 a2_920;
				word32 a3_921;
				word32 a6_922;
				word32 a7_923;
				word32 s1_919;
				x509_crt_check_parent(s3_146, s5_255, 0x00, a4_109, a5_119, dwArg98, out s1_919, out a0_291, out a2_920, out a3_921, out a4_109, out a5_119, out a6_922, out a7_923, out s2_220, out s3_146, out s4_222, out s8);
				if (a0_291 == 0x00)
				{
					a7_292 = s8;
					a4_296 = s4_222;
					a3_297 = (word32) s2_220 + 1;
					a1_300 = s5_255;
					goto l2308F978;
				}
				s5_255 = *((word32) s5_255 + 304);
			}
			Eq_2 s5_304 = *((word32) s3_146 + 304);
			Eq_2 a4_305 = (word32) (s2_220 < 1);
			s11_263 = (word32) s2_220 + 2 - s4_222;
			while (s5_304 != 0x00)
			{
				Eq_2 a5_318 = *((word32) s5_304 + 0x0100);
				if (a5_318 <= 0x00 || a5_318 >= s11_263)
				{
					word32 a0_349;
					word32 a5_927;
					word32 a6_928;
					word32 a7_929;
					word32 s4_930;
					word32 s1_924;
					word32 a2_925;
					word32 a3_926;
					Eq_2 s0_340 = x509_crt_check_parent(s3_146, s5_304, 0x00, a4_305, a5_318, dwArg98, out s1_924, out a0_349, out a2_925, out a3_926, out a4_305, out a5_927, out a6_928, out a7_929, out s2_220, out s3_146, out s4_930, out s8);
					s4_222 = ra;
					if (a0_349 == 0x00)
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg20 = <invalid>;
						Eq_2 stackArg24 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg264 = <invalid>;
						dwLoc90 = s7;
						ra_385 = x509_crt_verify_child(ra_232, s0_340, s3_146, s5_304, a2, s10_235, s6_224, (word32) s2_220 + 1, ra, s2_220, s5_304, s7, s8, mstatus, stackArg20, stackArg24, stackArg88, stackArg136, stackArg152, dwArg18, stackArg264, out s0_375, out s1_376, out a0_388, out a4_392, out a5_393, out a6_394, out a7_395, out s2_220, out s3_146, out s4_222, out s5_386, out s6_224, out s7, out s8, out s9_383, out s10_235, out s11, out mstatus);
						goto l2308F9AC;
					}
				}
				s5_304 = *((word32) s5_304 + 304);
			}
			a7_292 = s8;
			a4_296 = s4_222;
			a3_297 = (word32) s2_220 + 1;
			a1_300 = a2;
l2308F978:
			ra_385 = x509_crt_verify_top.isra.7(ra_232, s3_146, a1_300, s6_224, a3_297, a4_296, fp + -100, s7, a7_292, s3_146, s10_235, s11_263, mstatus, s2, s0, dwLoc2C, dwArg18, s5, dwArg88, out s0_375, out s1_376, out a0_388, out a4_392, out a5_393, out a6_394, out a7_395, out s2_220, out s3_146, out s4_222, out s5_386, out s6_224, out s7, out s8, out s9_383, out s10_235, out s11, out mstatus);
l2308F9AC:
			sp_3 = fp + -144;
			if (a0_388 == 0x00)
			{
				if (s7 != 0x00)
				{
					word32 a0_520;
					word32 tp_533;
					word32 t5_534;
					word32 t6_535;
					s7();
					if (a0_520 != 0x00)
						goto l2308F838;
				}
				s0_375 = *a5_393;
				a5_393 |= a4_392;
				*a5_393 = (union Eq_2 *) s0_375;
			}
l2308F838:
			struct Eq_523606 * sp_556 = sp_3->ptr0048;
			Eq_523265 a4_553 = sp_3->t0020;
			ptr32 a0_554 = sp_3->ptr0004;
			ptr32 s9_558 = sp_556->ptr0198;
			ptr32 s5_559 = sp_556->ptr01B8;
			ptr32 a7_560 = sp_556->ptr01D8;
			ptr32 s1_562 = sp_556->ptr011C;
			Eq_2 ra_564 = sp_556->t015C;
			s0Out = s0_375;
			s1Out = s1_562;
			a0Out = a0_554;
			a4Out = a4_553;
			a5Out = a5_393;
			a6Out = a6_394;
			a7Out = a7_560;
			s2Out = s2_220;
			s3Out = s3_146;
			s4Out = s4_222;
			s5Out = s5_559;
			s6Out = s6_224;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9_558;
			s10Out = s10_235;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra_564;
		}
	}
	a5_119 |= 8;
	*a5_119 = *a5_119;
	goto l2308F924;
}

