pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308F9E0: Register Eq_2 mbedtls_x509_crt_check_extended_key_usage(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a5Out, Register out ptr32 s3Out)
// Called from:
//      mbedtls_ssl_check_cert_usage
Eq_2 mbedtls_x509_crt_check_extended_key_usage(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a5Out, ptr32 & s3Out)
{
	Eq_2 a5_151 = *((word32) a0 + 0x00F8);
	if (a5_151 << 0x14 >= 0x00)
	{
		s1Out = s1;
		a0Out = 0x00;
		a5Out = a5_151;
		s3Out = s3;
		return s0;
	}
	else
	{
		a1_41 = a1;
		do
		{
			ptr32 a0_132;
			Eq_2 a1_41;
			if (a5_151 == a2)
			{
				word32 a3_176;
				word32 a2_175;
				word32 a4_177;
				a0 = memcmp(a0, a1, a2, out a1_41, out a2_175, out a3_176, out a4_177, out a5_151);
				if (a0 == 0x00)
					goto l2308FA48;
			}
			Eq_2 s0_45 = *((word32) a5_151 + 4);
			if (a5_151 == 0x04)
			{
				s0_45 = *((word32) a1_41 + 8);
				word32 a2_178;
				word32 a3_179;
				word32 a4_180;
				a0 = memcmp(0x230C8268, a1_41, 0x04, out a1_41, out a2_178, out a3_179, out a4_180, out a5_151);
				if (a0 != 0x00)
					goto l2308FA22;
l2308FA48:
				a0_132 = 0x00;
				goto l2308FA2C;
			}
l2308FA22:
		} while (*((word32) s0_45 + 0x0C) != 0x00);
		a0_132 = ~0x020007FF;
l2308FA2C:
		s1Out = a2;
		a0Out = a0_132;
		a5Out = a5_151;
		s3Out = 0x230C8000;
		return s1;
	}
}

// 2308FA50: Register Eq_2 mbedtls_x509_crt_verify_with_profile(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_518876 a7, Register Eq_518876 s3, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_ssl_parse_certificate
Eq_2 mbedtls_x509_crt_verify_with_profile(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_518876 a7, Eq_518876 s3, Eq_2 s7, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s5Out)
{
	if (a3 == 0x00)
	{
		a0Out = ~0x020007FF;
		a4Out = a4;
		a5Out = a5;
		s5Out = s5;
		return ra;
	}
	else
	{
		Eq_2 s10_113;
		a5->u0 = 0x00;
		Eq_2 s0_102 = a5;
		Eq_2 s2_273 = a3;
		Eq_2 s4_275 = a1;
		Eq_2 s1_258 = a0;
		s10_113 = s10;
		if (a4 != 0x00)
		{
			word32 a4_1003;
			word32 a3_1002;
			word32 a1_1000;
			word32 a2_1001;
			word32 a5_1004;
			Eq_2 a0_50 = strlen(a4, out a1_1000, out a2_1001, out a3_1002, out a4_1003, out a5_1004);
			Eq_2 a5_56 = *((word32) a0 + 0x00F8);
			s7 = a0_50;
			a5 = a5_56 & 32;
			if ((a5_56 & 32) == 0x00)
			{
				struct Eq_523829 * s8_111 = (word32) a0 + 0x006C;
				s10_113.u0 = 0x02;
				s11.u0 = 0x230C8000;
				do
				{
					a5.u0 = 0x03;
					if (s8_111->dw0004 == 0x03)
					{
						word32 a2_1006;
						word32 a1_1005;
						word32 a3_1007;
						word32 a4_1008;
						if (memcmp(588023212, s8_111->t0008, 0x03, out a1_1005, out a2_1006, out a3_1007, out a4_1008, out a5) == 0x00)
						{
							Eq_2 a4_129 = s8_111->t0010;
							if (a4_129 == a0_50)
							{
								word32 a7_1010;
								word32 a3_1009;
								if (x509_memcasecmp(s8_111->t0014, a4, a0_50, out a3_1009, out a4_129, out a5, out a7_1010) == 0x00)
									goto l2308FB0A;
							}
							if (a4_129 > 0x02)
							{
								word32 a1_1011;
								word32 a2_1012;
								word32 a3_1013;
								word32 a4_1014;
								if (memcmp(s8_111->t0014, 588023208, 0x02, out a1_1011, out a2_1012, out a3_1013, out a4_1014, out a5) == 0x00)
								{
									word32 a0_164;
									s0_102 = x509_check_wildcard(a4, out a0_164, out a5, out s8_111);
									if (a0_164 == 0x00)
										goto l2308FB0A;
								}
							}
						}
					}
					s8_111 = s8_111->ptr0018;
				} while (s8_111 != null);
			}
			else
			{
				struct Eq_523824 * s9_110 = (word32) a0 + 232;
				s10_113.u0 = 0x02;
				s11.u0 = 0x230C8000;
				do
				{
					Eq_2 s8_64 = s9_110->t0004;
					if (s8_64 == a0_50)
					{
						word32 a3_1015;
						word32 a7_1017;
						word32 a4_1016;
						if (x509_memcasecmp(a4, s9_110->t0008, a0_50, out a3_1015, out a4_1016, out a5, out a7_1017) == 0x00)
							goto l2308FB0A;
					}
					if (s8_64 > 0x02)
					{
						word32 a4_1021;
						word32 a1_1018;
						word32 a2_1019;
						word32 a3_1020;
						if (memcmp(s9_110->t0008, 588023208, 0x02, out a1_1018, out a2_1019, out a3_1020, out a4_1021, out a5) == 0x00)
						{
							word32 a0_96;
							word32 s8_1022;
							s0_102 = x509_check_wildcard(a4, out a0_96, out a5, out s8_1022);
							if (a0_96 == 0x00)
								goto l2308FB0A;
						}
					}
					s9_110 = s9_110->ptr000C;
				} while (s9_110 != null);
			}
			s0_102 = *a5.u0;
			a5 |= 4;
			*a5.u0 = s0_102;
			s11.u0 = 0x230C8000;
			s10_113.u0 = 0x02;
		}
l2308FB0A:
		word32 a0_208 = mbedtls_pk_get_type((word32) a0 + 188, a5);
		union Eq_2 * a5_223 = 0x01 << a0_208 + -1 & *((word32) a3 + 4);
		if (a5_223 == null)
		{
			s0_102 = *a5_223;
			*(a5_223 | 0x08000000) = (union Eq_2 *) s0_102;
		}
		word32 a2_1023;
		Eq_2 a4_234;
		Eq_2 a5_235;
		if (x509_profile_check_key(a0_208, (word32) a0 + 188, out a2_1023, out a4_234, out a5_235) != 0x00)
		{
			s0_102 = *a5_235;
			*(a5_235 | 0x10000000) = (union Eq_2 *) s0_102;
			a4_234.u0 = 0x10000000;
			a5_235 |= 0x10000000;
		}
		Eq_2 s3_253 = a1;
		while (true)
		{
			Eq_2 a4_338;
			ptr32 a0_334;
			Eq_2 a5_339;
			Eq_2 a5_285;
			Eq_2 a2_288;
			Eq_2 a1_289;
			Eq_2 s3_274;
			if (s3_253 == 0x00)
				break;
			word32 a0_280;
			word32 a2_1024;
			word32 a3_1025;
			word32 a6_1026;
			word32 a7_1027;
			word32 s8_1028;
			s0_102 = x509_crt_check_parent(s1_258, s3_253, 0x00, a4_234, a5_235, dwArgC8, out s1_258, out a0_280, out a2_1024, out a3_1025, out a4_234, out a5_235, out a6_1026, out a7_1027, out s2_273, out s3_274, out s4_275, out s8_1028);
			if (a0_280 == 0x00)
			{
				a5_285 = s0_102;
				a2_288 = s2_273;
				a1_289 = s3_274;
				goto l2308FBD6;
			}
			s3_253 = *((word32) s3_274 + 304);
		}
		s3_274 = *((word32) s1_258 + 304);
		while (s3_274 != 0x00)
		{
			Eq_2 a3_304;
			Eq_2 s3_312;
			word32 a0_318;
			word32 a6_1030;
			word32 a7_1031;
			word32 s8_1032;
			word32 a2_1029;
			s0_102 = x509_crt_check_parent(s1_258, s3_274, 0x00, a4_234, a5_235, dwArgC8, out s1_258, out a0_318, out a2_1029, out a3_304, out a4_234, out a5_235, out a6_1030, out a7_1031, out s2_273, out s3_312, out s4_275, out s8_1032);
			if (a0_318 == 0x00)
			{
				word32 s0_1033;
				word32 a7_1036;
				word32 s2_1037;
				word32 s3_1038;
				word32 s4_1039;
				word32 s5_1040;
				word32 s6_1041;
				word32 s7_1042;
				word32 s8_1043;
				word32 s9_1044;
				word32 s10_1045;
				word32 mstatus_1047;
				word32 s11_1046;
				word32 s1_1034;
				word32 a6_1035;
				x509_crt_verify_child(ra, s0_102, s1_258, s3_312, s4_275, a3_304, s2_273, 0x00, 0x00, s2_273, a6, s7, s3, mstatus, dwLoc4C, s10, dwLoc08, dwArg28, s9, s1, dwArgA8, out s0_1033, out s1_1034, out a0_334, out a4_338, out a5_339, out a6_1035, out a7_1036, out s2_1037, out s3_1038, out s4_1039, out s5_1040, out s6_1041, out s7_1042, out s8_1043, out s9_1044, out s10_1045, out s11_1046, out mstatus_1047);
				goto l2308FBFE;
			}
			s3_274 = *((word32) s3_312 + 304);
		}
		a5_285 = s0_102;
		a2_288 = s2_273;
		a1_289 = s4_275;
l2308FBD6:
		word32 a7_1051;
		word32 s2_1052;
		word32 s3_1053;
		word32 s4_1054;
		word32 s5_1055;
		word32 s6_1056;
		word32 s7_1057;
		word32 s8_1058;
		word32 s9_1059;
		word32 s10_1060;
		word32 mstatus_1062;
		word32 s11_1061;
		word32 s0_1048;
		word32 s1_1049;
		word32 a6_1050;
		x509_crt_verify_top.isra.7(ra, s1_258, a1_289, a2_288, 0x00, 0x00, a5_285, a6, a7, s3_274, s10_113, s11, mstatus, dwLoc20, dwLoc1C, dwArg04, s1, dwArg58, dwArgB8, out s0_1048, out s1_1049, out a0_334, out a4_338, out a5_339, out a6_1050, out a7_1051, out s2_1052, out s3_1053, out s4_1054, out s5_1055, out s6_1056, out s7_1057, out s8_1058, out s9_1059, out s10_1060, out s11_1061, out mstatus_1062);
l2308FBFE:
		if (a0_334 == 0x00)
		{
			a0_334 = 0x00;
			if (a5_339 != 0x00)
				a0_334 = ~0x020006FF;
		}
		a0Out = a0_334;
		a4Out = a4_338;
		a5Out = a5_339;
		s5Out = s4;
		return dwArg68;
	}
}

// 2308FC3A: Register Eq_2 mbedtls_x509_crt_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      altcp_tls_create_config_client_common
//      altcp_tls_create_config_client_2wayauth
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_crt_init(Eq_2 ra, Eq_2 a0, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a0_7;
	ptr32 a1_8;
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_21;
	word32 a2_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 308, out t1_21, out a0_7, out a1_8, out a2_22, out a3_10, out a4_11, out a5_12);
	a0Out = a0_7;
	a1Out = a1_8;
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 2308FC44: Register Eq_2 mbedtls_x509_crt_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      altcp_tls_free_config
//      mbedtls_ssl_session_free
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_crt_free(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	else
	{
		Eq_2 s1_124 = a0;
		Eq_2 s0_102 = a0;
		do
		{
			Eq_2 a0_126;
			Eq_2 a2_118;
			ra = mbedtls_pk_free(ra, (word32) s0_102 + 188, a5, out a0_126, out a2_118, out a5);
			Eq_2 s2_26 = *((word32) s0_102 + 100);
			while (s2_26 != 0x00)
			{
				s3 = *((word32) s2_26 + 24);
				word32 a1_362;
				mbedtls_zeroize(s2_26, 32, out a1_362);
				word32 a3_363;
				word32 a4_364;
				word32 a6_365;
				word32 s4_366;
				word32 t3_367;
				vPortFree(s2_26, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_102, out s1_124, out a0_126, out a1, out a2_118, out a3_363, out a4_364, out a5, out a6_365, out s4_366, out t3_367);
				s2_26 = s3;
			}
			Eq_2 s2_53 = *((word32) s0_102 + 0x0084);
			while (s2_53 != 0x00)
			{
				s3 = *((word32) s2_53 + 24);
				word32 a1_368;
				mbedtls_zeroize(s2_53, 32, out a1_368);
				word32 a3_369;
				word32 a4_370;
				word32 a6_371;
				word32 s4_372;
				word32 t3_373;
				vPortFree(s2_53, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_102, out s1_124, out a0_126, out a1, out a2_118, out a3_369, out a4_370, out a5, out a6_371, out s4_372, out t3_373);
				s2_53 = s3;
			}
			Eq_2 s2_105 = *((word32) s0_102 + 0x0114);
			while (s2_105 != 0x00)
			{
				s3 = *((word32) s2_105 + 0x0C);
				word32 a1_374;
				mbedtls_zeroize(s2_105, 0x10, out a1_374);
				word32 a3_375;
				word32 a4_376;
				word32 a6_377;
				word32 s4_378;
				word32 t3_379;
				vPortFree(s2_105, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_102, out s1_124, out a0_126, out a1, out a2_118, out a3_375, out a4_376, out a5, out a6_377, out s4_378, out t3_379);
				s2_105 = s3;
			}
			Eq_2 s2_107 = *((word32) s0_102 + 244);
			while (s2_107 != 0x00)
			{
				s3 = *((word32) s2_107 + 0x0C);
				word32 a1_380;
				mbedtls_zeroize(s2_107, 0x10, out a1_380);
				word32 s0_381;
				word32 a3_382;
				word32 a4_383;
				word32 a6_384;
				word32 s4_385;
				word32 t3_386;
				vPortFree(s2_107, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_381, out s1_124, out a0_126, out a1, out a2_118, out a3_382, out a4_383, out a5, out a6_384, out s4_385, out t3_386);
				s2_107 = s3;
			}
			struct Eq_524307 * s0_137 = *((word32) a0_126 + 8);
			if (a0_126 != 0x00)
			{
				word32 a1_387;
				word32 a0_388;
				word32 a3_389;
				word32 a4_390;
				word32 a6_391;
				word32 s4_392;
				word32 t3_393;
				vPortFree(mbedtls_zeroize(a0_126, a1, out a1_387), a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_137, out s1_124, out a0_388, out a1, out a2_118, out a3_389, out a4_390, out a5, out a6_391, out s4_392, out t3_393);
			}
			s0_102 = s0_137->t0130;
		} while (s0_102 != 0x00);
		Eq_2 s0_168 = s1_124;
		do
		{
			Eq_2 s2_173 = *((word32) s0_168 + 304);
			Eq_2 a1_175;
			Eq_2 a0_174 = mbedtls_zeroize(s0_168, 308, out a1_175);
			if (s1_124 != s0_168)
			{
				word32 s0_394;
				word32 a3_395;
				word32 a4_396;
				word32 a6_397;
				word32 s4_398;
				word32 t3_399;
				vPortFree(s0_168, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_394, out s1_124, out a0_174, out a1_175, out a2_118, out a3_395, out a4_396, out a5, out a6_397, out s4_398, out t3_399);
			}
			s0_168 = s2_173;
		} while (s2_173 != 0x00);
		s0Out = s2_173;
		s1Out = s1_124;
		a0Out = a0_174;
		a1Out = a1_175;
		a2Out = dwArg48;
		a5Out = a5;
		s2Out = s2_173;
		s3Out = s3;
		s4Out = dwArg04;
		s8Out = dwLoc1C;
		return ra;
	}
}

