pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0008.c
// 2308FD22: Register Eq_2 mbedtls_x509_crt_parse_der(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0144, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_519072 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse
Eq_2 mbedtls_x509_crt_parse_der(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0144, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_519072 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s0_1018;
	if (a0 == 0x00 || a1 == 0x00)
	{
		s0_1018 = ~0x020007FF;
		goto l2308FE3E;
	}
	Eq_2 s0_124 = a2;
	s2 = a1;
	Eq_2 s4_1114 = a0;
	s3.u0 = 0x00;
	do
	{
		Eq_2 ra_76;
		Eq_2 s1_1012 = *((word32) a5 + 24);
		ra_76 = ra;
		if (a5 == 0x00)
			goto l2308FD7E;
		a5 = *((word32) s1_1012 + 304);
		s3 = s1_1012;
	} while (a5 != 0x00);
	Eq_2 s1_60;
	word32 a3_2286;
	word32 a4_2287;
	ra = mycalloc(ra, s1_1012, 0x01, 308, a3, a4, a5, mstatus, dwLoc70, dwLoc6C, dwArg88, dwArgC8, out s0_124, out s1_60, out a1, out a2, out a3_2286, out a4_2287, out a5, out s2, out s3, out s4_1114, out s8);
	((word32) s1_60 + 304)->u0 = 0x01;
	if (false)
	{
		s0_1018 = 0xFD000780;
		goto l2308FE3E;
	}
	word32 a4_2291;
	word32 a0_2288;
	word32 a3_2290;
	word32 a1_2289;
	word32 a5_2292;
	ra_76 = mbedtls_x509_crt_init(ra, 0x01, out a0_2288, out a1_2289, out a3_2290, out a4_2291, out a5_2292);
	s3 = s1_60;
	s1_1012 = *((word32) s1_60 + 304);
l2308FD7E:
	word32 a0_2269;
	word32 a1_2270;
	word32 a2_2271;
	word32 a1_2277;
	word32 a3_2272;
	word32 a4_2273;
	word32 a5_2274;
	word32 a2_2278;
	word32 t1_2275;
	word32 a0_2276;
	word32 t1_2268;
	word32 a3_2279;
	word32 a4_2285;
	word32 a0_2283;
	word32 a5_2281;
	word32 a4_2280;
	word32 t1_2282;
	word32 a3_2284;
	ra = memset(memset(memset(ra_76, fp + -0x006C, 0x00, 0x0C, out t1_2268, out a0_2269, out a1_2270, out a2_2271, out a3_2272, out a4_2273, out a5_2274), fp + -96, 0x00, 0x0C, out t1_2275, out a0_2276, out a1_2277, out a2_2278, out a3_2279, out a4_2280, out a5_2281), fp + -84, 0x00, 0x0C, out t1_2282, out a0_2283, out a1, out a2, out a3_2284, out a4_2285, out a5);
	if (s1_1012 == 0x00)
	{
		s0_1018 = ~0x020007FF;
		if (s3 == 0x00)
			goto l23090368;
		goto l2308FDC6;
	}
	word32 s0_129 = s0_124 + s2;
	Eq_2 a3_139;
	Eq_2 a4_140;
	word32 a2_2293;
	if (mbedtls_asn1_get_tag(s0_129, fp + -0x0084, 48, a5, out a1, out a2_2293, out a3_139, out a4_140, out a5) != 0x00)
	{
		word32 a0_2295;
		word32 s0_2294;
		ra = mbedtls_x509_crt_free(ra, s1_1012, a1, a5, mstatus, dwArgA8, dwArgE8, out s0_2294, out s1_1012, out a0_2295, out a1, out a2, out a5, out s2, out s3, out s4_1114, out s8);
		s0_1018 = ~0x0200017F;
		goto l2308FDC2;
	}
	if (s0_129 - a1 < a5)
	{
l2308FDDA:
		word32 s0_2306;
		word32 a0_2307;
		ra = mbedtls_x509_crt_free(ra, s1_1012, a1, a5, mstatus, dwArgA8, dwArgE8, out s0_2306, out s1_1012, out a0_2307, out a1, out a2, out a5, out s2, out s3, out s4_1114, out s8);
		s0_1018 = ~0x020001E5;
		goto l2308FDC2;
	}
	word32 a1_146 = a1 + a5 - s2;
	*((word32) a1_146 + 4) = s1_1012;
	word32 s0_2303;
	word32 a4_2305;
	word32 a3_2304;
	ra = mycalloc(ra, s1_1012, 0x01, a1_146, a3_139, a4_140, a5, mstatus, dwLoc70, dwLoc6C, dwArg88, dwArgC8, out s0_2303, out s1_1012, out a1, out a2, out a3_2304, out a4_2305, out a5, out s2, out s3, out s4_1114, out s8);
	*(union Eq_2 *) 0x09 = s1_1012;
	if (false)
	{
		s0_1018 = 0xFD000780;
		goto l2308FDC2;
	}
	struct Eq_524631 * a4_171;
	ui32 a5_172;
	word32 a1_2308;
	word32 a2_2309;
	word32 a3_2310;
	word32 a6_2311;
	word32 a7_2312;
	memcpy(0x01, s2, a2, out a1_2308, out a2_2309, out a3_2310, out a4_171, out a5_172, out a6_2311, out a7_2312);
	s1_1012 = a4_171->t0004;
	Eq_2 a5_189 = (word32) s2 + (a4_171 - a5_172);
	*((word32) a5_189 + 20) = s1_1012;
	Eq_2 dwLoc88_1369 = a5_189;
	word32 a4_2315;
	word32 a2_2313;
	word32 a3_2314;
	Eq_2 a1_1169;
	if (mbedtls_asn1_get_tag(s2 + a4_171, fp + -0x0084, 48, a5_189, out a1_1169, out a2_2313, out a3_2314, out a4_2315, out a5) != 0x00)
	{
l2308FE2E:
		word32 s0_1180;
		word32 a0_2319;
		ra = mbedtls_x509_crt_free(ra, s1_1012, a1_1169, a5, mstatus, dwArgA8, dwArgE8, out s0_1180, out s1_1012, out a0_2319, out a1, out a2, out a5, out s2, out s3, out s4_1114, out s8);
		s0_1018 = s0_1180 + ~0x0200017F;
		if (s0_1180 == ~0x0200017F)
			goto l2308FE3E;
		goto l2308FDC2;
	}
	word32 s5_210 = s5 + a5;
	s1_1012 = *((word32) a5 + 20);
	Eq_2 a5_214 = s5_210 - a5;
	*((word32) a5_214 + 16) = s1_1012;
	Eq_2 a5_222;
	word32 a2_2316;
	word32 a3_2317;
	word32 a4_2318;
	Eq_2 a0_216 = mbedtls_asn1_get_tag(s5_210, fp + -60, 0x00A0, a5_214, out a1, out a2_2316, out a3_2317, out a4_2318, out a5_222);
	if (a0_216 != 0x00)
	{
		a5.u0 = -98;
		if (a0_216 != -98)
			goto l2308FEE2;
		*((word32) s1_1012 + 24) = 0x00;
	}
	else
	{
		s5_210 = dwArg54;
		word32 a0_230;
		word32 a3_2320;
		word32 a4_2321;
		word32 s0_237 = mbedtls_asn1_get_int(a0_216 + a5_222, s1_1012 + 24, a5_222, out s1_1012, out a0_230, out a1, out a3_2320, out a4_2321, out a5);
		if (a0_230 != 0x00)
		{
			if (a0_230 != ~0x020001FF)
				goto l2308FEE2;
		}
		else if (s0_237 != a5)
			goto l2308FEE2;
	}
	word32 a0_257;
	s1_1012 = mbedtls_x509_get_serial(s5_210, (word32) s1_1012 + 28, a5, out a0_257, out a1, out a5);
	if (a0_257 == 0x00)
	{
		s6 = (word32) s1_1012 + 40;
		word32 a0_273;
		word32 a2_2323;
		word32 s2_2324;
		word32 s3_2325;
		s1_1012 = mbedtls_x509_get_alg(s5_210, (word32) s1_1012 + 40, fp + -0x006C, a5, dwArg14, dwArg88, out a0_273, out a1, out a2_2323, out a5, out s2_2324, out s3_2325);
		if (a0_273 != 0x00)
			goto l2308FEE2;
		Eq_2 s1_289 = *((byte) a5.u0 + 24);
		*((byte) a5.u0 + 25) = s1_289;
		if (a5 > ~0x01)
		{
			word32 a0_2327;
			word32 s0_2326;
			ra = mbedtls_x509_crt_free(ra, s1_289, a1, a5 + 0x01, mstatus, dwArgA8, dwArgE8, out s0_2326, out s1_1012, out a0_2327, out a1, out a2, out a5, out s2, out s3, out s4_1114, out s8);
			s0_1018 = ~0x0200057F;
			goto l2308FDC2;
		}
		word32 a0_298;
		s1_1012 = mbedtls_x509_get_sig_alg((word32) s1_1012 + 40, (word32) s1_289 + 296, (word32) s1_289 + 297, a5 + 0x01, out a0_298, out a1, out a5);
		if (a0_298 == 0x00)
		{
			*((byte) a5.u0 + 60) = s1_1012;
			word32 a2_2328;
			word32 a3_2329;
			word32 a4_2330;
			if (mbedtls_asn1_get_tag(s5_210, fp + -0x0084, 48, a5, out a1_1169, out a2_2328, out a3_2329, out a4_2330, out a5) != 0x00)
				goto l2308FE2E;
			word32 a0_328;
			struct Eq_524882 * a4_332;
			Eq_2 s5_340;
			Eq_2 s2_337;
			ra = mbedtls_x509_get_name(ra, fp + -0x0080, a1_1169 + a5, s1_1012 + 76, a5, mstatus, dwArg48, dwArg88, dwArg0108, out s1_1012, out a0_328, out a1, out a4_332, out a5, out s2_337, out s5_340, out s6, out s7);
			if (a0_328 == 0x00)
			{
				s1_1012 = a4_332[60];
				Eq_2 a5_354 = a5 - a4_332;
				*((word32) a5_354 + 56) = s1_1012;
				word32 a4_363;
				word32 a5_364;
				word32 a3_2332;
				word32 a2_2331;
				Eq_2 a0_358 = mbedtls_asn1_get_tag(s5_340, fp + -60, 48, a5_354, out a1, out a2_2331, out a3_2332, out a4_363, out a5_364);
				if (a0_358 != 0x00)
				{
					a5.u0 = -98;
					if (a0_358 != -98)
						goto l2308FEE2;
				}
				else
				{
					a5 = a5_364 + a4_363;
					s5_340 = ra;
					dwLoc88_1369 = a5;
				}
				*((byte) a5.u0 + 72) = s1_1012;
				word32 a3_2334;
				word32 a2_2333;
				struct Eq_524956 * a4_387;
				if (mbedtls_asn1_get_tag(s5_340, fp + -0x0084, 48, a5, out a1_1169, out a2_2333, out a3_2334, out a4_387, out a5) != 0x00)
					goto l2308FE2E;
				if (a5 != 0x00)
				{
					word32 a0_397;
					ra = mbedtls_x509_get_name(ra, fp + -0x0080, a1_1169 + a5, s1_1012 + 0x006C, a5, mstatus, dwArg48, dwArg88, dwArg0108, out s1_1012, out a0_397, out a1, out a4_387, out a5, out s2_337, out s5_340, out s6, out s7);
					if (a0_397 != 0x00)
						goto l2308FEE2;
				}
				Eq_2 s1_421 = a4_387[72];
				Eq_2 a5_428 = a5 - a4_387;
				*((word32) a5_428 + 0x0044) = s1_421;
				word32 a0_466;
				Eq_2 s2_458;
				Eq_2 s5_1308;
				ra = mbedtls_pk_parse_subpubkey(ra, s1_421, fp + -0x0080, s5_340, a5_428, s2_337, s7, s10, s11, mstatus, dwLoc88_1369, dwLoc6C, dwLoc68, s6, s0, dwLoc48, dwLoc2C, dwLoc28, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, s7, s5, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArg0108, out s1_1012, out a0_466, out a1, out a5, out s2_458, out s5_1308, out s6, out s7, out s10, out s11, out mstatus);
				if (a0_466 != 0x00)
					goto l2308FEE2;
				s1_1012 = *((byte) a5.u0 + 24);
				struct Eq_525028 * a4_480 = (struct Eq_525028 *) 0x01;
				word32 a5_481 = a5 + ~0x01;
				if (a5 > ~0x02)
				{
l2308FFBA:
					s1_1012 = a4_480->t0018;
					a5.u0 = 0x03;
					if (a4_480 == (struct Eq_525028 *) 0x03)
					{
						int32 a0_547;
						s1_1012 = mbedtls_x509_get_ext(s5_1308, (word32) s1_1012 + 220, 0x03, 0x03, out a0_547, out a1, out a5);
						if (a0_547 == 0x00)
						{
							s6.u0 = ~0x020004FF;
							while (a5 < s5_1308)
							{
								dwArg14.u0 = 0x00;
								word32 a2_2340;
								word32 a3_2341;
								word32 a4_2342;
								Eq_2 a0_577 = mbedtls_asn1_get_tag(s5_1308, fp + -0x007C, 48, a5, out a1, out a2_2340, out a3_2341, out a4_2342, out a5);
								if (a0_577 != 0x00)
								{
l230900B6:
									if (a0_577 != ~0x020004FF)
										goto l2308FEE2;
									goto l23090094;
								}
								Eq_2 a5_590 = (word32) *a5.u0;
								s7 += a5;
								struct Eq_525231 * a4_599;
								word32 a2_2350;
								word32 a3_2351;
								a0_577 = mbedtls_asn1_get_tag(s5_1308, fp + -0x0044, 0x06, a5_590, out a1, out a2_2350, out a3_2351, out a4_599, out a5);
								if (a0_577 != 0x00)
									goto l230900B6;
								a5 = s5_1308 - (a5 + a4_599);
								if (a5 <= 0x00)
								{
l23090380:
									goto l2308FEE2;
								}
								Eq_2 s0_617 = mbedtls_asn1_get_bool(s7, fp + -0x0078, a5, out s1_1012, out a0_577, out a1, out a5);
								if (a0_577 != 0x00)
								{
									a5.u0 = -98;
									if (a0_577 == -98)
										goto l23090102;
									goto l230900B6;
								}
l23090102:
								Eq_2 a2_633;
								word32 a4_2353;
								word32 a3_2352;
								a0_577 = mbedtls_asn1_get_tag(s7, fp + -0x007C, 0x04, a5, out a1, out a2_633, out a3_2352, out a4_2353, out a5);
								if (a0_577 != 0x00)
									goto l230900B6;
								word32 s0_1321 = s0_617 + a5;
								if (s7 != s0_1321)
									goto l230902B8;
								word32 a0_644;
								s1_1012 = mbedtls_oid_get_x509_ext_type(fp + -72, fp + -116, a2_633, a5, s6, out a0_644, out a1, out a5, out s2_458);
								if (a0_644 != 0x00)
								{
									if (a5 == 0x00)
										continue;
l2309012C:
									goto l2308FEE2;
								}
								int32 a4_653 = *((word32) s1_1012 + 0x00F8);
								if ((a4_653 & a5) != 0x00)
								{
l23090388:
									goto l2308FEE2;
								}
								Eq_2 a0_665;
								*((word32) s1_1012 + 0x00F8) = a4_653 | a5;
								if (a5 == 0x0100)
								{
									*((word32) s1_1012 + 252) = 0x00;
									*((word32) s1_1012 + 0x0100) = 0x00;
									word32 a2_2354;
									word32 a4_2356;
									word32 a3_2355;
									a0_665 = mbedtls_asn1_get_tag(s7, fp + -60, 48, a5, out a1, out a2_2354, out a3_2355, out a4_2356, out a5);
									if (a0_665 != 0x00)
										goto l230901B8;
									if (s0_1321 == a5)
										continue;
									s7 = (word32) s1_1012 + 252;
									Eq_2 s0_684 = mbedtls_asn1_get_bool(s0_1321, (word32) s1_1012 + 252, a5, out s1_1012, out a0_665, out a1, out a5);
									if (a0_665 != 0x00)
									{
										a5.u0 = -98;
										if (a0_665 != -98)
											goto l230901B8;
										word32 a4_2367;
										word32 a3_2366;
										s0_684 = mbedtls_asn1_get_int(s0_684, (word32) s1_1012 + 252, -98, out s1_1012, out a0_665, out a1, out a3_2366, out a4_2367, out a5);
										if (a0_665 != 0x00)
											goto l230901B8;
										a5 = *((word32) s1_1012 + 252);
										if (a5 != 0x00)
										{
											*((word32) s1_1012 + 252) = 0x01;
											a5.u0 = 0x01;
										}
									}
									if (s0_684 == a5)
										continue;
									word32 a4_2369;
									word32 a3_2368;
									Eq_2 s0_724 = mbedtls_asn1_get_int(s0_684, (word32) s1_1012 + 0x0100, a5, out s1_1012, out a0_665, out a1, out a3_2368, out a4_2369, out a5);
									if (a0_665 == 0x00)
									{
										if (s0_724 != a5)
											goto l230902B8;
										word32 a5_730 = *((word32) s1_1012 + 0x0100);
										*((word32) s1_1012 + 0x0100) = a5_730 + 0x01;
										a5 = a5_730 + 0x01;
										continue;
									}
l230901B8:
									if (a0_665 != ~0x020004FF)
										goto l2308FEE2;
									continue;
								}
								if (a5 <= 0x0100)
								{
									if (a5 != 0x04)
									{
										if (a5 != 32)
										{
l23090162:
											goto l2308FEE2;
										}
										struct Eq_525388 * a4_832;
										word32 a3_2359;
										word32 a2_2358;
										a0_665 = mbedtls_asn1_get_tag(s7, fp + -112, 48, a5, out a1, out a2_2358, out a3_2359, out a4_832, out a5);
										if (a0_665 == 0x00)
										{
											0x00 = dwArg0144;
											a5 += a4_832;
											if (s0_1321 != a5)
												goto l230902B8;
											s7 = (word32) s1_1012 + 232;
											int32 s8_1326 = 0x0082;
											for (; a5 < s0_1321; a5 += a4_856)
											{
												if (s0_1321 - a5 <= 0x00)
													goto l23090380;
												int32 s9_846 = (word32) *a5;
												Eq_2 a3_853;
												word32 a2_2361;
												Eq_2 a4_856;
												a0_665 = mbedtls_asn1_get_len(s0_1321, fp + -60, a5 + 0x01, out a1, out a2_2361, out a3_853, out a4_856, out a5);
												if (a0_665 != 0x00)
													goto l230901B8;
												a5 = (int32) (byte) s9_846;
												if (a5 >= 0x00)
													goto l2309012C;
												if (s9_846 == s8_1326)
												{
													a5 = *((word32) s7 + 8);
													if (a5 != 0x00)
													{
														a5 = *((word32) s7 + 0x0C);
														if (a5 != 0x00)
															goto l23090388;
														word32 a3_2363;
														word32 s3_2364;
														word32 s4_2365;
														word32 a2_2362;
														ra = mycalloc(ra, s1_1012, 0x01, 0x10, a3_853, a4_856, a5, mstatus, dwLoc70, a5_590, dwArg88, dwArgC8, out s0_1321, out s1_1012, out a1, out a2_2362, out a3_2363, out a4_856, out a5, out s2_458, out s3_2364, out s4_2365, out s8_1326);
														*((word32) s7 + 0x0C) = 0x01;
														if (false)
															goto l2308FEE2;
														s7.u0 = 0x01;
													}
													*s7 = s8_1326;
													*((word32) s7 + 8) = a5;
													*((word32) s7 + 4) = a4_856;
												}
												s5_1308 = ra;
											}
											*((word32) s7 + 0x0C) = 0x00;
											if (s0_1321 != a5)
												goto l230902B8;
											continue;
										}
									}
									else
									{
										Eq_2 a2_793;
										word32 a4_2357;
										s1_1012 = mbedtls_asn1_get_bitstring(s7, fp + -60, a5, s6, out a0_665, out a1, out a2_793, out a4_2357, out a5, out s2_458);
										if (a0_665 == 0x00)
										{
											s5_1308 = s0_124;
											if (a2_793 != 0x00)
											{
												*((word32) s1_1012 + 260) = 0x00;
												a5.u0 = 0x00;
												a1.u0 = 0x04;
												do
												{
													Mem817[s1_1012 + 260:word32] = Mem809[s1_1012 + 260:int32] | CONVERT(Mem809[a0_665 + a5:byte], byte, word32) << (a5 << 0x03);
													++a5;
												} while (a2_793 != a5 && a5 != 0x04);
												continue;
											}
l23090236:
											goto l2308FEE2;
										}
									}
									goto l230901B8;
								}
								if (a5 == ~0x07FF)
								{
									ra = mbedtls_asn1_get_sequence_of(ra, s7, (word32) s1_1012 + 264, 0x06, a5, mstatus, dwArg58, dwArg98, out s1_1012, out a0_665, out a1, out a5, out s2_458, out s5_1308);
									if (a0_665 != 0x00)
										goto l230901B8;
									a5 = *((word32) s1_1012 + 272);
									if (a5 != 0x00)
										continue;
									goto l23090236;
								}
								if (a5 != 0x10000000)
									goto l23090162;
								word32 a4_773;
								word32 a2_2360;
								s1_1012 = mbedtls_asn1_get_bitstring(s7, fp + -60, a5, s6, out a0_665, out a1, out a2_2360, out a4_773, out a5, out s2_458);
								if (a0_665 != 0x00)
									goto l230901B8;
								s5_1308 = ra;
								a5.u0 = 0x01;
								if (a4_773 != 0x01)
									goto l23090236;
								a5 = (word32) *(union Eq_2 *) 0x01;
								*((word32) s1_1012 + 0x0118) = (byte) a5;
							}
							if (s5_1308 != a5)
							{
l230902B8:
								goto l2308FEE2;
							}
l2308FFE4:
							Eq_2 a0_961;
							Eq_2 a2_963;
							Eq_2 s2_970;
							s1_1012 = mbedtls_x509_get_alg(s2_458, fp + -84, fp + -96, a5, dwArg14, dwArg88, out a0_961, out a1, out a2_963, out a5, out s2_970, out s3);
							if (a0_961 == 0x00)
							{
								Eq_2 s1_1119 = *((word32) a2_963 + 44);
								ra = dwArg54;
								if (a2_963 != a5)
								{
l2308FFFE:
									word32 s0_2345;
									word32 a0_2346;
									ra = mbedtls_x509_crt_free(dwArg54, s1_1119, a1, a5, mstatus, dwArgA8, dwArgE8, out s0_2345, out s1_1012, out a0_2346, out a1, out a2, out a5, out s2, out s3, out s4_1114, out s8);
									s0_1018 = ~0x0200067F;
l2308FDC2:
									if (s3 == 0x00)
									{
l2308FDCA:
										if (s4_1114 == s1_1012)
											goto l2308FE3E;
l23090368:
										word32 a3_2298;
										word32 a0_2297;
										word32 a4_2299;
										word32 t3_2302;
										word32 s4_2301;
										word32 a6_2300;
										word32 s1_2296;
										vPortFree(s1_1012, a2, a5, mstatus, dwArgC8, dwArg0108, out s0_1018, out s1_2296, out a0_2297, out a1, out a2, out a3_2298, out a4_2299, out a5, out a6_2300, out s4_2301, out t3_2302);
										goto l2308FE3E;
									}
l2308FDC6:
									*((byte) s3.u0 + 304) = 0x00;
									goto l2308FDCA;
								}
								s1_1119 = *((word32) a0_961 + 48);
								Eq_2 a2_986;
								word32 a4_2344;
								word32 a3_2343;
								Eq_2 a0_981 = memcmp(a0_961, a1, a2_963, out a1, out a2_986, out a3_2343, out a4_2344, out a5);
								if (a0_981 != 0x00 || a2_986 != a5)
									goto l2308FFFE;
								if (a2_986 != 0x00)
								{
									word32 a4_2349;
									word32 a3_2348;
									word32 a2_2347;
									if (memcmp(a0_981, a1, dwArgC4, out a1, out a2_2347, out a3_2348, out a4_2349, out a5) != 0x00)
										goto l2308FFFE;
								}
								ptr32 a0_1004;
								s1_1012 = mbedtls_x509_get_sig(s2_970, a5, out a0_1004, out a1, out a2, out a5, out s2, out s8);
								s0_1018 = a0_1004;
								if (a0_1004 == 0x00)
								{
									if (s2 != a5)
										goto l2308FDDA;
l2308FE3E:
									Eq_519072 s9_1299 = *((word32) dwLoc48 + 408);
									ptr32 s5_1300 = *((word32) dwLoc48 + 440);
									s0Out = s0_1018;
									a0Out = dwLoc8C;
									a1Out = a1;
									a2Out = a2;
									a4Out = dwLoc70;
									a5Out = a5;
									s2Out = s2;
									s3Out = s3;
									s5Out = s5_1300;
									s6Out = s6;
									s7Out = s7;
									s8Out = s8;
									s9Out = s9_1299;
									s10Out = s10;
									s11Out = s11;
									mstatusOut = mstatus;
									return ra;
								}
							}
							goto l2308FEE2;
						}
						a5.u0 = -98;
						if (a0_547 != -98)
							goto l2308FEE2;
					}
l23090094:
					if (s5_1308 != a5)
						goto l2308FDDA;
					goto l2308FFE4;
				}
				if (s5_1308 != a5 + ~0x01)
				{
					word32 a5_483 = CONVERT(Mem429[a5 + ~0x01:byte], byte, word32);
					*((word32) s1_1012 + 0x00C4) = a5_483;
					word32 a5_495;
					word32 a2_2335;
					word32 a3_2336;
					word32 a4_2337;
					Eq_2 a0_489 = mbedtls_asn1_get_tag(s5_1308, (word32) s1_1012 + 200, 161, a5_483, out a1, out a2_2335, out a3_2336, out a4_2337, out a5_495);
					if (a0_489 != 0x00)
					{
						a5.u0 = -98;
						if (a0_489 != -98)
							goto l2308FEE2;
					}
					else
					{
						int32 a4_498 = *((word32) s1_1012 + 200);
						*((word32) s1_1012 + 0x00CC) = a5_495;
						a5 = a5_495 + a4_498;
					}
					s1_1012 = *((byte) a5.u0 + 24);
					a4_480 = (struct Eq_525028 *) 0x01;
					a5_481 = a5 + ~0x01;
					if (a5_481 > 0x01)
						goto l2308FFBA;
				}
				a4_480 = (struct Eq_525028 *) 0x01;
				if (s5_1308 == a5_481)
					goto l2308FFBA;
				Eq_2 a5_515 = (word32) *a5_481;
				*((word32) s1_1012 + 0x00D0) = a5_515;
				word32 a5_528;
				word32 a2_2338;
				word32 a3_2339;
				Eq_2 a0_522 = mbedtls_asn1_get_tag(s5_1308, (word32) s1_1012 + 212, 0x00A2, a5_515, out a1, out a2_2338, out a3_2339, out a4_480, out a5_528);
				if (a0_522 == 0x00)
				{
					a4_480 = (struct Eq_525028 *) *((word32) s1_1012 + 212);
					*((word32) s1_1012 + 0x00D8) = a5_528;
					goto l2308FFBA;
				}
				a5.u0 = -98;
				if (a0_522 == -98)
					goto l2308FFBA;
			}
		}
	}
l2308FEE2:
	word32 a0_2322;
	ra = mbedtls_x509_crt_free(ra, s1_1012, a1, a5, mstatus, dwArgA8, dwArgE8, out s0_1018, out s1_1012, out a0_2322, out a1, out a2, out a5, out s2, out s3, out s4_1114, out s8);
	goto l2308FDC2;
}

